{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "53292501",
    "original_query": "I want a comprehensive report on the features for Mahindra XUV 3XO, and you must also include a detailed analysis of the luxury and safety features.",
    "file_manifest": [],
    "created_at": "2025-07-23T17:41:41.644507",
    "status": "running",
    "output_chain": {
      "T001": {
        "xuv_3xo_data": [
          {
            "type": "text",
            "text": "[{'url': 'https://auto.mahindra.com/suv/xuv3xo/X3XO.html', 'content': \"Mahindra XUV 3XO - Price, Specifications, Colors & Images Skip to main content Skip to footer content SUVs THAR ROXX 12.99L - 23.39L Book Now Book Now Explore Explore XUV 3XO 7.99L - 15.80L Book Now Book Now Explore Explore SCORPIO-N 13.99L - 25.62L Book Now Book Now Explore Explore XUV700 14.49L - 25.14L Book Now Book Now Explore Explore THAR 11.50L - 17.62L Book Now Book Now Explore Explore SCORPIO CLASSIC 13.77L - 17.72L Book Now Book Now Explore Explore BOLERO NEO 9.97L - 12.18L Book Now Book Now Explore Explore BOLERO NEO PLUS 11.41L - 14.06L Explore Explore BOLERO 9.81L - 10.93L Book Now Book Now Explore Explore XUV400 17.49L Book Now Book Now Explore Explore MARAZZO 14.59L - 17.00L Book Now Book Now Explore Explore Explore All SUVs Explore All SUVs News Contact Us Menu Build your car Test Drive Buy Buy Book Now Exchange Finance Subscribe a Vehicle Owner's Zone Owner's Zone Owner's Action Owner's Action My Dashboard Service Cost Calculator Locate Service Center Renewals Renewals Roadside Assistance Owner's Manual Care & Maintenance Important Notifications Important Notifications Service Action Adventure Adventure Club Events Expeditions Off-Road Academy Gallery Locate a Dealer Global Markets Language News Contact us Switch theme Dark Light Home XUV 3XO Know More Know More Show more Show less Show more Show less Everything you want & more Book now Book now Show more Show less Register for the latest news and exclusive updates. Stay informed Stay informed For any assistance call us on 1800 209 6006 1800 209 6006 Social links SUVs SUVs Explore All SUVs Thar Roxx Scorpio-N XUV700 XUV 3XO Thar XUV 400 Scorpio Classic Bolero Neo Bolero Bolero Neo Plus Marazzo PIK-UPs PIK-UPs Veero Maxx City Maxx HD Bolero Pik-up Bolero Camper ABOUT ABOUT About us Press Releases Stories Media kit Careers QMS Certificate OWNER OWNER Service Adventure Merchandise & Gear - Eshop Parts and accessories- Eshop Care & Maintenance Owners manual QMS Certificate customer service customer service Contact us FAQs Talk to an expert Dealer Locator Corporate Sales Enquiry Sitemap Sitemap QMS Certificate quick links quick links Vehicle configurator Test Drive Book Online Calculators Exchange Finance Scrappage Subscribe a vehicle Become a Dealer Download the M4U app now! Lets connect on Whatsapp Chat now Chat now Mahindra Corporate Terms & Conditions Our Privacy Policy Copyright 2025 Mahindra & Mahindra Ltd\", 'images': [{'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dw95797f68/images/SCRC/large/ScorpioClassic_602x339.png?sw=360&sh=202', 'alt_text': 'SCORPIO CLASSIC', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dwc6625064/images/NEOP/large/BoleroNeoPlus_602x339.png?sw=360&sh=202', 'alt_text': 'BOLERO NEO PLUS', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUO 3XO REVX', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUV 3XO Earn 5-Star Bharat-NCAP Rating', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://www.carwale.com/mahindra-cars/xuv-3xo/', 'content': \"Mahindra XUV 3XO Price - Images, Colours & Reviews - CarWale Overview 360 View Variants Offers Expert Opinion Similar Cars Colours Mileage User Reviews News Expert Reviews Videos Images FAQs Overview 360 View Variants Offers Expert Opinion Similar Cars Colours Mileage User Reviews News Expert Reviews Videos Images FAQs Colours Images Shorts View Mahindra XUV 3XO 3.9 Expert Rating | 4.6 User Rating (559) Rate & Win The Mahindra XUV 3XO offers a sorted ride and engaging drive, ample space, and modern-day equipment. While its boot space is limited, it isn't a deal-breaker, especially considering the compact SUVs attractive pricing. It is available with both petrol and diesel power. Variant Select Variant City Show price in my city Rs. 7.99 - 15.80 Lakh XUV 3XO On Road Price Ex-Showroom price, Mumbai Calculate your EMI EMI Calculator Get Price Details on WhatsApp AD 4 Things to Know About XUV 3XO Has projector headlamps, 17-inch alloys and a 360-degree camera. The instrument cluster is fully digital with customisable screens. Top-spec versions get dual-zone climate control with rear AC vents. One of the USPs of the Mahindra XUV 3XO is level-2 ADAS Mahindra XUV 3XO Styling Tour Explore Ad Recommended Toyota Urban Cruiser Taisor Rs. 7.77 Lakh onwards Avg. Ex-Showroom price Powerful TURBO engine meets stylish design. 1.0L Turbo Engine 100PS Power See more with 360 Camera + HUD 16-inch Diamond-Cut Alloys Wireless Apple CarPlay & Android Auto Mahindra XUV 3XO Price Mahindra XUV 3XO price for the base model starts at Rs. 7.99 Lakh and the top model price goes upto Rs. 15.80 Lakh (Avg. ex-showroom). XUV 3XO price for 29 variants is listed below. Filter By Fuel type & Transmission Petrol Diesel Manual Automatic (TC) Automatic (AMT) Variants Ex-Showroom price XUV 3XO MX1 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Get Offers from Dealers Rs. 7.99 Lakh Compare Just Launched XUV 3XO REVX M 1.2 Petrol 1197 cc, Petrol, Manual, 110 bhp Get Offers from Dealers Rs. 8.94 Lakh Compare Just Launched XUV 3XO REVX M (O)1.2 Petrol 1197 cc, Petrol, Manual, 110 bhp Get Offers from Dealers Rs. 9.44 Lakh Compare XUV 3XO MX2 Pro 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Get Offers from Dealers Rs. 9.54 Lakh Compare XUV 3XO MX3 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.74 Lakh XUV 3XO MX3 Pro 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.99 Lakh XUV 3XO MX2 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 9.99 Lakh XUV 3XO MX2 Pro 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 10.54 Lakh XUV 3XO MX2 Pro 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 10.64 Lakh XUV 3XO AX5 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 10.99 Lakh XUV 3XO MX3 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 10.99 Lakh XUV 3XO MX3 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 11.40 Lakh XUV 3XO MX3 Pro 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 11.56 Lakh XUV 3XO MX3 Pro 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 11.69 Lakh XUV 3XO MX3 1.5 Diesel Autoshift Plus 1497 cc, Diesel, Automatic (AMT), 21.2 kmpl, 115 bhp Rs. 11.79 Lakh Just Launched XUV 3XO REVX A 1.2 Petrol MT 1197 cc, Petrol, Manual, 129 bhp Rs. 11.79 Lakh XUV 3XO AX5 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 12.19 Lakh XUV 3XO AX5 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 12.49 Lakh XUV 3XO AX5L 1.2 Petrol 1197 cc, Petrol, Manual, 20.1 kmpl, 129 bhp Rs. 12.62 Lakh XUV 3XO AX7 1.2 Petrol 1197 cc, Petrol, Manual, 20.1 kmpl, 129 bhp Rs. 12.80 Lakh XUV 3XO AX5 1.5 Diesel Autoshift Plus 1497 cc, Diesel, Automatic (AMT), 21.2 kmpl, 115 bhp Rs. 12.99 Lakh Just Launched XUV 3XO REVX A 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 129 bhp Rs. 12.99 Lakh XUV 3XO AX7 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 13.69 Lakh XUV 3XO AX5L 1.2 Petrol AT 1197 cc, Petrol, Aut\", 'images': [{'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-right-front-three-quarter-34.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Right Front Three Quarter', 'title': 'Mahindra XUV 3XO Right Front Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'eager', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-right-front-three-quarter-32.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Right Front Three Quarter', 'title': 'Mahindra XUV 3XO Right Front Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-left-side-view.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Left Side View', 'title': 'Mahindra XUV 3XO Left Side View', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-front-view-39.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Front View', 'title': 'Mahindra XUV 3XO Front View', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-interior-instrument-cluster.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Instrument Cluster', 'title': 'Mahindra XUV 3XO Instrument Cluster', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 2}, {'url': 'https://www.cartrade.com/mahindra-cars/xuv-3xo/', 'content': 'Mahindra XUV 3XO - XUV 3XO Price, Specs, Images, Colours Trending Search Mahindra XUV 3XO Variants MX1 REVX M REVX M (O) MX2 Pro MX3 MX3 Pro MX2 AX5 REVX A AX5L AX7 AX7L Cars Similar to Mahindra XUV 3XO Tata Nexon 8.0 - 15.6 Lakh Kia Sonet 8.0 - 15.7 Lakh Maruti Suzuki Brezza 8.7 - 14.1 Lakh Skoda Kylaq 8.3 - 14.0 Lakh Kia Syros 9.5 - 17.8 Lakh New Cars Popular Cars Hyundai \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tCreta Mahindra \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tXUV 3XO Mahindra \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tScorpio N Maruti Suzuki \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tBrezza Toyota \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tUrban Cruiser Hyryder View All Popular Cars New Car Launches Renault \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tTriber MG \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tM9 EV Search By Price Upto 5 Lakh 5 Lakh - 8 Lakh 6 Lakh - 10 Lakh 8 Lakh - 12 Lakh 10 Lakh - 15 Lakh Find Your Car Popular Brands Maruti Suzuki Mahindra Tata Hyundai Toyota View All Brands Upcoming \\t\\t\\t\\t\\t\\t\\t\\t\\t\\tCars Electric \\t\\t\\t\\t\\t\\t\\t\\t\\t\\tCars Compare \\t\\t\\t\\t\\t\\t\\t\\t\\t\\tCars Emi \\t\\t\\t\\t\\t\\t\\t\\t\\t\\tCalculator Used Cars By City Delhi \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tNCR Mumbai Bangalore Hyderabad Chennai All Cities By Model Maruti \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tSuzuki Swift Maruti Suzuki Wagon R Honda City Hyundai Creta Maruti Suzuki Baleno All Models By Brand Maruti \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tSuzuki Hyundai Volkswagen Tata Toyota Honda Explore Used \\t\\t\\t\\t\\t\\t\\t\\t\\t\\tCars CarWale abSure Used Car Valuation My \\t\\t\\t\\t\\t\\t\\t\\t\\t\\tListings Find Dealers Car Loan Sell Car News & Reviews Download Mobile App Select Your City Mumbai Borivali User Current Location Confirm Location Popular Cities Mumbai Bangalore Delhi Pune Hyderabad Kolkata Lucknow Chennai Ahmedabad Chandigarh All Cities Select Your Variant No variant available XUV 3XO Price Variants Expert Review Similar Cars Mileage Images Colours User Reviews News FAQs Used Mahindra Cars Mahindra XUV 3XO 4.86 7 Reviews Write a review Equipped with a torquey mStallion Turbo Charged Intercooled Gasoline Direct Injection engine, delivering 129 bhp and 230 Nm of torque, ensuring a responsive driving experience. Features a smooth 6-speed automatic transmission, enhancing driving comfort and ease, particularly in urban settings. Offers impressive fuel efficiency with a mileage of 18.2 km/l, making it a practical choice for daily commuting and long drives. Stylish exterior design with modern LED lighting and a bold grille, complemented by a spacious and well-appointed interior featuring dual 10.25-inch screens for infotainment. Safety is prioritized with six airbags, advanced driver assistance systems (ADAS), and a robust build quality, contributing to a five-star safety rating expectation. Interior comfort is enhanced with leatherette upholstery, ample legroom, and a panoramic sunroof, creating a pleasant atmosphere for passengers. Competitive pricing and a feature-rich offering provide excellent value for money, positioning the XUV 3XO as a strong contender in the compact SUV segment. +More Images (78) Colours (16) 360 View VIEW ALL IMAGES Compare colours with similar cars Citrine Yellow Exterior Interior Open Door XUV 3XO Price XUV 3XO price starts from 7.99 Lakh and goes up to 15.80 Lakh. XUV 3XO EMI starts from 16,201. Select city to check Mahindra XUV 3XO on-road price. +More Variant All Variants City Not Selected 7.99 - 15.80 Lakh Get Best Price Avg. Ex-Showroom price Monthly EMI Price Break-up Get EMI Offers XUV 3XO All Variants EMI 16,201 for 5 Years Down Payment Loan Tenure ( Months ) Yr Mo Bank Interest Rate % Expand \\t\\t\\t\\tEMI Calculator Ex-Showroom Price This price includes GST and any state/city entry tax. \\t\\t\\t\\t\\t\\t\\tHowever, the ex-showroom price does not include RTO, Insurance, Fast tag, and other accessories cost 0 Registration Charges Road Tax or registration tax This varies from city to city. 0 Insurance The insurance cost on CarTrade covers 1-year comprehensive \\t\\t\\t\\t\\t\\t\\tinsurance cost with 95% IDV and 3-year third-party insurance cost. IDV - it is the max amount you will receive if your vehicle is stolen or completely damaged. Third-party insurance - If you met with an accident with another vehicle, third-party insurance \\t\\t\\t\\t\\t\\t\\tcovers cost a', 'images': [{'url': 'https://imgd-ct.aeplcdn.com/664x374/n/cw/ec/107807/brezza-right-front-three-quarter-2.jpeg?isig=0&q=80', 'alt_text': 'Maruti Suzuki Brezza', 'title': 'Maruti Suzuki Brezza', 'width': '284', 'height': '160', 'class': 'similar-car-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://imgd-ct.aeplcdn.com/664x374/n/cw/ec/171817/kylaq-right-front-three-quarter.jpeg?isig=0&q=80', 'alt_text': 'Skoda Kylaq', 'title': 'Skoda Kylaq', 'width': '284', 'height': '160', 'class': 'similar-car-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://imgd-ct.aeplcdn.com/664x374/n/cw/ec/141147/venue-right-front-three-quarter.jpeg?isig=0&q=80', 'alt_text': 'Hyundai Venue', 'title': 'Hyundai Venue', 'width': '284', 'height': '160', 'class': 'similar-car-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://imgd-ct.aeplcdn.com/664x374/n/cw/ec/132561/taisor-right-front-three-quarter.png?isig=0&q=80', 'alt_text': 'Toyota Urban Cruiser Taisor', 'title': 'Toyota Urban Cruiser Taisor', 'width': '284', 'height': '160', 'class': 'similar-car-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://imgd-ct.aeplcdn.com/664x374/n/cw/ec/130635/fronx-right-front-three-quarter-2.jpeg?isig=0&q=80', 'alt_text': 'Maruti Suzuki Fronx', 'title': 'Maruti Suzuki Fronx', 'width': '284', 'height': '160', 'class': 'similar-car-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 3}, {'url': 'https://www.mahindra.com/news-room/press-release/en/mahindra-launches-the-xuv-3xo-the-new-disruptor-in-compact-suvs', 'content': 'Mahindra launches the XUV 3XO the New Disruptor in compact SUVs Skip to main content Who We Are Our Purpose Drive positive change in the lives of our communities. Only when we enable others to rise will we rise. #TogetherWeRise Purpose Led Performance Driven Future Ready Leadership Our History Museum What we do Key Facts 20+ Industries 100+ Countries 324K+ Employees Industries Automotive SUVs LCVs Last Mile Mobility Iconic Motorcycles Trucks And Buses Farm Equipments Tractors Agri Services Farm Machinery Financial Services Technology Services Hospitality Logistics Real Estate Renewables Other Emerging Businesses Advanced Technologies (Defence) Aerostructures Aftermarkets (Pre-Owned Cars) Auto Components and Recycling Power Generation Retail Our Brands Global Presence Cultural Outreach Investor Relations Investor Relations Group highlights. 18% Consolidated ROE 1592 B+ Revenue 129 B+ PAT 3.31 T+ Market cap as on date Disclosures Under Regulation 46 And 62 Of SEBI (LODR) Reports Policies Regulatory Filings Sustainability newsroom Newsroom Tech Mahindra Joins J.P. Morgans Payments System Integrator Program to Accelerate Innovation in Payments System 22 July 2025 Technology Mahindra Industrial Park, Sumitomo Corporation Sign Strategic Cooperation Agreement with Osaka Government to Support Japanese Businesses Entering India 21 July 2025 Real Estate Press Releases Media Resources In The News careers careers Committed to elevate the lives of communities, guided by our core behaviours and values. Bold. Agile. Collaborative. Find A Job SOAR - Seamless Opportunity For Amazing Returnship Leadership Programs Mahindra Leadership Program Mahindra Accelerated Leadership Track Mahindra Future Shapers Mahindra Leadership University Tech Opportunities Mahindra Digital Engine Submit Popular Keywords: Business FY 21 Brands XUV700 Global Nanhi Kali Recommended for you: Annual Report 2021 - 2022 Leadership Announcement Latest Press Release Brand Guidelines Mahindra launches the XUV 3XO the New Disruptor in compact SUVs Auto Home Newsroom Press Release Mahindra launches the XUV 3XO the New Disruptor in compact SUVs Author : mahindraadmin Category : Auto Published : 4/29/2024 Prices start at 7.49 Lakh Disrupting the category: The XUV 3XO disrupts with 6+1 key pillars: Turn on Design: Bold, athletic silhouette that commands attention Ivory colour interiors wrapped with a Soft touch leatherette dashboard and door trims SUV Command Seating: Best-in-class forward visibility of 23.7that matches with XUV 700 Command seating position with eye level at 1398 mm above the ground R17 Alloy Wheels and water wading depth of 350 mm Safe Cocoon: 35 standard safety features including 6 airbags, ESC with Hill Hold Control (HHC) & All 4 Disc Brakes and more Engineered to meet the highest B-NCAP safety rating Drive of Your Life: World-class turbocharged engines with best-in-class Torque of 230 Nm (1.2 L TDGi) and 300 Nm (1.5 L Diesel) 6-speed AISIN 3rd Gen Automatic Transmission Thrilling acceleration of 0 to 60 km/h in 4.5 s (1.2 L TGDi) and best-in-class mileage of 20.1 km/l* (1.2 L TGDi MT) Ride of Your Life: First-in-segment MTV-CL (Multi-Tuned Valve Concentric Land) technology Advanced suspension system with MacPherson Strut Fully Independent Front Suspension and a Twist Beam Semi-independent Rear Suspension Quietness of gasoline matching XUV 700 gasoline Space where it counts: Best-in-class wheelbase, occupant space, and legroom Spacious cargo area measuring 364 L**, further expanded with standard 60:40 split seats to maximise storage capacity. Sci-Fi Technology First-in-segment: SkyroofTM, Dual Zone Climate Control, 65 W USB-C charging, Electronic Parking brake with Auto Hold, 3 Smart Steering Modes, Level 2 ADAS (1R1V) 3XO is also equipped with Twin HD Screens one 26.03 cm infotainment and the other 26.03 cm full digital cluster, Harman Kardon Premium Audio with amplifier & Sub-woofer, 360-degree surround view system with blind view monitor Mumbai, Apri', 'images': [], 'rank': 4}, {'url': 'https://www.cardekho.com/mahindra/xuv-3xo/specs', 'content': \"Mahindra XUV 3XO Specifications - Dimensions, Configurations, Features, Engine cc All New Used Ad English Login / Register NEW CARS Explore New Cars Electric Cars Tesla Model Y Mahindra BE 6 Tata Harrier EV MG Windsor EV Mahindra XEV 9e MG M9 All Electric Cars Popular Cars Defender Hyundai Creta Mahindra Thar ROXX Mahindra Scorpio Tata Nexon Maruti Swift All Popular Cars Upcoming Cars New Launches Car Insurance Ad Popular Brands Maruti Cars Tata Cars Kia Cars Toyota Cars Hyundai Cars Mahindra Cars Compare Cars New Car Offers & Discounts Find Car Dealers Find EV Charging Stations Find Fuel Stations Check Fuel Prices Used cars Buy Used Cars Used Cars In Your City Ahmedabad Bangalore Chennai Delhi NCR Hyderabad Jaipur Kolkata Mumbai Pune More Cities Sell My Car Used Car Valuation Dealership Near Me News & Reviews News & Top stories Car Expert Reviews User Reviews Car Collection Tips & Advice Videos Video Reviews Visual Stories Select City Ad XUV 3XO Price Compare Offers Images Specs User Reviews 360 View Variants More Videos Mileage Colours XUV 3XO News FAQs Dealers Service Center Brochure XUV 3XO EMI Loan Second Hand XUV 3XO Mahindra XUV 3XO Specifications The Mahindra XUV 3XO has 1 Diesel Engine and 1 Petrol Engine on offer. The Diesel engine is 1498 cc while the Petrol engine is 1197 cc . It is available with Manual & Automatic transmission.Depending upon the variant and fuel type the XUV 3XO has a mileage of 17.96 to 20.6 kmpl. The XUV 3XO is a 5 seater 3 cylinder car and has length of 3990 mm, width of 1821 mm and a wheelbase of 2600. Read More 4.6 304 Reviews Shortlist Rs. 7.99 - 15.80 Lakh * EMI starts @ 21,545 View July Offers Ad Standout features of Mahindra XUV 3XO Soft touch material on dashboard and door pads. Panoramic sunroof - largest in the segment. Level 2 ADAS with features such as forward collision warning, adaptive cruise control. 1.2-litre turbo-petrol engine makes 130PS/230Nm most powerful in its class. Key specifications of Mahindra XUV 3XO ARAI Mileage 18.2 kmpl Fuel Type Petrol Engine Displacement 1197 cc No. of Cylinders 3 Max Power 128.73bhp@5000rpm Max Torque 230Nm@1500-3750rpm Seating Capacity 5 Transmission Type Automatic Boot Space 364 Litres Fuel Tank Capacity 42 Litres Body Type SUV Key features of Mahindra XUV 3XO Power Steering Yes Power Windows Front Yes Anti-lock Braking System (ABS) Yes Air Conditioner Yes Driver Airbag Yes Passenger Airbag Yes Automatic Climate Control Yes Alloy Wheels Yes Multi-function Steering Wheel Yes Mahindra XUV 3XO specifications Engine & Transmission Engine Type mStallion (TGDi) engine Displacement 1197 cc Max Power 128.73bhp@5000rpm Max Torque 230Nm@1500-3750rpm No. of Cylinders 3 Valves Per Cylinder 4 Turbo Charger Yes Transmission Type Automatic Gearbox 6-Speed AT Drive Type FWD Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Fuel & Performance Fuel Type Petrol Petrol Mileage ARAI 18.2 kmpl Petrol Fuel Tank Capacity 42 Litres Emission Norm Compliance BS VI 2.0 Report Incorrect Specs Suspension, Steering & Brakes Front Suspension MacPherson Strut suspension Rear Suspension Rear twist beam Steering Type Electric Turning Radius 5.3 m Front Brake Type Disc Rear Brake Type Disc Alloy Wheel Size Front 17 Inch Alloy Wheel Size Rear 17 Inch Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Dimensions & Capacity Length 3990 mm Width 1821 mm Height 1647 mm Boot Space 364 Litres Seating Capacity 5 Wheel Base 2600 mm No. of Doors 5 Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Comfort & Convenience Power Steering Air Conditioner Heater Height Adjustable Driver Seat Ventilated Seats Electric Adjustable Seats Automatic Climate Control Accessory Power Outlet Rear Reading Lamp Adjustable Headrest Rear Seat Centre Arm Rest Height Adjustable Front Seat Belts Rear AC Vents Cruise Control Parking Sensors Front & Rear Real-Time Vehicle Tracking Foldable Rea\", 'images': [{'url': 'https://stimg.cardekho.com/images/carexteriorimages/630x420/Mahindra/XUV-3XO/10184/1751288551835/front-left-side-47.jpg?tr=w-230', 'alt_text': 'Mahindra XUV 3XO Specifications', 'title': 'Mahindra XUV 3XO Specifications', 'width': '230', 'height': '153', 'loading': 'eager', 'confidence': 0.9999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Soft touch material on dashboard and door pads.', 'title': 'XUV 3XO Soft touch material on dashboard and door pads.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Panoramic sunroof - largest in the segment.', 'title': 'XUV 3XO Panoramic sunroof - largest in the segment.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Level 2 ADAS with features such as forward collision warning, adaptive cruise control.', 'title': 'XUV 3XO Level 2 ADAS with features such as forward collision warning, adaptive cruise control.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO \\u20601.2-litre turbo-petrol engine makes 130PS/230Nm — most powerful in its class.', 'title': 'XUV 3XO \\u20601.2-litre turbo-petrol engine makes 130PS/230Nm — most powerful in its class.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 5}, {'url': 'https://www.autocarindia.com/auto-features/mahindra-xuv-3xo-price-variants-features-explained-431425', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://ackodrive.com/cars/mahindra-xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://en.wikipedia.org/wiki/Mahindra_XUV_3XO', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T006"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Gather general information about Mahindra XUV 3XO.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Retrieve comprehensive information about Mahindra XUV 3XO features and specifications from reputable online sources such as the manufacturer's website, automotive news sites, and review sites.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "completed",
      "output": {
        "xuv_3xo_data": [
          {
            "type": "text",
            "text": "[{'url': 'https://auto.mahindra.com/suv/xuv3xo/X3XO.html', 'content': \"Mahindra XUV 3XO - Price, Specifications, Colors & Images Skip to main content Skip to footer content SUVs THAR ROXX 12.99L - 23.39L Book Now Book Now Explore Explore XUV 3XO 7.99L - 15.80L Book Now Book Now Explore Explore SCORPIO-N 13.99L - 25.62L Book Now Book Now Explore Explore XUV700 14.49L - 25.14L Book Now Book Now Explore Explore THAR 11.50L - 17.62L Book Now Book Now Explore Explore SCORPIO CLASSIC 13.77L - 17.72L Book Now Book Now Explore Explore BOLERO NEO 9.97L - 12.18L Book Now Book Now Explore Explore BOLERO NEO PLUS 11.41L - 14.06L Explore Explore BOLERO 9.81L - 10.93L Book Now Book Now Explore Explore XUV400 17.49L Book Now Book Now Explore Explore MARAZZO 14.59L - 17.00L Book Now Book Now Explore Explore Explore All SUVs Explore All SUVs News Contact Us Menu Build your car Test Drive Buy Buy Book Now Exchange Finance Subscribe a Vehicle Owner's Zone Owner's Zone Owner's Action Owner's Action My Dashboard Service Cost Calculator Locate Service Center Renewals Renewals Roadside Assistance Owner's Manual Care & Maintenance Important Notifications Important Notifications Service Action Adventure Adventure Club Events Expeditions Off-Road Academy Gallery Locate a Dealer Global Markets Language News Contact us Switch theme Dark Light Home XUV 3XO Know More Know More Show more Show less Show more Show less Everything you want & more Book now Book now Show more Show less Register for the latest news and exclusive updates. Stay informed Stay informed For any assistance call us on 1800 209 6006 1800 209 6006 Social links SUVs SUVs Explore All SUVs Thar Roxx Scorpio-N XUV700 XUV 3XO Thar XUV 400 Scorpio Classic Bolero Neo Bolero Bolero Neo Plus Marazzo PIK-UPs PIK-UPs Veero Maxx City Maxx HD Bolero Pik-up Bolero Camper ABOUT ABOUT About us Press Releases Stories Media kit Careers QMS Certificate OWNER OWNER Service Adventure Merchandise & Gear - Eshop Parts and accessories- Eshop Care & Maintenance Owners manual QMS Certificate customer service customer service Contact us FAQs Talk to an expert Dealer Locator Corporate Sales Enquiry Sitemap Sitemap QMS Certificate quick links quick links Vehicle configurator Test Drive Book Online Calculators Exchange Finance Scrappage Subscribe a vehicle Become a Dealer Download the M4U app now! Lets connect on Whatsapp Chat now Chat now Mahindra Corporate Terms & Conditions Our Privacy Policy Copyright 2025 Mahindra & Mahindra Ltd\", 'images': [{'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dw95797f68/images/SCRC/large/ScorpioClassic_602x339.png?sw=360&sh=202', 'alt_text': 'SCORPIO CLASSIC', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dwc6625064/images/NEOP/large/BoleroNeoPlus_602x339.png?sw=360&sh=202', 'alt_text': 'BOLERO NEO PLUS', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUO 3XO REVX', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUV 3XO Earn 5-Star Bharat-NCAP Rating', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://www.carwale.com/mahindra-cars/xuv-3xo/', 'content': \"Mahindra XUV 3XO Price - Images, Colours & Reviews - CarWale Overview 360 View Variants Offers Expert Opinion Similar Cars Colours Mileage User Reviews News Expert Reviews Videos Images FAQs Overview 360 View Variants Offers Expert Opinion Similar Cars Colours Mileage User Reviews News Expert Reviews Videos Images FAQs Colours Images Shorts View Mahindra XUV 3XO 3.9 Expert Rating | 4.6 User Rating (559) Rate & Win The Mahindra XUV 3XO offers a sorted ride and engaging drive, ample space, and modern-day equipment. While its boot space is limited, it isn't a deal-breaker, especially considering the compact SUVs attractive pricing. It is available with both petrol and diesel power. Variant Select Variant City Show price in my city Rs. 7.99 - 15.80 Lakh XUV 3XO On Road Price Ex-Showroom price, Mumbai Calculate your EMI EMI Calculator Get Price Details on WhatsApp AD 4 Things to Know About XUV 3XO Has projector headlamps, 17-inch alloys and a 360-degree camera. The instrument cluster is fully digital with customisable screens. Top-spec versions get dual-zone climate control with rear AC vents. One of the USPs of the Mahindra XUV 3XO is level-2 ADAS Mahindra XUV 3XO Styling Tour Explore Ad Recommended Toyota Urban Cruiser Taisor Rs. 7.77 Lakh onwards Avg. Ex-Showroom price Powerful TURBO engine meets stylish design. 1.0L Turbo Engine 100PS Power See more with 360 Camera + HUD 16-inch Diamond-Cut Alloys Wireless Apple CarPlay & Android Auto Mahindra XUV 3XO Price Mahindra XUV 3XO price for the base model starts at Rs. 7.99 Lakh and the top model price goes upto Rs. 15.80 Lakh (Avg. ex-showroom). XUV 3XO price for 29 variants is listed below. Filter By Fuel type & Transmission Petrol Diesel Manual Automatic (TC) Automatic (AMT) Variants Ex-Showroom price XUV 3XO MX1 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Get Offers from Dealers Rs. 7.99 Lakh Compare Just Launched XUV 3XO REVX M 1.2 Petrol 1197 cc, Petrol, Manual, 110 bhp Get Offers from Dealers Rs. 8.94 Lakh Compare Just Launched XUV 3XO REVX M (O)1.2 Petrol 1197 cc, Petrol, Manual, 110 bhp Get Offers from Dealers Rs. 9.44 Lakh Compare XUV 3XO MX2 Pro 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Get Offers from Dealers Rs. 9.54 Lakh Compare XUV 3XO MX3 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.74 Lakh XUV 3XO MX3 Pro 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.99 Lakh XUV 3XO MX2 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 9.99 Lakh XUV 3XO MX2 Pro 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 10.54 Lakh XUV 3XO MX2 Pro 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 10.64 Lakh XUV 3XO AX5 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 10.99 Lakh XUV 3XO MX3 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 10.99 Lakh XUV 3XO MX3 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 11.40 Lakh XUV 3XO MX3 Pro 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 11.56 Lakh XUV 3XO MX3 Pro 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 11.69 Lakh XUV 3XO MX3 1.5 Diesel Autoshift Plus 1497 cc, Diesel, Automatic (AMT), 21.2 kmpl, 115 bhp Rs. 11.79 Lakh Just Launched XUV 3XO REVX A 1.2 Petrol MT 1197 cc, Petrol, Manual, 129 bhp Rs. 11.79 Lakh XUV 3XO AX5 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 12.19 Lakh XUV 3XO AX5 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 12.49 Lakh XUV 3XO AX5L 1.2 Petrol 1197 cc, Petrol, Manual, 20.1 kmpl, 129 bhp Rs. 12.62 Lakh XUV 3XO AX7 1.2 Petrol 1197 cc, Petrol, Manual, 20.1 kmpl, 129 bhp Rs. 12.80 Lakh XUV 3XO AX5 1.5 Diesel Autoshift Plus 1497 cc, Diesel, Automatic (AMT), 21.2 kmpl, 115 bhp Rs. 12.99 Lakh Just Launched XUV 3XO REVX A 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 129 bhp Rs. 12.99 Lakh XUV 3XO AX7 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 13.69 Lakh XUV 3XO AX5L 1.2 Petrol AT 1197 cc, Petrol, Aut\", 'images': [{'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-right-front-three-quarter-34.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Right Front Three Quarter', 'title': 'Mahindra XUV 3XO Right Front Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'eager', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-right-front-three-quarter-32.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Right Front Three Quarter', 'title': 'Mahindra XUV 3XO Right Front Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-left-side-view.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Left Side View', 'title': 'Mahindra XUV 3XO Left Side View', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-front-view-39.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Front View', 'title': 'Mahindra XUV 3XO Front View', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-interior-instrument-cluster.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Instrument Cluster', 'title': 'Mahindra XUV 3XO Instrument Cluster', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 2}, {'url': 'https://www.cartrade.com/mahindra-cars/xuv-3xo/', 'content': 'Mahindra XUV 3XO - XUV 3XO Price, Specs, Images, Colours Trending Search Mahindra XUV 3XO Variants MX1 REVX M REVX M (O) MX2 Pro MX3 MX3 Pro MX2 AX5 REVX A AX5L AX7 AX7L Cars Similar to Mahindra XUV 3XO Tata Nexon 8.0 - 15.6 Lakh Kia Sonet 8.0 - 15.7 Lakh Maruti Suzuki Brezza 8.7 - 14.1 Lakh Skoda Kylaq 8.3 - 14.0 Lakh Kia Syros 9.5 - 17.8 Lakh New Cars Popular Cars Hyundai \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tCreta Mahindra \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tXUV 3XO Mahindra \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tScorpio N Maruti Suzuki \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tBrezza Toyota \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tUrban Cruiser Hyryder View All Popular Cars New Car Launches Renault \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tTriber MG \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tM9 EV Search By Price Upto 5 Lakh 5 Lakh - 8 Lakh 6 Lakh - 10 Lakh 8 Lakh - 12 Lakh 10 Lakh - 15 Lakh Find Your Car Popular Brands Maruti Suzuki Mahindra Tata Hyundai Toyota View All Brands Upcoming \\t\\t\\t\\t\\t\\t\\t\\t\\t\\tCars Electric \\t\\t\\t\\t\\t\\t\\t\\t\\t\\tCars Compare \\t\\t\\t\\t\\t\\t\\t\\t\\t\\tCars Emi \\t\\t\\t\\t\\t\\t\\t\\t\\t\\tCalculator Used Cars By City Delhi \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tNCR Mumbai Bangalore Hyderabad Chennai All Cities By Model Maruti \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tSuzuki Swift Maruti Suzuki Wagon R Honda City Hyundai Creta Maruti Suzuki Baleno All Models By Brand Maruti \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tSuzuki Hyundai Volkswagen Tata Toyota Honda Explore Used \\t\\t\\t\\t\\t\\t\\t\\t\\t\\tCars CarWale abSure Used Car Valuation My \\t\\t\\t\\t\\t\\t\\t\\t\\t\\tListings Find Dealers Car Loan Sell Car News & Reviews Download Mobile App Select Your City Mumbai Borivali User Current Location Confirm Location Popular Cities Mumbai Bangalore Delhi Pune Hyderabad Kolkata Lucknow Chennai Ahmedabad Chandigarh All Cities Select Your Variant No variant available XUV 3XO Price Variants Expert Review Similar Cars Mileage Images Colours User Reviews News FAQs Used Mahindra Cars Mahindra XUV 3XO 4.86 7 Reviews Write a review Equipped with a torquey mStallion Turbo Charged Intercooled Gasoline Direct Injection engine, delivering 129 bhp and 230 Nm of torque, ensuring a responsive driving experience. Features a smooth 6-speed automatic transmission, enhancing driving comfort and ease, particularly in urban settings. Offers impressive fuel efficiency with a mileage of 18.2 km/l, making it a practical choice for daily commuting and long drives. Stylish exterior design with modern LED lighting and a bold grille, complemented by a spacious and well-appointed interior featuring dual 10.25-inch screens for infotainment. Safety is prioritized with six airbags, advanced driver assistance systems (ADAS), and a robust build quality, contributing to a five-star safety rating expectation. Interior comfort is enhanced with leatherette upholstery, ample legroom, and a panoramic sunroof, creating a pleasant atmosphere for passengers. Competitive pricing and a feature-rich offering provide excellent value for money, positioning the XUV 3XO as a strong contender in the compact SUV segment. +More Images (78) Colours (16) 360 View VIEW ALL IMAGES Compare colours with similar cars Citrine Yellow Exterior Interior Open Door XUV 3XO Price XUV 3XO price starts from 7.99 Lakh and goes up to 15.80 Lakh. XUV 3XO EMI starts from 16,201. Select city to check Mahindra XUV 3XO on-road price. +More Variant All Variants City Not Selected 7.99 - 15.80 Lakh Get Best Price Avg. Ex-Showroom price Monthly EMI Price Break-up Get EMI Offers XUV 3XO All Variants EMI 16,201 for 5 Years Down Payment Loan Tenure ( Months ) Yr Mo Bank Interest Rate % Expand \\t\\t\\t\\tEMI Calculator Ex-Showroom Price This price includes GST and any state/city entry tax. \\t\\t\\t\\t\\t\\t\\tHowever, the ex-showroom price does not include RTO, Insurance, Fast tag, and other accessories cost 0 Registration Charges Road Tax or registration tax This varies from city to city. 0 Insurance The insurance cost on CarTrade covers 1-year comprehensive \\t\\t\\t\\t\\t\\t\\tinsurance cost with 95% IDV and 3-year third-party insurance cost. IDV - it is the max amount you will receive if your vehicle is stolen or completely damaged. Third-party insurance - If you met with an accident with another vehicle, third-party insurance \\t\\t\\t\\t\\t\\t\\tcovers cost a', 'images': [{'url': 'https://imgd-ct.aeplcdn.com/664x374/n/cw/ec/107807/brezza-right-front-three-quarter-2.jpeg?isig=0&q=80', 'alt_text': 'Maruti Suzuki Brezza', 'title': 'Maruti Suzuki Brezza', 'width': '284', 'height': '160', 'class': 'similar-car-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://imgd-ct.aeplcdn.com/664x374/n/cw/ec/171817/kylaq-right-front-three-quarter.jpeg?isig=0&q=80', 'alt_text': 'Skoda Kylaq', 'title': 'Skoda Kylaq', 'width': '284', 'height': '160', 'class': 'similar-car-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://imgd-ct.aeplcdn.com/664x374/n/cw/ec/141147/venue-right-front-three-quarter.jpeg?isig=0&q=80', 'alt_text': 'Hyundai Venue', 'title': 'Hyundai Venue', 'width': '284', 'height': '160', 'class': 'similar-car-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://imgd-ct.aeplcdn.com/664x374/n/cw/ec/132561/taisor-right-front-three-quarter.png?isig=0&q=80', 'alt_text': 'Toyota Urban Cruiser Taisor', 'title': 'Toyota Urban Cruiser Taisor', 'width': '284', 'height': '160', 'class': 'similar-car-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://imgd-ct.aeplcdn.com/664x374/n/cw/ec/130635/fronx-right-front-three-quarter-2.jpeg?isig=0&q=80', 'alt_text': 'Maruti Suzuki Fronx', 'title': 'Maruti Suzuki Fronx', 'width': '284', 'height': '160', 'class': 'similar-car-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 3}, {'url': 'https://www.mahindra.com/news-room/press-release/en/mahindra-launches-the-xuv-3xo-the-new-disruptor-in-compact-suvs', 'content': 'Mahindra launches the XUV 3XO the New Disruptor in compact SUVs Skip to main content Who We Are Our Purpose Drive positive change in the lives of our communities. Only when we enable others to rise will we rise. #TogetherWeRise Purpose Led Performance Driven Future Ready Leadership Our History Museum What we do Key Facts 20+ Industries 100+ Countries 324K+ Employees Industries Automotive SUVs LCVs Last Mile Mobility Iconic Motorcycles Trucks And Buses Farm Equipments Tractors Agri Services Farm Machinery Financial Services Technology Services Hospitality Logistics Real Estate Renewables Other Emerging Businesses Advanced Technologies (Defence) Aerostructures Aftermarkets (Pre-Owned Cars) Auto Components and Recycling Power Generation Retail Our Brands Global Presence Cultural Outreach Investor Relations Investor Relations Group highlights. 18% Consolidated ROE 1592 B+ Revenue 129 B+ PAT 3.31 T+ Market cap as on date Disclosures Under Regulation 46 And 62 Of SEBI (LODR) Reports Policies Regulatory Filings Sustainability newsroom Newsroom Tech Mahindra Joins J.P. Morgans Payments System Integrator Program to Accelerate Innovation in Payments System 22 July 2025 Technology Mahindra Industrial Park, Sumitomo Corporation Sign Strategic Cooperation Agreement with Osaka Government to Support Japanese Businesses Entering India 21 July 2025 Real Estate Press Releases Media Resources In The News careers careers Committed to elevate the lives of communities, guided by our core behaviours and values. Bold. Agile. Collaborative. Find A Job SOAR - Seamless Opportunity For Amazing Returnship Leadership Programs Mahindra Leadership Program Mahindra Accelerated Leadership Track Mahindra Future Shapers Mahindra Leadership University Tech Opportunities Mahindra Digital Engine Submit Popular Keywords: Business FY 21 Brands XUV700 Global Nanhi Kali Recommended for you: Annual Report 2021 - 2022 Leadership Announcement Latest Press Release Brand Guidelines Mahindra launches the XUV 3XO the New Disruptor in compact SUVs Auto Home Newsroom Press Release Mahindra launches the XUV 3XO the New Disruptor in compact SUVs Author : mahindraadmin Category : Auto Published : 4/29/2024 Prices start at 7.49 Lakh Disrupting the category: The XUV 3XO disrupts with 6+1 key pillars: Turn on Design: Bold, athletic silhouette that commands attention Ivory colour interiors wrapped with a Soft touch leatherette dashboard and door trims SUV Command Seating: Best-in-class forward visibility of 23.7that matches with XUV 700 Command seating position with eye level at 1398 mm above the ground R17 Alloy Wheels and water wading depth of 350 mm Safe Cocoon: 35 standard safety features including 6 airbags, ESC with Hill Hold Control (HHC) & All 4 Disc Brakes and more Engineered to meet the highest B-NCAP safety rating Drive of Your Life: World-class turbocharged engines with best-in-class Torque of 230 Nm (1.2 L TDGi) and 300 Nm (1.5 L Diesel) 6-speed AISIN 3rd Gen Automatic Transmission Thrilling acceleration of 0 to 60 km/h in 4.5 s (1.2 L TGDi) and best-in-class mileage of 20.1 km/l* (1.2 L TGDi MT) Ride of Your Life: First-in-segment MTV-CL (Multi-Tuned Valve Concentric Land) technology Advanced suspension system with MacPherson Strut Fully Independent Front Suspension and a Twist Beam Semi-independent Rear Suspension Quietness of gasoline matching XUV 700 gasoline Space where it counts: Best-in-class wheelbase, occupant space, and legroom Spacious cargo area measuring 364 L**, further expanded with standard 60:40 split seats to maximise storage capacity. Sci-Fi Technology First-in-segment: SkyroofTM, Dual Zone Climate Control, 65 W USB-C charging, Electronic Parking brake with Auto Hold, 3 Smart Steering Modes, Level 2 ADAS (1R1V) 3XO is also equipped with Twin HD Screens one 26.03 cm infotainment and the other 26.03 cm full digital cluster, Harman Kardon Premium Audio with amplifier & Sub-woofer, 360-degree surround view system with blind view monitor Mumbai, Apri', 'images': [], 'rank': 4}, {'url': 'https://www.cardekho.com/mahindra/xuv-3xo/specs', 'content': \"Mahindra XUV 3XO Specifications - Dimensions, Configurations, Features, Engine cc All New Used Ad English Login / Register NEW CARS Explore New Cars Electric Cars Tesla Model Y Mahindra BE 6 Tata Harrier EV MG Windsor EV Mahindra XEV 9e MG M9 All Electric Cars Popular Cars Defender Hyundai Creta Mahindra Thar ROXX Mahindra Scorpio Tata Nexon Maruti Swift All Popular Cars Upcoming Cars New Launches Car Insurance Ad Popular Brands Maruti Cars Tata Cars Kia Cars Toyota Cars Hyundai Cars Mahindra Cars Compare Cars New Car Offers & Discounts Find Car Dealers Find EV Charging Stations Find Fuel Stations Check Fuel Prices Used cars Buy Used Cars Used Cars In Your City Ahmedabad Bangalore Chennai Delhi NCR Hyderabad Jaipur Kolkata Mumbai Pune More Cities Sell My Car Used Car Valuation Dealership Near Me News & Reviews News & Top stories Car Expert Reviews User Reviews Car Collection Tips & Advice Videos Video Reviews Visual Stories Select City Ad XUV 3XO Price Compare Offers Images Specs User Reviews 360 View Variants More Videos Mileage Colours XUV 3XO News FAQs Dealers Service Center Brochure XUV 3XO EMI Loan Second Hand XUV 3XO Mahindra XUV 3XO Specifications The Mahindra XUV 3XO has 1 Diesel Engine and 1 Petrol Engine on offer. The Diesel engine is 1498 cc while the Petrol engine is 1197 cc . It is available with Manual & Automatic transmission.Depending upon the variant and fuel type the XUV 3XO has a mileage of 17.96 to 20.6 kmpl. The XUV 3XO is a 5 seater 3 cylinder car and has length of 3990 mm, width of 1821 mm and a wheelbase of 2600. Read More 4.6 304 Reviews Shortlist Rs. 7.99 - 15.80 Lakh * EMI starts @ 21,545 View July Offers Ad Standout features of Mahindra XUV 3XO Soft touch material on dashboard and door pads. Panoramic sunroof - largest in the segment. Level 2 ADAS with features such as forward collision warning, adaptive cruise control. 1.2-litre turbo-petrol engine makes 130PS/230Nm most powerful in its class. Key specifications of Mahindra XUV 3XO ARAI Mileage 18.2 kmpl Fuel Type Petrol Engine Displacement 1197 cc No. of Cylinders 3 Max Power 128.73bhp@5000rpm Max Torque 230Nm@1500-3750rpm Seating Capacity 5 Transmission Type Automatic Boot Space 364 Litres Fuel Tank Capacity 42 Litres Body Type SUV Key features of Mahindra XUV 3XO Power Steering Yes Power Windows Front Yes Anti-lock Braking System (ABS) Yes Air Conditioner Yes Driver Airbag Yes Passenger Airbag Yes Automatic Climate Control Yes Alloy Wheels Yes Multi-function Steering Wheel Yes Mahindra XUV 3XO specifications Engine & Transmission Engine Type mStallion (TGDi) engine Displacement 1197 cc Max Power 128.73bhp@5000rpm Max Torque 230Nm@1500-3750rpm No. of Cylinders 3 Valves Per Cylinder 4 Turbo Charger Yes Transmission Type Automatic Gearbox 6-Speed AT Drive Type FWD Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Fuel & Performance Fuel Type Petrol Petrol Mileage ARAI 18.2 kmpl Petrol Fuel Tank Capacity 42 Litres Emission Norm Compliance BS VI 2.0 Report Incorrect Specs Suspension, Steering & Brakes Front Suspension MacPherson Strut suspension Rear Suspension Rear twist beam Steering Type Electric Turning Radius 5.3 m Front Brake Type Disc Rear Brake Type Disc Alloy Wheel Size Front 17 Inch Alloy Wheel Size Rear 17 Inch Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Dimensions & Capacity Length 3990 mm Width 1821 mm Height 1647 mm Boot Space 364 Litres Seating Capacity 5 Wheel Base 2600 mm No. of Doors 5 Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Comfort & Convenience Power Steering Air Conditioner Heater Height Adjustable Driver Seat Ventilated Seats Electric Adjustable Seats Automatic Climate Control Accessory Power Outlet Rear Reading Lamp Adjustable Headrest Rear Seat Centre Arm Rest Height Adjustable Front Seat Belts Rear AC Vents Cruise Control Parking Sensors Front & Rear Real-Time Vehicle Tracking Foldable Rea\", 'images': [{'url': 'https://stimg.cardekho.com/images/carexteriorimages/630x420/Mahindra/XUV-3XO/10184/1751288551835/front-left-side-47.jpg?tr=w-230', 'alt_text': 'Mahindra XUV 3XO Specifications', 'title': 'Mahindra XUV 3XO Specifications', 'width': '230', 'height': '153', 'loading': 'eager', 'confidence': 0.9999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Soft touch material on dashboard and door pads.', 'title': 'XUV 3XO Soft touch material on dashboard and door pads.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Panoramic sunroof - largest in the segment.', 'title': 'XUV 3XO Panoramic sunroof - largest in the segment.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Level 2 ADAS with features such as forward collision warning, adaptive cruise control.', 'title': 'XUV 3XO Level 2 ADAS with features such as forward collision warning, adaptive cruise control.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO \\u20601.2-litre turbo-petrol engine makes 130PS/230Nm — most powerful in its class.', 'title': 'XUV 3XO \\u20601.2-litre turbo-petrol engine makes 130PS/230Nm — most powerful in its class.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 5}, {'url': 'https://www.autocarindia.com/auto-features/mahindra-xuv-3xo-price-variants-features-explained-431425', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://ackodrive.com/cars/mahindra-xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://en.wikipedia.org/wiki/Mahindra_XUV_3XO', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-23T17:41:41.750049",
      "end_time": "2025-07-23T17:43:02.408407",
      "execution_time": 80.658358,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T002",
      "description": "Gather detailed information about the luxury features of Mahindra XUV 3XO.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Retrieve specific details about the luxury features of the Mahindra XUV 3XO. Include information about interior materials, comfort features, entertainment systems, and any other premium features.",
      "reads": [],
      "writes": [
        "T002"
      ],
      "status": "failed",
      "output": null,
      "error": "Only one live display may be active at once",
      "cost": 0.0,
      "start_time": "2025-07-23T17:41:41.771126",
      "end_time": "2025-07-23T17:43:02.414966",
      "execution_time": 80.64384
    },
    {
      "id": "T003",
      "description": "Gather detailed information about the safety features of Mahindra XUV 3XO.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Retrieve specific details about the safety features of the Mahindra XUV 3XO. Include information about active safety systems, passive safety systems, driver assistance features, and crash test ratings.",
      "reads": [],
      "writes": [
        "T003"
      ],
      "status": "failed",
      "output": null,
      "error": "Only one live display may be active at once",
      "cost": 0.0,
      "start_time": "2025-07-23T17:41:41.784137",
      "end_time": "2025-07-23T17:43:02.420965",
      "execution_time": 80.636828
    },
    {
      "id": "T004",
      "description": "Analyze the luxury features of Mahindra XUV 3XO.",
      "agent": "ThinkerAgent",
      "agent_prompt": "Analyze the luxury features of the Mahindra XUV 3XO based on the information retrieved in T002. Identify the key luxury features, their benefits, and how they compare to similar features in competing vehicles. Provide an assessment of their overall value and appeal.",
      "reads": [
        "T002"
      ],
      "writes": [
        "T004"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T005",
      "description": "Analyze the safety features of Mahindra XUV 3XO.",
      "agent": "ThinkerAgent",
      "agent_prompt": "Analyze the safety features of the Mahindra XUV 3XO based on the information retrieved in T003. Identify the key safety features, their benefits, and their effectiveness in preventing accidents and protecting occupants. Assess the safety ratings and certifications of the vehicle.",
      "reads": [
        "T003"
      ],
      "writes": [
        "T005"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T006",
      "description": "Compile a comprehensive report on Mahindra XUV 3XO features, including luxury and safety analysis.",
      "agent": "FormatterAgent",
      "agent_prompt": "Compile a comprehensive report on the Mahindra XUV 3XO, integrating the general information from T001, the analysis of luxury features from T004, and the analysis of safety features from T005. The report should be well-structured, visually appealing, and easy to understand. Include sections on general features, luxury features, safety features, and an overall assessment of the vehicle.",
      "reads": [
        "T001",
        "T004",
        "T005"
      ],
      "writes": [
        "T006"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "ROOT",
      "target": "T002"
    },
    {
      "source": "ROOT",
      "target": "T003"
    },
    {
      "source": "T001",
      "target": "T006"
    },
    {
      "source": "T002",
      "target": "T004"
    },
    {
      "source": "T003",
      "target": "T005"
    },
    {
      "source": "T004",
      "target": "T006"
    },
    {
      "source": "T005",
      "target": "T006"
    }
  ]
}