{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "52896782",
    "original_query": "HOw is ather energy stock price doing after its stock listing in india (dont' ask for clarification)",
    "file_manifest": [],
    "created_at": "2025-07-19T03:46:22.386983",
    "status": "running",
    "output_chain": {
      "T001": {
        "data": [
          {
            "type": "text",
            "text": "[{'url': 'https://ipowatch.in/ather-energy-ipo-date-review-price-allotment-details/', 'content': 'Ather Energy IPO Date, Review, Price, Allotment Details - IPO Watch Skip to content Search Search IPO GMP IPO Upcoming IPO SME IPO IPO Review Subscription IPO Forms IPO Listing IPO Allotment Gold & Silver Gold Rate Today Gold Rate Mumbai Gold Rate Delhi Gold Rate Ahmedabad Gold Rate Bangalore Gold Rate Chennai Silver Rate Today More Buyback Rights Issues NCD IPO GMP IPO Upcoming IPO SME IPO IPO Review Subscription IPO Forms IPO Listing IPO Allotment Gold & Silver Gold Rate Today Gold Rate Mumbai Gold Rate Delhi Gold Rate Ahmedabad Gold Rate Bangalore Gold Rate Chennai Silver Rate Today More Buyback Rights Issues NCD App Free Demat [xs_social_login] Ather Energy IPO Date, Review, Price, Allotment Details Vijay Prajapati May 5, 2025 Ather Energy IPO open date is April 28, 2025 and the IPO will close on April 30, 2025. Ather Energy IPO is a Book Built Issue. The company to raise around 2,980 crores via IPO that comprises fresh issue of 2,626 crores and offer for sale up to 1,10,51,746 equity shares with face value of 1 each. Ather Energy IPO price band is 304 to 321 per share. The retail quota is 10% , QIB is 75%, and HNI is 15%. Ather Energy IPO to list on BSE, NSE on May 6, 2025. The allotment of Ather Energy IPO date is May 2, 2025. The company reported revenue of 1,789.1 crores in 2024 against 1,801.8 crore in 2023. The company reported loss of 1,059.7 crores in 2024 against loss of 864.5 crores in 2023. As per the financials the IPO investors should apply the IPO for a long term. Ather Energy IPO Details IPO Open Date: April 28, 2025 IPO Close Date: April 30, 2025 Face Value: 1 Per Equity Share IPO Price Band: 304 to 321 Issue Size: 2,980.73 Crores Fresh Issue: Approx 2,626 Crores Offer for Sale: Approx 11,051,746 Equity Shares Issue Type: Book Built Issue IPO Listing: BSE & NSE Retail Quota: Not more than 10% QIB Quota: Not more than 75% NII Quota: Not more than 15% DRHP Draft Prospectus: Click Here RHP Draft Prospectus: Click Here Anchor Investors List: Click Here Ather Energy IPO Market Lot The Ather Energy IPO minimum market lot is 46 shares with 14,766 application amount. The retail investors can apply up-to 13 lots with 598 shares of 1,91,958amount. Application Lot Size Shares Amount Retail Minimum 1 46 14,766 Retail Maximum 13 598 1,91,958 S-HNI Minimum 14 644 2,06,724 B-HNI Minimum 68 3,128 10,04,088 Ather Energy IPO Dates The Ather Energy IPO date is 28 April and the close date is 30 April. The Ather Energy IPO allotment will be finalized on 2 May and the IPO listing on 6 May. IPO Open Date: April 28, 2025 IPO Close Date: April 30, 2025 Basis of Allotment: May 2, 2025 Refunds: May 5, 2025 Credit to Demat Account: May 5, 2025 IPO Listing Date: May 6, 2025 Promoters of Ather Energy IPO The promoters of the company are Tarun Sanjay Mehta, Swapnil Babanlal Jain And Hero Motocorp Limited. About Ather Energy IPO Ather Energy is a top player in Indias electric two-wheeler (E2W) market. The company creates electric scooters, battery packs, charging stations, and related software and accessories. Its known for its innovation and leadership in electric mobility. It has a business of designing battery packs, charging infrastructure, associated software, and accessories. Ather is an all-electric vehicle company that designs all its products in India, showing its focus on local innovation and sustainability they have a focus on manufacturing battery packs and assembling E2Ws in-house and it ensures focus on quality and creativity. It is the first firm to sell two-wheeler (2W) OEM in India to establish a fast-charging network, branded as the Ather Grid and till now it has sold 1,09,577. Ather Energy IPO Company Financial Report The company reported revenue of 1,789.1 crores in 2024 against 1,801.8 crore in 2023. The company reported loss of 1,059.7 crores in 2024 against loss of 864.5 crores in 2023. Amount in Crores Period Ended Revenue Expense Profit After Tax Assets 2022 413.8 757.9 344.1 818.6 2023 1,801.8 2,666.3 864.5 1,97', 'images': [], 'rank': 1}, {'url': 'https://equitymarketinsights.com/ather-energy-ipo/', 'content': 'Ather Energy IPO: Date, Price, Allotment & Review Key Details Inside Skip to content Menu Menu Home IPOs IPO GMP Upcoming IPO IPO Allotment IPO Forms IPO Listing Subscription Rights Issue Buyback Investment Calculator SWP Calculator SIP Calculator Lumpsum Calculator Retirement Calculator EMI Calculator Holiday Calendar Ather Energy IPO: Date, Price, Allotment & Review Key Details Inside May 2, 2025 by Rameshbabu Praggnanandhaa Ather Energy , one of Indias leading electric scooter makers, is all set to launch its Initial Public Offering (IPO) soon. The Ather Energy IPO will open on April 28, 2025 , and close on April 30, 2025 . The listing of shares is expected to take place on the BSE and NSE on May 6, 2025 , while the allotment of shares is likely to be finalized by May 2, 2025 . The company aims to raise a total of 2,980 crore through this IPO. This includes a fresh issue of 2,626 crore and an Offer for Sale (OFS) of around 1.10 crore equity shares with a face value of 1 each. Open Demant With Zerodha [Free Lifetime] The price band for Ather Energy IPO is set between 304 to 321 per share . As per the share reservation, retail investors will get 10% , Qualified Institutional Buyers (QIBs) will have 75% , and High Net-worth Individuals (HNIs) will get 15% of the total issue. Financially, Ather reported a revenue of 1,789.1 crore in FY 2024 , slightly lower than 1,801.8 crore in FY 2023 . The company also recorded a loss of 863.9 crore in 2024 , which is better than the 1,062.3 crore loss in 2023 . Considering the companys growth potential in the electric vehicle space, many experts believe this IPO could be a good opportunity for long-term investors . Ather Energy, founded in 2013, is one of the top companies in Indias electric two-wheeler market. It designs and develops electric scooters, battery packs, charging stations, software, and accessories, all in-house , which highlights its strong focus on quality, innovation, and sustainability. Ather is the first electric two-wheeler brand in India to set up its own fast-charging network, known as Ather Grid, and it also offers Atherstack, a smart software platform with 64 connected features as of July 2024. The company follows a vertically integrated model, meaning it handles everything from product design to final assembly on its own, mainly at its manufacturing facility in Hosur, Tamil Nadu, which had an annual production capacity of 4.2 lakh electric vehicles and 3.8 lakh battery packs as of March 2024. In terms of sales, Ather sold 1,09,577 electric scooters in the financial year 2024 and 1,07,983 units in the first nine months ending December 2024. As of December 2024, Ather had a wide reach with 265 experience centres and 233 service centres in India, along with a growing presence in Nepal and Sri Lanka. Internationally, the brand had five experience centres and four service centres in Nepal, and ten experience centres with one service centre in Sri Lanka. The company also holds strong intellectual property, with 303 registered trademarks, 201 registered designs, and 45 patents, along with several pending applications. Athers growth strategy is based on four key pillars: complete in-house product development, smart software integration, premium market positioning, and efficient operations. By March 2024, Ather Energy employed 2,454 people, including 1,458 permanent staff and 996 off-roll workers, showing its strong commitment to building a skilled and growing workforce. Read Also Stock Market Today Analysis 29th Nov 2024 Overview of Contents Toggle Ather Energy IPO Overview Ather Energy IPOProspectus Ather Energy IPO Dates Ather Energy IPO Financial Information Ather Energy IPO Lot Size Ather Energy FY24 IPO Valuation Key Financial Ratios Explained in Simple Terms Peer Group Comparison Objects of the Issue Ather Energy IPO Review Ather Energy IPO Registrar: IPO Lead Managers (Merchant Bankers): Company Address: Ather Energy IPO FAQs What is Ather Energy IPO? When will', 'images': [{'url': 'https://equitymarketinsights.com/wp-content/uploads/2025/04/Ather-Energy-IPO.webp', 'alt_text': 'Ather Energy IPO 2025: Complete Guide to Subscription, Pricing, and More', 'title': 'Ather Energy IPO', 'width': '1920', 'height': '1080', 'class': 'aligncenter wp-image-7290 size-full', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 2}, {'url': 'https://www.firstpost.com/india/ather-energy-shares-to-debut-on-stock-exchanges-today-here-are-ipo-gmp-performance-stats-13885723.html', 'content': 'Ather Energy shares to debut on stock exchanges today: Here are IPO GMP, performance stats Firstpost Home Video Shows Vantage Firstpost America Firstpost Africa First Sports World Explainers News India Opinion Cricket Tech Entertainment Sports Health IPL 2025 Apple Incorporated Modi ji Justin Trudeau Trending Events Raisina Dialogue Champions Trophy Delhi Elections 2025 Budget 2025 US Elections 2024 Firstpost Defence Summit Sections Home Live TV Videos Shows World India Explainers Opinion Sports Cricket Health Tech/Auto Entertainment Web Stories Business Shows Vantage Firstpost America Firstpost Africa First Sports Fast and Factual Between The Lines Flashback Live TV Ather Energy shares to debut on stock exchanges today: Here are IPO GMP, performance stats Whatsapp Facebook Twitter Whatsapp Facebook Twitter Apple Incorporated Modi ji Justin Trudeau Trending Events Raisina Dialogue Champions Trophy Delhi Elections 2025 Budget 2025 US Elections 2024 Firstpost Defence Summit Sections Home Live TV Videos Shows World India Explainers Opinion Sports Cricket Health Tech/Auto Entertainment Web Stories Business Shows Vantage Firstpost America Firstpost Africa First Sports Fast and Factual Between The Lines Flashback Live TV Home India Ather Energy shares to debut on stock exchanges today: Here are IPO GMP, performance stats Ather Energy shares to debut on stock exchanges today: Here are IPO GMP, performance stats FP News Desk May 6, 2025, 06:00:14 IST Whatsapp Facebook Twitter With Ather Energy shares set to debut on the bourses today at around 10 am, many investors are looking towards the IPOs GMP to gauge potential listing price read more Advertisement Representational image. Pixabay Follow us on Google News Subscribe Join Us Ather Energy, one of Indias leading electric two-wheeler manufacturers, is set to make its debut on the Bombay Stock Exchange (BSE) and National Stock Exchange (NSE) today, marking a major milestone in the companys decade-long journey in the countrys rapidly evolving electric mobility space. The listing follows a three-day Initial Public Offering (IPO) that ran from April 28 to April 30, raising Rs 2,980.76 crore. The offering consisted of a fresh issue of Rs 2,626 crore and an Offer for Sale (OFS) of Rs 354.76 crore. STORY CONTINUES BELOW THIS AD IPO performance and subscription details The IPO was priced in the band of Rs 304 to Rs 321 per share, with a minimum lot size of 46 shares, requiring a retail investment of Rs 14,766. Athers issue saw a moderate overall subscription of 1.43 times, with retail investors subscribing 1.78 times, qualified institutional buyers (QIBs) 1.70 times, and non-institutional investors (NIIs) 0.66 times. More from India Indian Army practises long-range Pinaka missile firing in Pokhran Pahalgam: Centre tells states to conduct civil defence mock drills, activate air raid warning signals Interestingly, the employee portion was subscribed 5.43 times, indicating strong internal faith in the companys future. Ather Energy IPO GMP Ahead of the listing, shares of Ather Energy were commanding at a grey market premium (GMP) of +- Rs 5 per share, according to Investorgain. The figure suggested a potential listing price in the range of Rs 316-326 on the upper end of the Ather Energy IPO price band. Investors were expected to see gains of a meagre 2.18 per cent amid speculation of a flat debut on the bourses. GMP is the price at which an IPO share is being traded unofficially before it is listed on the stock exchange. It reflects how the market perceives the IPOif the GMP is positive (i.e., above the issue price), it suggests strong demand and expectations of a good listing gain. If its negative, it may signal weak sentiment. GMP is a speculative indicator, useful for gauging hype but not reliable for investment decisions. (Disclaimer: The article above is meant for informational purposes only, and should not be considered investment advice. Firstpost advises all readers to check with certifi', 'images': [{'url': 'https://images.firstpost.com/uploads/2025/04/Abbas-Araghchi-October-4-2024-Reuters-2025-04-fc91979bae42edfff20bb75a52f25920.jpg?im=FitAndFill=(284,159)', 'alt_text': 'Iran’s Araghchi accuses Israel’s Netanyahu of dragging US into Middle East crisis', 'title': 'Iran’s Araghchi accuses Israel’s Netanyahu of dragging US into Middle East crisis', 'width': '284', 'height': '159', 'class': 'cp_related_stories', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://images.firstpost.com/uploads/2025/05/Representational-Image-2025-05-05T225648.098-2025-05-5081d2379834399b1eea7e47bc5abe0f.jpg?im=FitAndFill=(284,159)', 'alt_text': \"Trump cuts science funds, France tells scientists 'come, join us'\", 'title': \"Trump cuts science funds, France tells scientists 'come, join us'\", 'width': '284', 'height': '159', 'class': 'cp_related_stories', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://images.firstpost.com/uploads/2024/11/UN-Secretary-General-Antonio-Guterres-2024-11-c785aef104c1a0f03df5b81f3f39382d-1200x675.jpg?im=FitAndFill=(284,159)', 'alt_text': \"'Military solution is no solution': UN chief urges 'maximum restraint' as India-Pak tensions reach boiling point\", 'title': \"'Military solution is no solution': UN chief urges 'maximum restraint' as India-Pak tensions reach boiling point\", 'width': '284', 'height': '159', 'class': 'cp_related_stories', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://images.firstpost.com/uploads/2025/05/Firstpost-2025-05-05T192734.150-2025-05-4a6cd577a53c50a156d82e00fee49bea.jpg?im=FitAndFill=(284,159)', 'alt_text': 'Pahalgam: Centre tells states to conduct civil defence mock drills, activate air raid warning signals', 'title': 'Pahalgam: Centre tells states to conduct civil defence mock drills, activate air raid warning signals', 'width': '284', 'height': '159', 'class': 'cp_related_stories', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://images.firstpost.com/uploads/2024/09/IPO-market-in-India-1-2024-09-dcc46a6b5cc9634d803cf02462cc57ba.jpg?im=FitAndFill=(596,336)', 'alt_text': 'Ather Energy shares to debut on stock exchanges today: Here are IPO GMP, performance stats', 'title': 'Ather Energy shares to debut on stock exchanges today: Here are IPO GMP, performance stats', 'class': 'cp_image_hyperlink', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://www.entrepreneur.com/en-in/news-and-trends/ather-energy-raises-inr-1340-crore-ahead-of-ipo-launch/490669', 'content': \"Ather Energy Raises INR 1,340 Crore Ahead Of IPO Launch | Entrepreneur Skip to content Menu Close Menu Sign In Subscribe Search Search Close Menu Subscribe to Entrepreneur Starting Up Growing a Business Franchise Inspiration For Subscribers Write for Entrepreneur Bookstore Ask an Expert Tips White Papers Podcasts Video Entrepreneur TV Webinars Entrepreneur Store Spotlight Entrepreneur Authorities Entrepreneur Authorities Magazine Subscription Edition Plus Minus United States Spanish Georgia India Asia Pacific Middle East United Kingdom Europe Facebook X LinkedIn YouTube Instagram RSS Copyright 2025 Entrepreneur Media, LLC All rights reserved. Entrepreneur and its related marks are registered trademarks of Entrepreneur Media LLC Home Home Breadcrumb Arrow News and Trends Ather Energy Raises INR 1,340 Crore Ahead Of IPO Launch Axis Capital, JM Financial, Nomura Financial Advisory and Securities (India), and HSBC Securities & Capital Markets are managing the issue. Ather's shares are expected to debut on the stock exchanges on May 6. By Entrepreneur Staff Apr 26, 2025 Share Copy You're reading Entrepreneur India, an international franchise of Entrepreneur Media. Freepik Electric two-wheeler manufacturer Ather Energy has secured INR 1,340 crore from anchor investors ahead of its highly anticipated initial public offering (IPO), according to a regulatory filing. The IPO, set to open for subscription on April 28, is the first mainboard listing of the 202526 financial year. The company allotted 4.17 crore shares to 36 anchor investors at INR 321 apiece, the top end of its price band of INR 304321. The anchor round drew strong interest from a mix of marquee global and domestic names. Custody Bank of Japan, Franklin Templeton, Abu Dhabi Investment Authority, Eastspring Investments, Morgan Stanley Investment Management, and Societe Generale were among the international investors participating. On the domestic front, mutual funds and insurers like PSBI Mutual Fund, Aditya Birla Sun Life MF and Insurance, ICICI Prudential MF, Invesco MF, ITI MF, and Union MF also backed the offering. The INR 2,981 crore IPO comprises a fresh issue of shares worth INR 2,626 crore and an offer-for-sale (OFS) of 1.1 crore equity shares by existing shareholders and promoters. At the upper end of the price band, Ather's valuation is pegged at around INR 11,956 crore. Proceeds from the fresh issue will be used to set up a new manufacturing facility for electric two-wheelers in Maharashtra and to pare down existing debt. The IPO structure sets aside 75 per cetn of the issue for qualified institutional buyers, 15 per cent for non-institutional investors, and the remaining 10 per cent for retail investors. The company will become the second major electric two-wheeler maker to list after Ola Electric Mobility, which launched its INR 6,145 crore IPO last August. Ola's issue included a fresh issue of up to INR 5,500 crore and an OFS of 8.5 crore equity shares. This marks a major milestone not just for Ather, but for the broader electric mobility sector in India. Beyond its IPO ambitions, Ather has been quietly strengthening its research and development efforts. The company recently expanded its product testing and validation centre, signaling a clear push to enhance innovation as competition in the electric mobility space intensifies. Axis Capital, JM Financial, Nomura Financial Advisory and Securities (India), and HSBC Securities & Capital Markets are managing the issue. Ather's shares are expected to debut on the stock exchanges on May 6. Wavy Line Wavy Line Entrepreneur Staff Entrepreneur Staff Editor For more than 30 years, Entrepreneur has set the course for success for millions of entrepreneurs and small business owners. We'll teach you the secrets of the winners and give you exactly what you need to lay the groundwork for success. Most Popular Red Arrow See all Chevron Right Buying / Investing in Business Meet the Person Who Invented Plastic that Dissolves in\", 'images': [], 'rank': 4}, {'url': 'https://inc42.com/buzz/ather-energy-sets-price-band-of-inr-304-321-for-ipo/', 'content': 'Ather Energy Sets Price Band Of INR 304-321 For IPO Skip to content MEDIA DATALABS REPORTS EVENTS COURSES INC42 COURSES D2CX D2CX by Inc42 is a 12-week hands-on program ManagementX ManagementX by Inc42 Indias first Startup Management D2CX Foundations D2CX Foundations by Inc42 is a 6 week BRANDLABS ABOUT The D2C & Retail Summit 2025 NEWS IN-DEPTH STARTUPS NEWSLETTERS PODCAST INDUSTRY INDUSTRY Stay ahead with the latest news, funding, startup financials, & governments policies on the hottest tech industries in the Indian startup ecosystem. Fintech Travel Tech Electric Vehicle Health Tech Edtech IT Logistics Retail Ecommerce Startup Ecosystem Enterprise Tech Clean Tech Consumer Internet Agritech MORE MORE ON INC42 Get featured, partner or work with India\\'s #1 startup media & intelligence platform and explore what else Inc42 has to offer. PARTNER WITH INC42 Startup Spotlight Guest Posts Advertise ABOUT INC42 About Ethics Careers Contact Us GLOSSARY RESOURCES Login JOIN INC42 PLUS NEWS IN-DEPTH STARTUPS NEWSLETTERS PODCAST INDUSTRY INDUSTRY Stay ahead with the latest news, funding, startup financials, & governments policies on the hottest tech industries in the Indian startup ecosystem. Fintech Travel Tech Electric Vehicle Health Tech Edtech IT Logistics Retail Ecommerce Startup Ecosystem Enterprise Tech Clean Tech Consumer Internet Agritech MORE MORE ON INC42 Get featured, partner or work with India\\'s #1 startup media & intelligence platform and explore what else Inc42 has to offer. PARTNER WITH INC42 Startup Spotlight Guest Posts Advertise ABOUT INC42 About Ethics Careers Contact Us GLOSSARY RESOURCES Stories Profiles Not Finding what you are looking for? Advanced filter Trending On Inc42 News Ecommerce To Morph Into Quick Commerce In India: Blinkit SVP By Lokesh C. 19 Jul\\'25 5 min read Foodtech Rebel Foods Reshuffle: Cofounder Ankush Grover Appointed Global CEO By Team Inc42 19 Jul\\'25 3 min read News Reliance Rolls Out 4-Hour Fashion Delivery Service AJIO Rush In 6 Ci... By Team Inc42 18 Jul\\'25 3 min read In-Depth Stories Ecommerce Lenskart Adds Smart Glasses To Its Cart: Next Growth Arc Or Risky Bet?... By Debarghya S. 18 Jul\\'25 9 min read In-Depth Indian Listed New-Age Tech Company Tracker: Market Cap, Revenue & More... By Akshit P. 17 Jul\\'25 8 min read In-Depth Why Every Fintech Startup Wants To Be The Next Zerodha By Bismah M. 17 Jul\\'25 11 min read SIGN IN JOIN INC42 PLUS NOW MEDIA DATALABS REPORTS EVENTS COURSES INC42 COURSES D2CX D2CX by Inc42 is a 12-week hands-on program ManagementX ManagementX by Inc42 Indias first Startup Management D2CX Foundations D2CX Foundations by Inc42 is a 6 week BRANDLABS ABOUT The D2C & Retail Summit 2025 FOLLOW INC42 Share story [mashshare networks=\"facebook,twitter,linkedin\" services=\"3\"] Clean Tech Ather Energy Sets Price Band Of INR 304-321 For IPO 23 Apr\\'25 | By Amit Singh SUMMARY Ather Energy\\'s IPO will comprise a fresh issue of equity shares aggregating up to INR 2,626 Cr and an offer for sale of up to 1.10 Cr shares The issue will open for subscription on April 28 and close on April 30 At the upper end of the price band, the company would be valued at about INR 11,955 Cr (about $1.4 Bn) FOLLOW US FOLLOW US Added to Saved Stories in Login VIEW SAVED STORIES EV major Ather Energy has set a price band of INR 304 to INR 321 per share for its initial public offering (IPO) that will open for subscription on April 28. The anchor investor bidding will take place on April 25. The issue will close on April 30. At the upper end of the price band, Ather Energy would be valued at about INR 11,955 Cr (around $1.4 Bn). Ather filed its red herring prospectus (RHP) with SEBI yesterday. Its IPO will comprise a fresh issue of equity shares aggregating up to INR 2,626 Cr and an offer for sale of up to 1.10 Cr shares. At INR 321 apiece, the size of the OFS will be INR 354.76 Cr. Promoters Tarun Mehta and Swapnil Jain will be selling 9.80 Lakh equity shares each in the OFS. Among investors, Caladium Inves', 'images': [{'url': 'https://asset.inc42.com/2023/09/featured.png', 'alt_text': 'Ather Energy Sets Price Band Of INR 304-321 For IPO-Inc42 Media', 'class': 'plus_feature_img', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://asset.inc42.com/2023/09/academy.png', 'alt_text': 'Ather Energy Sets Price Band Of INR 304-321 For IPO-Inc42 Media', 'class': 'plus_feature_img', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://asset.inc42.com/2023/09/reports.png', 'alt_text': 'Ather Energy Sets Price Band Of INR 304-321 For IPO-Inc42 Media', 'class': 'plus_feature_img', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://asset.inc42.com/2023/09/trackers.png', 'alt_text': 'Ather Energy Sets Price Band Of INR 304-321 For IPO-Inc42 Media', 'class': 'plus_feature_img', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://asset.inc42.com/2023/09/perks5.png', 'alt_text': 'Ather Energy Sets Price Band Of INR 304-321 For IPO-Inc42 Media', 'height': '90', 'class': 'inc42_plus__benefit_feature_img', 'confidence': 0.8999999999999999}], 'rank': 5}, {'url': 'https://inc42.com/buzz/ather-energy-shares-list-at-2-premium-over-ipo-price/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.plindia.com/blogs/india-ipo-boom-2025-ather-energy-top-sme-listings-to-watch-this-may/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.angelone.in/news/ather-energy-ipo-allotment-status', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "T002": {
        "initial_thoughts": "Let me think through this. The input contains news articles about Ather Energy's IPO. I need to extract the stock price after listing, the change from the IPO price, and relevant commentary.",
        "output": {
          "summary_bullets": [
            "Ather Energy IPO price band was between ₹304 to ₹321 per share.",
            "The IPO opened on April 28, 2025, and closed on April 30, 2025.",
            "Listing was expected on BSE and NSE on May 6, 2025.",
            "Grey Market Premium (GMP) ahead of listing was ₹5 per share, suggesting a potential listing price of ₹316-₹326.",
            "Subscription rate was moderate at 1.43 times overall.",
            "Retail investors subscribed 1.78 times, QIBs 1.70 times, and NIIs 0.66 times.",
            "Employee portion was subscribed 5.43 times.",
            "Proceeds from the IPO will be used to set up a new manufacturing facility in Maharashtra and to reduce existing debt.",
            "The IPO size was ₹2,981 crore, comprising a fresh issue of shares worth ₹2,626 crore and an OFS of 1.1 crore equity shares."
          ],
          "processing_status": {
            "file_accessible": true,
            "content_readable": true,
            "extraction_method": "direct_text",
            "content_completeness": "full"
          },
          "quality_assessment": {
            "task_completion_score": 8,
            "confidence_level": "high",
            "data_reliability": "high",
            "limitations": [
              "Could not find the definitive stock price after listing; GMP suggests an approximate range.",
              "Relies on pre-listing data to infer stock performance."
            ],
            "recommendations": [
              "Check for updates after the listing date (May 6, 2025) to get the actual stock price and performance.",
              "Consult live stock data for real-time updates."
            ]
          }
        },
        "call_self": false,
        "cost": 0.0013279499999999998,
        "input_tokens": 7401.0,
        "output_tokens": 363.0,
        "total_tokens": 7764.0
      },
      "T003": {
        "initial_thoughts": "Based on the available data from T002, which primarily contains pre-listing information about Ather Energy's IPO, I will generate a summary of the expected stock performance after listing. Since the actual stock price post-listing isn't available, I will rely on the Grey Market Premium (GMP) to infer a potential listing price and highlight the limitations of this approach.",
        "output": {
          "final_format": "html",
          "images": [],
          "fallback_markdown": "Based on pre-listing data, Ather Energy's stock was expected to list between ₹316 and ₹326.  The IPO price was set between ₹304 and ₹321 per share.  However, actual post-listing stock performance data is not available.",
          "reasoning": "Generated an HTML report summarizing Ather Energy's expected stock performance based on pre-listing data (IPO price and GMP). Included a table summarizing the key IPO details and a section on limitations and recommendations due to the absence of actual post-listing data.  I searched for images but didn't find any image URLs in the provided data, so I am including a section explaining this.",
          "formatted_report_T003": "<div class='report'><h1 id='ather-energy-stock-performance-summary'>Ather Energy Stock Performance Summary (Based on Pre-Listing Data)</h1><div class='executive-summary'><h2 id='executive-summary'>Executive Summary</h2><p>This report summarizes Ather Energy's expected stock performance after its IPO listing in India, based on available pre-listing data. Due to the absence of actual stock price data post-listing (expected on May 6, 2025), the analysis relies on the Grey Market Premium (GMP) to infer a potential listing price range. Key limitations and recommendations for obtaining actual stock performance data are highlighted.</p></div><div class='ipo-details'><h2 id='ipo-details'>IPO Details</h2><p>The following table summarizes the key details of Ather Energy's IPO:</p><table><thead><tr><th>Metric</th><th>Value</th></tr></thead><tbody><tr><td>IPO Price Band</td><td>₹304 to ₹321 per share</td></tr><tr><td>IPO Opening Date</td><td>April 28, 2025</td></tr><tr><td>IPO Closing Date</td><td>April 30, 2025</td></tr><tr><td>Expected Listing Date</td><td>May 6, 2025</td></tr><tr><td>Grey Market Premium (GMP)</td><td>₹5 per share</td></tr><tr><td>Potential Listing Price (Inferred)</td><td>₹316 - ₹326</td></tr><tr><td>Subscription Rate (Overall)</td><td>1.43 times</td></tr><tr><td>IPO Size</td><td>₹2,981 crore</td></tr></tbody></table></div><div class='stock-price-performance'><h2 id='stock-price-performance'>Stock Price Performance (Expected)</h2><p>Based on the Grey Market Premium (GMP) of ₹5 per share, the expected listing price for Ather Energy's stock was between ₹316 and ₹326. This suggests a potential modest gain at listing. However, it's crucial to note that GMPs are speculative and actual stock performance may vary significantly.</p></div><div class='limitations-and-recommendations'><h2 id='limitations-and-recommendations'>Limitations and Recommendations</h2><ul><li><b>Data Limitation:</b> This report is based on pre-listing data and does not reflect actual stock performance post-listing on May 6, 2025.</li><li><b>Inference Based on GMP:</b> The potential listing price is inferred from the Grey Market Premium (GMP), which is a speculative indicator and not a guaranteed reflection of actual market performance.</li><li><b>Recommendation:</b> To obtain accurate stock performance data, consult live stock data sources for real-time updates and official announcements from BSE and NSE after the listing date.</li></ul></div><div class='image-scan-debug'><h2 id='image-scan-debug'>Image Scan Debug</h2><p>During the data processing, I scanned the `T002` output for image URLs ending in `.jpg`, `.jpeg`, `.png`, or `.webp`. No such image URLs were found. Therefore, no images could be included in this report.</p></div></div>"
        },
        "call_self": false,
        "cost": 0.000938925,
        "input_tokens": 3481.5,
        "output_tokens": 694.5,
        "total_tokens": 4176.0
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T003"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Retrieve recent news articles and financial data about Ather Energy's stock price performance in India.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Search for recent news articles and financial data related to Ather Energy's stock price performance in India since its stock listing. Focus on reputable financial news sources and stock market data providers.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "completed",
      "output": {
        "data": [
          {
            "type": "text",
            "text": "[{'url': 'https://ipowatch.in/ather-energy-ipo-date-review-price-allotment-details/', 'content': 'Ather Energy IPO Date, Review, Price, Allotment Details - IPO Watch Skip to content Search Search IPO GMP IPO Upcoming IPO SME IPO IPO Review Subscription IPO Forms IPO Listing IPO Allotment Gold & Silver Gold Rate Today Gold Rate Mumbai Gold Rate Delhi Gold Rate Ahmedabad Gold Rate Bangalore Gold Rate Chennai Silver Rate Today More Buyback Rights Issues NCD IPO GMP IPO Upcoming IPO SME IPO IPO Review Subscription IPO Forms IPO Listing IPO Allotment Gold & Silver Gold Rate Today Gold Rate Mumbai Gold Rate Delhi Gold Rate Ahmedabad Gold Rate Bangalore Gold Rate Chennai Silver Rate Today More Buyback Rights Issues NCD App Free Demat [xs_social_login] Ather Energy IPO Date, Review, Price, Allotment Details Vijay Prajapati May 5, 2025 Ather Energy IPO open date is April 28, 2025 and the IPO will close on April 30, 2025. Ather Energy IPO is a Book Built Issue. The company to raise around 2,980 crores via IPO that comprises fresh issue of 2,626 crores and offer for sale up to 1,10,51,746 equity shares with face value of 1 each. Ather Energy IPO price band is 304 to 321 per share. The retail quota is 10% , QIB is 75%, and HNI is 15%. Ather Energy IPO to list on BSE, NSE on May 6, 2025. The allotment of Ather Energy IPO date is May 2, 2025. The company reported revenue of 1,789.1 crores in 2024 against 1,801.8 crore in 2023. The company reported loss of 1,059.7 crores in 2024 against loss of 864.5 crores in 2023. As per the financials the IPO investors should apply the IPO for a long term. Ather Energy IPO Details IPO Open Date: April 28, 2025 IPO Close Date: April 30, 2025 Face Value: 1 Per Equity Share IPO Price Band: 304 to 321 Issue Size: 2,980.73 Crores Fresh Issue: Approx 2,626 Crores Offer for Sale: Approx 11,051,746 Equity Shares Issue Type: Book Built Issue IPO Listing: BSE & NSE Retail Quota: Not more than 10% QIB Quota: Not more than 75% NII Quota: Not more than 15% DRHP Draft Prospectus: Click Here RHP Draft Prospectus: Click Here Anchor Investors List: Click Here Ather Energy IPO Market Lot The Ather Energy IPO minimum market lot is 46 shares with 14,766 application amount. The retail investors can apply up-to 13 lots with 598 shares of 1,91,958amount. Application Lot Size Shares Amount Retail Minimum 1 46 14,766 Retail Maximum 13 598 1,91,958 S-HNI Minimum 14 644 2,06,724 B-HNI Minimum 68 3,128 10,04,088 Ather Energy IPO Dates The Ather Energy IPO date is 28 April and the close date is 30 April. The Ather Energy IPO allotment will be finalized on 2 May and the IPO listing on 6 May. IPO Open Date: April 28, 2025 IPO Close Date: April 30, 2025 Basis of Allotment: May 2, 2025 Refunds: May 5, 2025 Credit to Demat Account: May 5, 2025 IPO Listing Date: May 6, 2025 Promoters of Ather Energy IPO The promoters of the company are Tarun Sanjay Mehta, Swapnil Babanlal Jain And Hero Motocorp Limited. About Ather Energy IPO Ather Energy is a top player in Indias electric two-wheeler (E2W) market. The company creates electric scooters, battery packs, charging stations, and related software and accessories. Its known for its innovation and leadership in electric mobility. It has a business of designing battery packs, charging infrastructure, associated software, and accessories. Ather is an all-electric vehicle company that designs all its products in India, showing its focus on local innovation and sustainability they have a focus on manufacturing battery packs and assembling E2Ws in-house and it ensures focus on quality and creativity. It is the first firm to sell two-wheeler (2W) OEM in India to establish a fast-charging network, branded as the Ather Grid and till now it has sold 1,09,577. Ather Energy IPO Company Financial Report The company reported revenue of 1,789.1 crores in 2024 against 1,801.8 crore in 2023. The company reported loss of 1,059.7 crores in 2024 against loss of 864.5 crores in 2023. Amount in Crores Period Ended Revenue Expense Profit After Tax Assets 2022 413.8 757.9 344.1 818.6 2023 1,801.8 2,666.3 864.5 1,97', 'images': [], 'rank': 1}, {'url': 'https://equitymarketinsights.com/ather-energy-ipo/', 'content': 'Ather Energy IPO: Date, Price, Allotment & Review Key Details Inside Skip to content Menu Menu Home IPOs IPO GMP Upcoming IPO IPO Allotment IPO Forms IPO Listing Subscription Rights Issue Buyback Investment Calculator SWP Calculator SIP Calculator Lumpsum Calculator Retirement Calculator EMI Calculator Holiday Calendar Ather Energy IPO: Date, Price, Allotment & Review Key Details Inside May 2, 2025 by Rameshbabu Praggnanandhaa Ather Energy , one of Indias leading electric scooter makers, is all set to launch its Initial Public Offering (IPO) soon. The Ather Energy IPO will open on April 28, 2025 , and close on April 30, 2025 . The listing of shares is expected to take place on the BSE and NSE on May 6, 2025 , while the allotment of shares is likely to be finalized by May 2, 2025 . The company aims to raise a total of 2,980 crore through this IPO. This includes a fresh issue of 2,626 crore and an Offer for Sale (OFS) of around 1.10 crore equity shares with a face value of 1 each. Open Demant With Zerodha [Free Lifetime] The price band for Ather Energy IPO is set between 304 to 321 per share . As per the share reservation, retail investors will get 10% , Qualified Institutional Buyers (QIBs) will have 75% , and High Net-worth Individuals (HNIs) will get 15% of the total issue. Financially, Ather reported a revenue of 1,789.1 crore in FY 2024 , slightly lower than 1,801.8 crore in FY 2023 . The company also recorded a loss of 863.9 crore in 2024 , which is better than the 1,062.3 crore loss in 2023 . Considering the companys growth potential in the electric vehicle space, many experts believe this IPO could be a good opportunity for long-term investors . Ather Energy, founded in 2013, is one of the top companies in Indias electric two-wheeler market. It designs and develops electric scooters, battery packs, charging stations, software, and accessories, all in-house , which highlights its strong focus on quality, innovation, and sustainability. Ather is the first electric two-wheeler brand in India to set up its own fast-charging network, known as Ather Grid, and it also offers Atherstack, a smart software platform with 64 connected features as of July 2024. The company follows a vertically integrated model, meaning it handles everything from product design to final assembly on its own, mainly at its manufacturing facility in Hosur, Tamil Nadu, which had an annual production capacity of 4.2 lakh electric vehicles and 3.8 lakh battery packs as of March 2024. In terms of sales, Ather sold 1,09,577 electric scooters in the financial year 2024 and 1,07,983 units in the first nine months ending December 2024. As of December 2024, Ather had a wide reach with 265 experience centres and 233 service centres in India, along with a growing presence in Nepal and Sri Lanka. Internationally, the brand had five experience centres and four service centres in Nepal, and ten experience centres with one service centre in Sri Lanka. The company also holds strong intellectual property, with 303 registered trademarks, 201 registered designs, and 45 patents, along with several pending applications. Athers growth strategy is based on four key pillars: complete in-house product development, smart software integration, premium market positioning, and efficient operations. By March 2024, Ather Energy employed 2,454 people, including 1,458 permanent staff and 996 off-roll workers, showing its strong commitment to building a skilled and growing workforce. Read Also Stock Market Today Analysis 29th Nov 2024 Overview of Contents Toggle Ather Energy IPO Overview Ather Energy IPOProspectus Ather Energy IPO Dates Ather Energy IPO Financial Information Ather Energy IPO Lot Size Ather Energy FY24 IPO Valuation Key Financial Ratios Explained in Simple Terms Peer Group Comparison Objects of the Issue Ather Energy IPO Review Ather Energy IPO Registrar: IPO Lead Managers (Merchant Bankers): Company Address: Ather Energy IPO FAQs What is Ather Energy IPO? When will', 'images': [{'url': 'https://equitymarketinsights.com/wp-content/uploads/2025/04/Ather-Energy-IPO.webp', 'alt_text': 'Ather Energy IPO 2025: Complete Guide to Subscription, Pricing, and More', 'title': 'Ather Energy IPO', 'width': '1920', 'height': '1080', 'class': 'aligncenter wp-image-7290 size-full', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 2}, {'url': 'https://www.firstpost.com/india/ather-energy-shares-to-debut-on-stock-exchanges-today-here-are-ipo-gmp-performance-stats-13885723.html', 'content': 'Ather Energy shares to debut on stock exchanges today: Here are IPO GMP, performance stats Firstpost Home Video Shows Vantage Firstpost America Firstpost Africa First Sports World Explainers News India Opinion Cricket Tech Entertainment Sports Health IPL 2025 Apple Incorporated Modi ji Justin Trudeau Trending Events Raisina Dialogue Champions Trophy Delhi Elections 2025 Budget 2025 US Elections 2024 Firstpost Defence Summit Sections Home Live TV Videos Shows World India Explainers Opinion Sports Cricket Health Tech/Auto Entertainment Web Stories Business Shows Vantage Firstpost America Firstpost Africa First Sports Fast and Factual Between The Lines Flashback Live TV Ather Energy shares to debut on stock exchanges today: Here are IPO GMP, performance stats Whatsapp Facebook Twitter Whatsapp Facebook Twitter Apple Incorporated Modi ji Justin Trudeau Trending Events Raisina Dialogue Champions Trophy Delhi Elections 2025 Budget 2025 US Elections 2024 Firstpost Defence Summit Sections Home Live TV Videos Shows World India Explainers Opinion Sports Cricket Health Tech/Auto Entertainment Web Stories Business Shows Vantage Firstpost America Firstpost Africa First Sports Fast and Factual Between The Lines Flashback Live TV Home India Ather Energy shares to debut on stock exchanges today: Here are IPO GMP, performance stats Ather Energy shares to debut on stock exchanges today: Here are IPO GMP, performance stats FP News Desk May 6, 2025, 06:00:14 IST Whatsapp Facebook Twitter With Ather Energy shares set to debut on the bourses today at around 10 am, many investors are looking towards the IPOs GMP to gauge potential listing price read more Advertisement Representational image. Pixabay Follow us on Google News Subscribe Join Us Ather Energy, one of Indias leading electric two-wheeler manufacturers, is set to make its debut on the Bombay Stock Exchange (BSE) and National Stock Exchange (NSE) today, marking a major milestone in the companys decade-long journey in the countrys rapidly evolving electric mobility space. The listing follows a three-day Initial Public Offering (IPO) that ran from April 28 to April 30, raising Rs 2,980.76 crore. The offering consisted of a fresh issue of Rs 2,626 crore and an Offer for Sale (OFS) of Rs 354.76 crore. STORY CONTINUES BELOW THIS AD IPO performance and subscription details The IPO was priced in the band of Rs 304 to Rs 321 per share, with a minimum lot size of 46 shares, requiring a retail investment of Rs 14,766. Athers issue saw a moderate overall subscription of 1.43 times, with retail investors subscribing 1.78 times, qualified institutional buyers (QIBs) 1.70 times, and non-institutional investors (NIIs) 0.66 times. More from India Indian Army practises long-range Pinaka missile firing in Pokhran Pahalgam: Centre tells states to conduct civil defence mock drills, activate air raid warning signals Interestingly, the employee portion was subscribed 5.43 times, indicating strong internal faith in the companys future. Ather Energy IPO GMP Ahead of the listing, shares of Ather Energy were commanding at a grey market premium (GMP) of +- Rs 5 per share, according to Investorgain. The figure suggested a potential listing price in the range of Rs 316-326 on the upper end of the Ather Energy IPO price band. Investors were expected to see gains of a meagre 2.18 per cent amid speculation of a flat debut on the bourses. GMP is the price at which an IPO share is being traded unofficially before it is listed on the stock exchange. It reflects how the market perceives the IPOif the GMP is positive (i.e., above the issue price), it suggests strong demand and expectations of a good listing gain. If its negative, it may signal weak sentiment. GMP is a speculative indicator, useful for gauging hype but not reliable for investment decisions. (Disclaimer: The article above is meant for informational purposes only, and should not be considered investment advice. Firstpost advises all readers to check with certifi', 'images': [{'url': 'https://images.firstpost.com/uploads/2025/04/Abbas-Araghchi-October-4-2024-Reuters-2025-04-fc91979bae42edfff20bb75a52f25920.jpg?im=FitAndFill=(284,159)', 'alt_text': 'Iran’s Araghchi accuses Israel’s Netanyahu of dragging US into Middle East crisis', 'title': 'Iran’s Araghchi accuses Israel’s Netanyahu of dragging US into Middle East crisis', 'width': '284', 'height': '159', 'class': 'cp_related_stories', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://images.firstpost.com/uploads/2025/05/Representational-Image-2025-05-05T225648.098-2025-05-5081d2379834399b1eea7e47bc5abe0f.jpg?im=FitAndFill=(284,159)', 'alt_text': \"Trump cuts science funds, France tells scientists 'come, join us'\", 'title': \"Trump cuts science funds, France tells scientists 'come, join us'\", 'width': '284', 'height': '159', 'class': 'cp_related_stories', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://images.firstpost.com/uploads/2024/11/UN-Secretary-General-Antonio-Guterres-2024-11-c785aef104c1a0f03df5b81f3f39382d-1200x675.jpg?im=FitAndFill=(284,159)', 'alt_text': \"'Military solution is no solution': UN chief urges 'maximum restraint' as India-Pak tensions reach boiling point\", 'title': \"'Military solution is no solution': UN chief urges 'maximum restraint' as India-Pak tensions reach boiling point\", 'width': '284', 'height': '159', 'class': 'cp_related_stories', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://images.firstpost.com/uploads/2025/05/Firstpost-2025-05-05T192734.150-2025-05-4a6cd577a53c50a156d82e00fee49bea.jpg?im=FitAndFill=(284,159)', 'alt_text': 'Pahalgam: Centre tells states to conduct civil defence mock drills, activate air raid warning signals', 'title': 'Pahalgam: Centre tells states to conduct civil defence mock drills, activate air raid warning signals', 'width': '284', 'height': '159', 'class': 'cp_related_stories', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://images.firstpost.com/uploads/2024/09/IPO-market-in-India-1-2024-09-dcc46a6b5cc9634d803cf02462cc57ba.jpg?im=FitAndFill=(596,336)', 'alt_text': 'Ather Energy shares to debut on stock exchanges today: Here are IPO GMP, performance stats', 'title': 'Ather Energy shares to debut on stock exchanges today: Here are IPO GMP, performance stats', 'class': 'cp_image_hyperlink', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://www.entrepreneur.com/en-in/news-and-trends/ather-energy-raises-inr-1340-crore-ahead-of-ipo-launch/490669', 'content': \"Ather Energy Raises INR 1,340 Crore Ahead Of IPO Launch | Entrepreneur Skip to content Menu Close Menu Sign In Subscribe Search Search Close Menu Subscribe to Entrepreneur Starting Up Growing a Business Franchise Inspiration For Subscribers Write for Entrepreneur Bookstore Ask an Expert Tips White Papers Podcasts Video Entrepreneur TV Webinars Entrepreneur Store Spotlight Entrepreneur Authorities Entrepreneur Authorities Magazine Subscription Edition Plus Minus United States Spanish Georgia India Asia Pacific Middle East United Kingdom Europe Facebook X LinkedIn YouTube Instagram RSS Copyright 2025 Entrepreneur Media, LLC All rights reserved. Entrepreneur and its related marks are registered trademarks of Entrepreneur Media LLC Home Home Breadcrumb Arrow News and Trends Ather Energy Raises INR 1,340 Crore Ahead Of IPO Launch Axis Capital, JM Financial, Nomura Financial Advisory and Securities (India), and HSBC Securities & Capital Markets are managing the issue. Ather's shares are expected to debut on the stock exchanges on May 6. By Entrepreneur Staff Apr 26, 2025 Share Copy You're reading Entrepreneur India, an international franchise of Entrepreneur Media. Freepik Electric two-wheeler manufacturer Ather Energy has secured INR 1,340 crore from anchor investors ahead of its highly anticipated initial public offering (IPO), according to a regulatory filing. The IPO, set to open for subscription on April 28, is the first mainboard listing of the 202526 financial year. The company allotted 4.17 crore shares to 36 anchor investors at INR 321 apiece, the top end of its price band of INR 304321. The anchor round drew strong interest from a mix of marquee global and domestic names. Custody Bank of Japan, Franklin Templeton, Abu Dhabi Investment Authority, Eastspring Investments, Morgan Stanley Investment Management, and Societe Generale were among the international investors participating. On the domestic front, mutual funds and insurers like PSBI Mutual Fund, Aditya Birla Sun Life MF and Insurance, ICICI Prudential MF, Invesco MF, ITI MF, and Union MF also backed the offering. The INR 2,981 crore IPO comprises a fresh issue of shares worth INR 2,626 crore and an offer-for-sale (OFS) of 1.1 crore equity shares by existing shareholders and promoters. At the upper end of the price band, Ather's valuation is pegged at around INR 11,956 crore. Proceeds from the fresh issue will be used to set up a new manufacturing facility for electric two-wheelers in Maharashtra and to pare down existing debt. The IPO structure sets aside 75 per cetn of the issue for qualified institutional buyers, 15 per cent for non-institutional investors, and the remaining 10 per cent for retail investors. The company will become the second major electric two-wheeler maker to list after Ola Electric Mobility, which launched its INR 6,145 crore IPO last August. Ola's issue included a fresh issue of up to INR 5,500 crore and an OFS of 8.5 crore equity shares. This marks a major milestone not just for Ather, but for the broader electric mobility sector in India. Beyond its IPO ambitions, Ather has been quietly strengthening its research and development efforts. The company recently expanded its product testing and validation centre, signaling a clear push to enhance innovation as competition in the electric mobility space intensifies. Axis Capital, JM Financial, Nomura Financial Advisory and Securities (India), and HSBC Securities & Capital Markets are managing the issue. Ather's shares are expected to debut on the stock exchanges on May 6. Wavy Line Wavy Line Entrepreneur Staff Entrepreneur Staff Editor For more than 30 years, Entrepreneur has set the course for success for millions of entrepreneurs and small business owners. We'll teach you the secrets of the winners and give you exactly what you need to lay the groundwork for success. Most Popular Red Arrow See all Chevron Right Buying / Investing in Business Meet the Person Who Invented Plastic that Dissolves in\", 'images': [], 'rank': 4}, {'url': 'https://inc42.com/buzz/ather-energy-sets-price-band-of-inr-304-321-for-ipo/', 'content': 'Ather Energy Sets Price Band Of INR 304-321 For IPO Skip to content MEDIA DATALABS REPORTS EVENTS COURSES INC42 COURSES D2CX D2CX by Inc42 is a 12-week hands-on program ManagementX ManagementX by Inc42 Indias first Startup Management D2CX Foundations D2CX Foundations by Inc42 is a 6 week BRANDLABS ABOUT The D2C & Retail Summit 2025 NEWS IN-DEPTH STARTUPS NEWSLETTERS PODCAST INDUSTRY INDUSTRY Stay ahead with the latest news, funding, startup financials, & governments policies on the hottest tech industries in the Indian startup ecosystem. Fintech Travel Tech Electric Vehicle Health Tech Edtech IT Logistics Retail Ecommerce Startup Ecosystem Enterprise Tech Clean Tech Consumer Internet Agritech MORE MORE ON INC42 Get featured, partner or work with India\\'s #1 startup media & intelligence platform and explore what else Inc42 has to offer. PARTNER WITH INC42 Startup Spotlight Guest Posts Advertise ABOUT INC42 About Ethics Careers Contact Us GLOSSARY RESOURCES Login JOIN INC42 PLUS NEWS IN-DEPTH STARTUPS NEWSLETTERS PODCAST INDUSTRY INDUSTRY Stay ahead with the latest news, funding, startup financials, & governments policies on the hottest tech industries in the Indian startup ecosystem. Fintech Travel Tech Electric Vehicle Health Tech Edtech IT Logistics Retail Ecommerce Startup Ecosystem Enterprise Tech Clean Tech Consumer Internet Agritech MORE MORE ON INC42 Get featured, partner or work with India\\'s #1 startup media & intelligence platform and explore what else Inc42 has to offer. PARTNER WITH INC42 Startup Spotlight Guest Posts Advertise ABOUT INC42 About Ethics Careers Contact Us GLOSSARY RESOURCES Stories Profiles Not Finding what you are looking for? Advanced filter Trending On Inc42 News Ecommerce To Morph Into Quick Commerce In India: Blinkit SVP By Lokesh C. 19 Jul\\'25 5 min read Foodtech Rebel Foods Reshuffle: Cofounder Ankush Grover Appointed Global CEO By Team Inc42 19 Jul\\'25 3 min read News Reliance Rolls Out 4-Hour Fashion Delivery Service AJIO Rush In 6 Ci... By Team Inc42 18 Jul\\'25 3 min read In-Depth Stories Ecommerce Lenskart Adds Smart Glasses To Its Cart: Next Growth Arc Or Risky Bet?... By Debarghya S. 18 Jul\\'25 9 min read In-Depth Indian Listed New-Age Tech Company Tracker: Market Cap, Revenue & More... By Akshit P. 17 Jul\\'25 8 min read In-Depth Why Every Fintech Startup Wants To Be The Next Zerodha By Bismah M. 17 Jul\\'25 11 min read SIGN IN JOIN INC42 PLUS NOW MEDIA DATALABS REPORTS EVENTS COURSES INC42 COURSES D2CX D2CX by Inc42 is a 12-week hands-on program ManagementX ManagementX by Inc42 Indias first Startup Management D2CX Foundations D2CX Foundations by Inc42 is a 6 week BRANDLABS ABOUT The D2C & Retail Summit 2025 FOLLOW INC42 Share story [mashshare networks=\"facebook,twitter,linkedin\" services=\"3\"] Clean Tech Ather Energy Sets Price Band Of INR 304-321 For IPO 23 Apr\\'25 | By Amit Singh SUMMARY Ather Energy\\'s IPO will comprise a fresh issue of equity shares aggregating up to INR 2,626 Cr and an offer for sale of up to 1.10 Cr shares The issue will open for subscription on April 28 and close on April 30 At the upper end of the price band, the company would be valued at about INR 11,955 Cr (about $1.4 Bn) FOLLOW US FOLLOW US Added to Saved Stories in Login VIEW SAVED STORIES EV major Ather Energy has set a price band of INR 304 to INR 321 per share for its initial public offering (IPO) that will open for subscription on April 28. The anchor investor bidding will take place on April 25. The issue will close on April 30. At the upper end of the price band, Ather Energy would be valued at about INR 11,955 Cr (around $1.4 Bn). Ather filed its red herring prospectus (RHP) with SEBI yesterday. Its IPO will comprise a fresh issue of equity shares aggregating up to INR 2,626 Cr and an offer for sale of up to 1.10 Cr shares. At INR 321 apiece, the size of the OFS will be INR 354.76 Cr. Promoters Tarun Mehta and Swapnil Jain will be selling 9.80 Lakh equity shares each in the OFS. Among investors, Caladium Inves', 'images': [{'url': 'https://asset.inc42.com/2023/09/featured.png', 'alt_text': 'Ather Energy Sets Price Band Of INR 304-321 For IPO-Inc42 Media', 'class': 'plus_feature_img', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://asset.inc42.com/2023/09/academy.png', 'alt_text': 'Ather Energy Sets Price Band Of INR 304-321 For IPO-Inc42 Media', 'class': 'plus_feature_img', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://asset.inc42.com/2023/09/reports.png', 'alt_text': 'Ather Energy Sets Price Band Of INR 304-321 For IPO-Inc42 Media', 'class': 'plus_feature_img', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://asset.inc42.com/2023/09/trackers.png', 'alt_text': 'Ather Energy Sets Price Band Of INR 304-321 For IPO-Inc42 Media', 'class': 'plus_feature_img', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://asset.inc42.com/2023/09/perks5.png', 'alt_text': 'Ather Energy Sets Price Band Of INR 304-321 For IPO-Inc42 Media', 'height': '90', 'class': 'inc42_plus__benefit_feature_img', 'confidence': 0.8999999999999999}], 'rank': 5}, {'url': 'https://inc42.com/buzz/ather-energy-shares-list-at-2-premium-over-ipo-price/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.plindia.com/blogs/india-ipo-boom-2025-ather-energy-top-sme-listings-to-watch-this-may/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.angelone.in/news/ather-energy-ipo-allotment-status', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-19T03:46:22.409120",
      "end_time": "2025-07-19T03:46:54.369749",
      "execution_time": 31.960629,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T002",
      "description": "Extract the stock price information (current price, price change since listing) from the retrieved data.",
      "agent": "DistillerAgent",
      "agent_prompt": "Analyze the news articles and financial data from T001. Extract the current stock price of Ather Energy, the price change since its initial listing in India, and any relevant commentary on its stock performance. Focus on numerical data and key insights regarding its performance.",
      "reads": [
        "T001"
      ],
      "writes": [
        "T002"
      ],
      "status": "completed",
      "output": {
        "initial_thoughts": "Let me think through this. The input contains news articles about Ather Energy's IPO. I need to extract the stock price after listing, the change from the IPO price, and relevant commentary.",
        "output": {
          "summary_bullets": [
            "Ather Energy IPO price band was between ₹304 to ₹321 per share.",
            "The IPO opened on April 28, 2025, and closed on April 30, 2025.",
            "Listing was expected on BSE and NSE on May 6, 2025.",
            "Grey Market Premium (GMP) ahead of listing was ₹5 per share, suggesting a potential listing price of ₹316-₹326.",
            "Subscription rate was moderate at 1.43 times overall.",
            "Retail investors subscribed 1.78 times, QIBs 1.70 times, and NIIs 0.66 times.",
            "Employee portion was subscribed 5.43 times.",
            "Proceeds from the IPO will be used to set up a new manufacturing facility in Maharashtra and to reduce existing debt.",
            "The IPO size was ₹2,981 crore, comprising a fresh issue of shares worth ₹2,626 crore and an OFS of 1.1 crore equity shares."
          ],
          "processing_status": {
            "file_accessible": true,
            "content_readable": true,
            "extraction_method": "direct_text",
            "content_completeness": "full"
          },
          "quality_assessment": {
            "task_completion_score": 8,
            "confidence_level": "high",
            "data_reliability": "high",
            "limitations": [
              "Could not find the definitive stock price after listing; GMP suggests an approximate range.",
              "Relies on pre-listing data to infer stock performance."
            ],
            "recommendations": [
              "Check for updates after the listing date (May 6, 2025) to get the actual stock price and performance.",
              "Consult live stock data for real-time updates."
            ]
          }
        },
        "call_self": false,
        "cost": 0.0013279499999999998,
        "input_tokens": 7401.0,
        "output_tokens": 363.0,
        "total_tokens": 7764.0
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-19T03:46:54.378743",
      "end_time": "2025-07-19T03:47:00.274942",
      "execution_time": 5.896199,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T003",
      "description": "Summarize Ather Energy's stock price performance after its stock listing in India.",
      "agent": "FormatterAgent",
      "agent_prompt": "Based on the extracted stock price information from T002, create a concise summary of Ather Energy's stock price performance after its listing in India. Include the current stock price, the price change since listing, and any relevant context or commentary. Use clear and concise language for easy understanding. Display the findings in a table.",
      "reads": [
        "T002"
      ],
      "writes": [
        "T003"
      ],
      "status": "completed",
      "output": {
        "initial_thoughts": "Based on the available data from T002, which primarily contains pre-listing information about Ather Energy's IPO, I will generate a summary of the expected stock performance after listing. Since the actual stock price post-listing isn't available, I will rely on the Grey Market Premium (GMP) to infer a potential listing price and highlight the limitations of this approach.",
        "output": {
          "final_format": "html",
          "images": [],
          "fallback_markdown": "Based on pre-listing data, Ather Energy's stock was expected to list between ₹316 and ₹326.  The IPO price was set between ₹304 and ₹321 per share.  However, actual post-listing stock performance data is not available.",
          "reasoning": "Generated an HTML report summarizing Ather Energy's expected stock performance based on pre-listing data (IPO price and GMP). Included a table summarizing the key IPO details and a section on limitations and recommendations due to the absence of actual post-listing data.  I searched for images but didn't find any image URLs in the provided data, so I am including a section explaining this.",
          "formatted_report_T003": "<div class='report'><h1 id='ather-energy-stock-performance-summary'>Ather Energy Stock Performance Summary (Based on Pre-Listing Data)</h1><div class='executive-summary'><h2 id='executive-summary'>Executive Summary</h2><p>This report summarizes Ather Energy's expected stock performance after its IPO listing in India, based on available pre-listing data. Due to the absence of actual stock price data post-listing (expected on May 6, 2025), the analysis relies on the Grey Market Premium (GMP) to infer a potential listing price range. Key limitations and recommendations for obtaining actual stock performance data are highlighted.</p></div><div class='ipo-details'><h2 id='ipo-details'>IPO Details</h2><p>The following table summarizes the key details of Ather Energy's IPO:</p><table><thead><tr><th>Metric</th><th>Value</th></tr></thead><tbody><tr><td>IPO Price Band</td><td>₹304 to ₹321 per share</td></tr><tr><td>IPO Opening Date</td><td>April 28, 2025</td></tr><tr><td>IPO Closing Date</td><td>April 30, 2025</td></tr><tr><td>Expected Listing Date</td><td>May 6, 2025</td></tr><tr><td>Grey Market Premium (GMP)</td><td>₹5 per share</td></tr><tr><td>Potential Listing Price (Inferred)</td><td>₹316 - ₹326</td></tr><tr><td>Subscription Rate (Overall)</td><td>1.43 times</td></tr><tr><td>IPO Size</td><td>₹2,981 crore</td></tr></tbody></table></div><div class='stock-price-performance'><h2 id='stock-price-performance'>Stock Price Performance (Expected)</h2><p>Based on the Grey Market Premium (GMP) of ₹5 per share, the expected listing price for Ather Energy's stock was between ₹316 and ₹326. This suggests a potential modest gain at listing. However, it's crucial to note that GMPs are speculative and actual stock performance may vary significantly.</p></div><div class='limitations-and-recommendations'><h2 id='limitations-and-recommendations'>Limitations and Recommendations</h2><ul><li><b>Data Limitation:</b> This report is based on pre-listing data and does not reflect actual stock performance post-listing on May 6, 2025.</li><li><b>Inference Based on GMP:</b> The potential listing price is inferred from the Grey Market Premium (GMP), which is a speculative indicator and not a guaranteed reflection of actual market performance.</li><li><b>Recommendation:</b> To obtain accurate stock performance data, consult live stock data sources for real-time updates and official announcements from BSE and NSE after the listing date.</li></ul></div><div class='image-scan-debug'><h2 id='image-scan-debug'>Image Scan Debug</h2><p>During the data processing, I scanned the `T002` output for image URLs ending in `.jpg`, `.jpeg`, `.png`, or `.webp`. No such image URLs were found. Therefore, no images could be included in this report.</p></div></div>"
        },
        "call_self": false,
        "cost": 0.000938925,
        "input_tokens": 3481.5,
        "output_tokens": 694.5,
        "total_tokens": 4176.0
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-19T03:47:00.292950",
      "end_time": "2025-07-19T03:47:09.241473",
      "execution_time": 8.948523,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "T001",
      "target": "T002"
    },
    {
      "source": "T002",
      "target": "T003"
    }
  ]
}