{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "53441325",
    "original_query": "Conduct comprehensive market research on electric vehicle trends and create a detailed analysis report with visualizations",
    "file_manifest": [],
    "created_at": "2025-07-25T11:02:05.795769",
    "status": "running",
    "output_chain": {
      "T001": {
        "ev_market_data": [
          {
            "type": "text",
            "text": "[{'url': 'https://ourworldindata.org/electric-car-sales', 'content': 'Tracking global data on electric vehicles - Our World in Data Our World in Data Browse by topic Data Insights Resources About Subscribe Donate Gdoc / Admin Home Energy Tracking global data on electric vehicles Explore data on electric car sales and stocks worldwide. By: Hannah Ritchie First published in February 2024. Last updated in May 2025. Cite this article Reuse our work freely Electric vehicles are an essential solution to decarbonizing transport. Electric cars tend to have a lower carbon footprint than petrol or diesel cars over their lifetimes. While more carbon is emitted in the manufacturing stage, this carbon debt tends to pay off quickly once theyre on the road. 1 The carbon savings are higher in countries with a cleaner electricity mix , and these savings will also increase as countries continue to decarbonize their electricity grids. How quickly are countries moving to electrified transport? Which countries are leading the way? In this article, we look at data from across the world on electric vehicle (EV) sales and the stock on the road. This data comes from the International Energy Agency . It publishes its Global EV Outlook every year. We will update this data every time a new release is published. 2 Sales of new cars What share of new cars are electric? Sales of electric cars started from a low base but are growing quickly in many markets. Globally, over 1-in-5 (22%) of new cars sold were electric in 2024. This share was 92% in Norway, and in China, it was almost 50%. In the chart below, you can explore these trends across the world. Here, electric cars include fully battery-electric vehicles and plug-in hybrids . Fully-electric cars vs. plug-in hybrids Electric cars include battery-electric and plug-in hybrid vehicles. The difference is that fully battery-electric cars do not have an internal combustion engine. In contrast, plug-in hybrids have a rechargeable battery and electric motor, and an internal combustion engine that runs on gasoline. That means a plug-in hybrid could be driven as a standard petrol car if the owner did not charge the battery. The battery in plug-in hybrids is smaller and has a shorter range than battery-electric cars, so over longer distances, the car starts running on gasoline once the battery has run out. Since plug-in hybrids will often run on petrol, they tend to emit more carbon than battery-electric cars. However, they do usually have lower emissions than petrol or diesel cars. 3 In the first chart below you can see electric car sales broken down by these two technologies. This is given as a share of new cars sold each year. In the second, you will find the share of new electric cars sold that are fully battery-electric . How many new electric cars are sold each year? The chart below shows the total number of new electric cars sold. Again, this includes fully battery-electric and plug-in hybrids . Clicking on any country will show how sales have changed over time. How many new internal combustion engine cars and electric cars are sold each year? Based on the data published by the IEA on the number of electric cars sold, and EV sales as a share of all new cars, we can calculate the absolute number of new cars of each type sold each year. These figures suggest that global sales of non-electric cars peaked in 2018. This aligns with other estimates published elsewhere; for example, Bloomberg New Energy Finance reported that sales peaked in 2017. You can explore this data for other countries in the chart below, too. Stocks of cars in use What share of cars on the road are electric? The cars that are on the road today represent sales data over more than a decade. This can be captured in a metric called stocks. Its an approximation of the number of cars that are in use and represents the balance of cars being added and those that are being retired. Because people use their cars for a long time, it takes time before new sales have a visible influence on car stocks. That means the share', 'images': [], 'rank': 1}, {'url': 'https://www.statista.com/outlook/mmo/electric-vehicles/worldwide', 'content': 'Electric Vehicles - Worldwide | Statista Market Forecast Skip to main content Open Statistics All Industries Consumer Goods & FMCG E-Commerce Economy & Politics Energy & Environment Internet Technology & Telecommunications Transportation & Logistics Travel, Tourism & Hospitality Reports Report Shop Search our report database Digital & Trend reports Overview and forecasts on trending topics Industry & Market reports Industry and market insights and forecasts Companies & Products reports Key figures and rankings about companies and products Consumer & Brand reports Consumer and brand insights and preferences in various industries Politics & Society reports Detailed information about political and social topics Country & Region reports All key figures about countries and regions Find your information in our database containing over 20,000 reports Insights Market Insights Market forecast and expert KPIs for 1000+ markets in 190+ countries & territories Explore Market Insights Consumer eCommerce Mobility Consumer Insights Insights on consumer attitudes and behavior worldwide 3,000,000+ interviews 15,000+ brands Explore Consumer Insights eCommerce Insights Detailed information for 39,000+ online stores and marketplaces 70+ KPIs per store Revenue analytics and forecasts Explore eCommerce Insights Research AI NEW Daily Data Services The statistics portal Directly accessible data for 170 industries from 150+ countries and over 1 million facts: More about Statista About Statista Why trust Statista First steps and help center Webinar & Training Hub Statista Connect Services Statista+ offers additional, data-driven services, tailored to your specific needs. As your partner for data-driven success, we combine expertise in research, strategy, and marketing communications. Research Full-service market research and analytics Customized market research Data analytics Ad hoc research \"askStatista\" Research Solutions Strategy Strategy and business building for the data-driven economy Build strategies Create data value Realize business opportunities Strategy Consulting Communication Transforming data into content marketing and design: Data storytelling Creative assets Distribution Communication Services Statista R identifies and awards industry leaders, top providers, and exceptional brands through exclusive rankings and top lists in collaboration with renowned media brands worldwide. For more details, visit our website. Solutions Why Statista See why Statista is the trusted choice for reliable data and insights. We provide one platform to simplify research and support your strategic decisions. Learn more By Industry Academia Agencies Consultancies Consumer Goods Finance Tech By Function Marketing Research & Development Strategy By Use case Find the fact Tell the story Win the pitch Understand the market Develop your strategy Resource Hub Expert resources to inform and inspire. Success stories Live webinars & recordings Prices & Access Business Solutions Academia and Government statista.com statista.de statista.es statista.fr Login Market Insights Mobility Electric Vehicles - Worldwide Worldwide Highlights In 2025, the revenue in the Electric Vehicles market is projected to reach a staggering US$784.2bn worldwide. Looking ahead, it is expected that the market will demonstrate a steady annual growth rate (CAGR 2025-2029) of 6.01%. This growth will ultimately lead to a projected market volume of US$990.4bn by 2029. Moreover, the unit sales of Electric Vehicles market are anticipated to reach 17.36m vehicles units by 2029. When examining the market in 2025, it is predicted that the volume weighted average price of Electric Vehicles market will amount to US$57.4k. From an international perspective, it is evident that China will generate the highest revenue, with an estimated US$377bn in 2025. This showcases the significant presence of Electric Vehicles market in the Chinese market segment. Electric vehicle adoption is rapidly increasing worl', 'images': [], 'rank': 2}, {'url': 'https://www.reuters.com/business/autos-transportation/global-electric-vehicle-sales-up-25-record-2024-2025-01-14/', 'content': '[error] Timeout while extracting content', 'rank': 3}, {'url': 'https://about.bnef.com/insights/clean-transport/global-electric-vehicle-sales-set-for-record-breaking-year-even-as-us-market-slows-sharply-bloombergnef-finds/', 'content': \"Global Electric Vehicle Sales Set for Record-Breaking Year, Even as US Market Slows Sharply, BloombergNEF Finds | BloombergNEF Skip to content Bloomberg the Company & Its Products The Company & its Products Bloomberg Terminal Demo Request Bloomberg Anywhere Remote Login Bloomberg Anywhere Login Bloomberg Customer Support Customer Support Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world For Customers Bloomberg Anywhere Remote Login Software Updates Manage Products and Account Information Support Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 Company About Careers Inclusion at Bloomberg Tech at Bloomberg Philanthropy Sustainability Bloomberg Beta Communications Press Announcements Press Contacts Follow Facebook Instagram LinkedIn YouTube Products Bloomberg Terminal Data Trading Risk Compliance Indices Industry Products Bloomberg Law Bloomberg Tax Bloomberg Government BloombergNEF Media Bloomberg Markets Bloomberg Technology Bloomberg Pursuits Bloomberg Politics Bloomberg Opinion Bloomberg Businessweek Bloomberg Live Conferences Bloomberg Radio Bloomberg Television News Bureaus Media Services Bloomberg Media Distribution Advertising Company About Careers Inclusion at Bloomberg Tech at Bloomberg Philanthropy Sustainability Bloomberg Beta Communications Press Announcements Press Contacts Follow Facebook Instagram LinkedIn YouTube Products Bloomberg Terminal Data Trading Risk Compliance Indices Industry Products Bloomberg Law Bloomberg Tax Bloomberg Government BloombergNEF Media Bloomberg Markets Bloomberg Technology Bloomberg Pursuits Bloomberg Politics Bloomberg Opinion Bloomberg Businessweek Bloomberg Live Conferences Bloomberg Radio Bloomberg Television News Bureaus Media Services Bloomberg Media Distribution Advertising Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world For Customers Bloomberg Anywhere Remote Login Software Updates Manage Contracts and Orders Support Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 BloombergNEF What we do Who we help Commodities Traders Review projections and risks within the commodities market. Financial Institutions Identify rising technologies and find your next big investment. Corporations Make strategic decisions to position your business for success. Governments Analyze how policy change and capital flows impact the energy transition. Electric Vehicle Outlook An annual long-term report on how electrification, shared mobility, autonomous driving and other factors will impact road transport. Download report Insights BNEF RESEARCH All Insights TOPICS Clean Energy Clean Transport Commodities Finance Industry and Buildings Nature and Agriculture Featured reports New Energy Outlook Electric Vehicle Outlook Energy Transition Investment Trends Transition Metals Outlook Global Gas and LNG Outlooks Public Resources Climatescope NetZero Pathfinders Carbon Knowledge Hub Climate Week and COP Public Research View all insights Events BNEF EVENTS All Events Register for upcoming events and replay past recordings. Sponsorship Showcase your company's role in the energy transition while expanding your network at events around the world. Event locations Americas Asia Pacific Europe, Middle East and Africa BNEF Summits Bringing together leaders in energy, industry, transport, technology, finance and government since 2008. Find upcoming About WHO WE ARE About BloombergNEF Find out more about BNEF and our mission to bring clarity to the energy transition. CONNECT Contact us Get global customer support or learn how we can help your firm. Press Search our latest press releases and contact the BNEF Media team. Careers Explore exciting job opportunities at BNEF\", 'images': [{'url': 'https://assets.bbhub.io/image/v1/resize?type=auto&url=https%3A%2F%2Fassets.bbhub.io%2Fprofessional%2Fsites%2F44%2Fwind-and-solar.jpg&width=1024', 'alt_text': 'wind and solar plant', 'width': '1024', 'height': '766', 'class': 'attachment-large size-large wp-post-image', 'confidence': 0.8999999999999999}, {'url': 'https://assets.bbhub.io/image/v1/resize?type=auto&url=https%3A%2F%2Fassets.bbhub.io%2Fprofessional%2Fsites%2F44%2FAgirculture1.jpg&width=1024', 'alt_text': 'Agriculture - field', 'width': '1024', 'height': '666', 'class': 'attachment-large size-large wp-post-image', 'confidence': 0.8999999999999999}, {'url': 'https://assets.bbhub.io/image/v1/resize?type=auto&url=https%3A%2F%2Fassets.bbhub.io%2Fprofessional%2Fsites%2F44%2Fsolar-aerial.jpg&width=1024', 'alt_text': 'Solar plant aerial view', 'width': '1024', 'height': '647', 'class': 'attachment-large size-large wp-post-image', 'confidence': 0.8999999999999999}, {'url': 'https://assets.bbhub.io/image/v1/resize?type=auto&url=https%3A%2F%2Fassets.bbhub.io%2Fprofessional%2Fsites%2F44%2Findia-solar6.jpg&width=1024', 'alt_text': 'Solar panels inspection', 'width': '1024', 'height': '675', 'class': 'attachment-large size-large wp-post-image', 'confidence': 0.8999999999999999}, {'url': 'https://assets.bbhub.io/image/v1/resize?type=auto&url=https%3A%2F%2Fassets.bbhub.io%2Fprofessional%2Fsites%2F44%2Fshutterstock_2227403165resiz.jpg&width=1024', 'alt_text': 'Mangrove forest', 'width': '1024', 'height': '766', 'class': 'attachment-large size-large wp-post-image', 'confidence': 0.8999999999999999}], 'rank': 4}, {'url': 'https://evboosters.com/ev-charging-news/overall-results-global-ev-sales-2024/', 'content': \"Overall results Global EV Sales 2024 | EVBoosters Skip to content Partners Approach Candidates EV News About us Charging Academy Partners Approach Candidates EV News About us Charging Academy Home EV Charging News Overall results Global EV Sales 2024 Overall results Global EV Sales 2024 The global electric vehicle (EV) market surged to new heights in 2024, marking a 25% year-over-year growth and culminating in 17.1 million EVs sold worldwide. December alone saw record-breaking sales of 1.9 million units, a 26% increase compared to the same month in 2023. Despite a stabilisation of the growth in Europe, the Chinese market grew by an astonishing +40%, representing 11 million cars with a plug.Subsidies, tax credits, and stringent emission standards were pivotal in driving EV adoption in 2024. China's trade-in scheme, Europe's emission pooling strategies, and North America's tax credits highlight how regulatory frameworks influence consumer and manufacturer behaviour. January 15, 2025 Editorial Board EVBoosters China: The Dominant Force China retained its position as the largest EV market, accounting for a significant portion of global sales. The country achieved a record-breaking 1.3 million EV sales in December 2024, contributing to an annual total of 11 million unitsan impressive 40% year-over-year increase. Much of this growth can be attributed to the dominance of domestic automaker BYD, responsible for one in three EVs sold. Chinas robust trade-in scheme and continued incentives further bolstered market expansion. Europe: stabilization amid policy shifts Europes EV market faced mixed outcomes, finishing the year 5,9% lower compared to 2023. However, the United Kingdom emerged as the new leader in battery electric vehicle (BEV) sales, overtaking Germany, primarily due to implementing the UK ZEV (Zero Emission Vehicle) mandate. European automakers are preparing for stringent 2025 emissions standards, with collaborative carbon credit pools already announced to avoid regulatory fines. Despite challenges like subsidy cuts in Germany, stabilisation in December with 310,000 units solda slight 0.7% year-over-year increaseindicates resilience. United States and Canada: steady progress The North American EV market grew by 9% in 2024, recording 190,000 units sold in December. The $7,500 federal EV tax credit played a crucial role in sustaining sales momentum, though its future remains uncertain under potential policy shifts in the upcoming Trump administration. Alongside the Environmental Protection Agencys emission standards, these factors will likely shape the North American markets trajectory in the coming years. Rest of the World: Emerging Opportunities Outside of these key markets, EV sales rose by 26.4% in December 2024. Regions across Asia-Pacific, Latin America, and Africa are beginning to show increased adoption as governments introduce localized incentives and infrastructure improvements to support EV uptake. Challenges and Regional Market Trends EV Sales 2024 Despite these achievements, challenges persist. The removal of subsidies in markets like Germany had a noticeable impact on sales, signalling potential risks if similar policies are enacted in other regions. The high cost of raw materials, particularly lithium, and geopolitical uncertainties surrounding trade policies may also influence market dynamics. Future Outlook EV Sales 2025 Looking ahead, 2025 is poised to be another transformative year for the EV / Automotive industry. Europes new emissions regulations and the continuation of Chinas trade-in scheme will be critical drivers. However, potential changes in U.S. EV policy under the Trump administration could introduce uncertainty in North America. As automakers invest heavily in research and development, expect to see continued advancements in battery efficiency and vehicle automation. Increased collaboration between governments and private sectors will likely accelerate the development of charging networks, further\", 'images': [{'url': 'https://evboosters.com/wp-content/uploads/2024/06/EVB-CHARGING-black-1.png', 'alt_text': 'evb charging black 1', 'width': '2550', 'height': '461', 'class': 'attachment-full size-full wp-image-27018', 'confidence': 0.8999999999999999}, {'url': 'https://evboosters.com/wp-content/uploads/2025/01/Overall-results-global-EV-Sales-2024-min-1-1.jpg', 'alt_text': 'overall results global ev sales 2024 min', 'width': '2494', 'height': '1468', 'class': 'attachment-full size-full wp-image-39153', 'confidence': 0.8999999999999999}, {'url': 'https://evboosters.com/wp-content/uploads/2025/07/Top-High-Power-Charging-Charge-Point-Operators-France-June-2025-min-1-300x202.png', 'alt_text': 'top high power charging charge point operators france june 2025 min (1)', 'width': '300', 'height': '202', 'class': 'attachment-medium size-medium wp-image-42872', 'confidence': 0.8999999999999999}, {'url': 'https://evboosters.com/wp-content/uploads/2025/07/Why-top-talent-is-leaving-your-EV-Charging-company-300x172.jpg', 'alt_text': 'why top talent is leaving your ev charging company', 'width': '300', 'height': '172', 'class': 'attachment-medium size-medium wp-image-42771', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://evboosters.com/wp-content/uploads/2025/07/EV-Sales-H1-2025-Volkswagen-Group-min-1-300x213.jpg', 'alt_text': 'ev sales h1 2025 volkswagen group min (1)', 'width': '300', 'height': '213', 'class': 'attachment-medium size-medium wp-image-42602', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 5}, {'url': 'https://www.iea.org/reports/global-ev-outlook-2024/trends-in-electric-cars', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.statista.com/topics/1010/electric-mobility/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://evcurvefuturist.com/2025/02/global-ev-sales-2024-final-figures-and-key-insights/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T007"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Gather data on current electric vehicle market size and growth rate.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Collect data on the current global and regional electric vehicle market size, including sales volume and revenue. Also, find projections for the growth rate of the EV market over the next 5-10 years. Focus on reputable sources such as market research reports, industry publications, and government statistics.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "completed",
      "output": {
        "ev_market_data": [
          {
            "type": "text",
            "text": "[{'url': 'https://ourworldindata.org/electric-car-sales', 'content': 'Tracking global data on electric vehicles - Our World in Data Our World in Data Browse by topic Data Insights Resources About Subscribe Donate Gdoc / Admin Home Energy Tracking global data on electric vehicles Explore data on electric car sales and stocks worldwide. By: Hannah Ritchie First published in February 2024. Last updated in May 2025. Cite this article Reuse our work freely Electric vehicles are an essential solution to decarbonizing transport. Electric cars tend to have a lower carbon footprint than petrol or diesel cars over their lifetimes. While more carbon is emitted in the manufacturing stage, this carbon debt tends to pay off quickly once theyre on the road. 1 The carbon savings are higher in countries with a cleaner electricity mix , and these savings will also increase as countries continue to decarbonize their electricity grids. How quickly are countries moving to electrified transport? Which countries are leading the way? In this article, we look at data from across the world on electric vehicle (EV) sales and the stock on the road. This data comes from the International Energy Agency . It publishes its Global EV Outlook every year. We will update this data every time a new release is published. 2 Sales of new cars What share of new cars are electric? Sales of electric cars started from a low base but are growing quickly in many markets. Globally, over 1-in-5 (22%) of new cars sold were electric in 2024. This share was 92% in Norway, and in China, it was almost 50%. In the chart below, you can explore these trends across the world. Here, electric cars include fully battery-electric vehicles and plug-in hybrids . Fully-electric cars vs. plug-in hybrids Electric cars include battery-electric and plug-in hybrid vehicles. The difference is that fully battery-electric cars do not have an internal combustion engine. In contrast, plug-in hybrids have a rechargeable battery and electric motor, and an internal combustion engine that runs on gasoline. That means a plug-in hybrid could be driven as a standard petrol car if the owner did not charge the battery. The battery in plug-in hybrids is smaller and has a shorter range than battery-electric cars, so over longer distances, the car starts running on gasoline once the battery has run out. Since plug-in hybrids will often run on petrol, they tend to emit more carbon than battery-electric cars. However, they do usually have lower emissions than petrol or diesel cars. 3 In the first chart below you can see electric car sales broken down by these two technologies. This is given as a share of new cars sold each year. In the second, you will find the share of new electric cars sold that are fully battery-electric . How many new electric cars are sold each year? The chart below shows the total number of new electric cars sold. Again, this includes fully battery-electric and plug-in hybrids . Clicking on any country will show how sales have changed over time. How many new internal combustion engine cars and electric cars are sold each year? Based on the data published by the IEA on the number of electric cars sold, and EV sales as a share of all new cars, we can calculate the absolute number of new cars of each type sold each year. These figures suggest that global sales of non-electric cars peaked in 2018. This aligns with other estimates published elsewhere; for example, Bloomberg New Energy Finance reported that sales peaked in 2017. You can explore this data for other countries in the chart below, too. Stocks of cars in use What share of cars on the road are electric? The cars that are on the road today represent sales data over more than a decade. This can be captured in a metric called stocks. Its an approximation of the number of cars that are in use and represents the balance of cars being added and those that are being retired. Because people use their cars for a long time, it takes time before new sales have a visible influence on car stocks. That means the share', 'images': [], 'rank': 1}, {'url': 'https://www.statista.com/outlook/mmo/electric-vehicles/worldwide', 'content': 'Electric Vehicles - Worldwide | Statista Market Forecast Skip to main content Open Statistics All Industries Consumer Goods & FMCG E-Commerce Economy & Politics Energy & Environment Internet Technology & Telecommunications Transportation & Logistics Travel, Tourism & Hospitality Reports Report Shop Search our report database Digital & Trend reports Overview and forecasts on trending topics Industry & Market reports Industry and market insights and forecasts Companies & Products reports Key figures and rankings about companies and products Consumer & Brand reports Consumer and brand insights and preferences in various industries Politics & Society reports Detailed information about political and social topics Country & Region reports All key figures about countries and regions Find your information in our database containing over 20,000 reports Insights Market Insights Market forecast and expert KPIs for 1000+ markets in 190+ countries & territories Explore Market Insights Consumer eCommerce Mobility Consumer Insights Insights on consumer attitudes and behavior worldwide 3,000,000+ interviews 15,000+ brands Explore Consumer Insights eCommerce Insights Detailed information for 39,000+ online stores and marketplaces 70+ KPIs per store Revenue analytics and forecasts Explore eCommerce Insights Research AI NEW Daily Data Services The statistics portal Directly accessible data for 170 industries from 150+ countries and over 1 million facts: More about Statista About Statista Why trust Statista First steps and help center Webinar & Training Hub Statista Connect Services Statista+ offers additional, data-driven services, tailored to your specific needs. As your partner for data-driven success, we combine expertise in research, strategy, and marketing communications. Research Full-service market research and analytics Customized market research Data analytics Ad hoc research \"askStatista\" Research Solutions Strategy Strategy and business building for the data-driven economy Build strategies Create data value Realize business opportunities Strategy Consulting Communication Transforming data into content marketing and design: Data storytelling Creative assets Distribution Communication Services Statista R identifies and awards industry leaders, top providers, and exceptional brands through exclusive rankings and top lists in collaboration with renowned media brands worldwide. For more details, visit our website. Solutions Why Statista See why Statista is the trusted choice for reliable data and insights. We provide one platform to simplify research and support your strategic decisions. Learn more By Industry Academia Agencies Consultancies Consumer Goods Finance Tech By Function Marketing Research & Development Strategy By Use case Find the fact Tell the story Win the pitch Understand the market Develop your strategy Resource Hub Expert resources to inform and inspire. Success stories Live webinars & recordings Prices & Access Business Solutions Academia and Government statista.com statista.de statista.es statista.fr Login Market Insights Mobility Electric Vehicles - Worldwide Worldwide Highlights In 2025, the revenue in the Electric Vehicles market is projected to reach a staggering US$784.2bn worldwide. Looking ahead, it is expected that the market will demonstrate a steady annual growth rate (CAGR 2025-2029) of 6.01%. This growth will ultimately lead to a projected market volume of US$990.4bn by 2029. Moreover, the unit sales of Electric Vehicles market are anticipated to reach 17.36m vehicles units by 2029. When examining the market in 2025, it is predicted that the volume weighted average price of Electric Vehicles market will amount to US$57.4k. From an international perspective, it is evident that China will generate the highest revenue, with an estimated US$377bn in 2025. This showcases the significant presence of Electric Vehicles market in the Chinese market segment. Electric vehicle adoption is rapidly increasing worl', 'images': [], 'rank': 2}, {'url': 'https://www.reuters.com/business/autos-transportation/global-electric-vehicle-sales-up-25-record-2024-2025-01-14/', 'content': '[error] Timeout while extracting content', 'rank': 3}, {'url': 'https://about.bnef.com/insights/clean-transport/global-electric-vehicle-sales-set-for-record-breaking-year-even-as-us-market-slows-sharply-bloombergnef-finds/', 'content': \"Global Electric Vehicle Sales Set for Record-Breaking Year, Even as US Market Slows Sharply, BloombergNEF Finds | BloombergNEF Skip to content Bloomberg the Company & Its Products The Company & its Products Bloomberg Terminal Demo Request Bloomberg Anywhere Remote Login Bloomberg Anywhere Login Bloomberg Customer Support Customer Support Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world For Customers Bloomberg Anywhere Remote Login Software Updates Manage Products and Account Information Support Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 Company About Careers Inclusion at Bloomberg Tech at Bloomberg Philanthropy Sustainability Bloomberg Beta Communications Press Announcements Press Contacts Follow Facebook Instagram LinkedIn YouTube Products Bloomberg Terminal Data Trading Risk Compliance Indices Industry Products Bloomberg Law Bloomberg Tax Bloomberg Government BloombergNEF Media Bloomberg Markets Bloomberg Technology Bloomberg Pursuits Bloomberg Politics Bloomberg Opinion Bloomberg Businessweek Bloomberg Live Conferences Bloomberg Radio Bloomberg Television News Bureaus Media Services Bloomberg Media Distribution Advertising Company About Careers Inclusion at Bloomberg Tech at Bloomberg Philanthropy Sustainability Bloomberg Beta Communications Press Announcements Press Contacts Follow Facebook Instagram LinkedIn YouTube Products Bloomberg Terminal Data Trading Risk Compliance Indices Industry Products Bloomberg Law Bloomberg Tax Bloomberg Government BloombergNEF Media Bloomberg Markets Bloomberg Technology Bloomberg Pursuits Bloomberg Politics Bloomberg Opinion Bloomberg Businessweek Bloomberg Live Conferences Bloomberg Radio Bloomberg Television News Bureaus Media Services Bloomberg Media Distribution Advertising Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world For Customers Bloomberg Anywhere Remote Login Software Updates Manage Contracts and Orders Support Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 BloombergNEF What we do Who we help Commodities Traders Review projections and risks within the commodities market. Financial Institutions Identify rising technologies and find your next big investment. Corporations Make strategic decisions to position your business for success. Governments Analyze how policy change and capital flows impact the energy transition. Electric Vehicle Outlook An annual long-term report on how electrification, shared mobility, autonomous driving and other factors will impact road transport. Download report Insights BNEF RESEARCH All Insights TOPICS Clean Energy Clean Transport Commodities Finance Industry and Buildings Nature and Agriculture Featured reports New Energy Outlook Electric Vehicle Outlook Energy Transition Investment Trends Transition Metals Outlook Global Gas and LNG Outlooks Public Resources Climatescope NetZero Pathfinders Carbon Knowledge Hub Climate Week and COP Public Research View all insights Events BNEF EVENTS All Events Register for upcoming events and replay past recordings. Sponsorship Showcase your company's role in the energy transition while expanding your network at events around the world. Event locations Americas Asia Pacific Europe, Middle East and Africa BNEF Summits Bringing together leaders in energy, industry, transport, technology, finance and government since 2008. Find upcoming About WHO WE ARE About BloombergNEF Find out more about BNEF and our mission to bring clarity to the energy transition. CONNECT Contact us Get global customer support or learn how we can help your firm. Press Search our latest press releases and contact the BNEF Media team. Careers Explore exciting job opportunities at BNEF\", 'images': [{'url': 'https://assets.bbhub.io/image/v1/resize?type=auto&url=https%3A%2F%2Fassets.bbhub.io%2Fprofessional%2Fsites%2F44%2Fwind-and-solar.jpg&width=1024', 'alt_text': 'wind and solar plant', 'width': '1024', 'height': '766', 'class': 'attachment-large size-large wp-post-image', 'confidence': 0.8999999999999999}, {'url': 'https://assets.bbhub.io/image/v1/resize?type=auto&url=https%3A%2F%2Fassets.bbhub.io%2Fprofessional%2Fsites%2F44%2FAgirculture1.jpg&width=1024', 'alt_text': 'Agriculture - field', 'width': '1024', 'height': '666', 'class': 'attachment-large size-large wp-post-image', 'confidence': 0.8999999999999999}, {'url': 'https://assets.bbhub.io/image/v1/resize?type=auto&url=https%3A%2F%2Fassets.bbhub.io%2Fprofessional%2Fsites%2F44%2Fsolar-aerial.jpg&width=1024', 'alt_text': 'Solar plant aerial view', 'width': '1024', 'height': '647', 'class': 'attachment-large size-large wp-post-image', 'confidence': 0.8999999999999999}, {'url': 'https://assets.bbhub.io/image/v1/resize?type=auto&url=https%3A%2F%2Fassets.bbhub.io%2Fprofessional%2Fsites%2F44%2Findia-solar6.jpg&width=1024', 'alt_text': 'Solar panels inspection', 'width': '1024', 'height': '675', 'class': 'attachment-large size-large wp-post-image', 'confidence': 0.8999999999999999}, {'url': 'https://assets.bbhub.io/image/v1/resize?type=auto&url=https%3A%2F%2Fassets.bbhub.io%2Fprofessional%2Fsites%2F44%2Fshutterstock_2227403165resiz.jpg&width=1024', 'alt_text': 'Mangrove forest', 'width': '1024', 'height': '766', 'class': 'attachment-large size-large wp-post-image', 'confidence': 0.8999999999999999}], 'rank': 4}, {'url': 'https://evboosters.com/ev-charging-news/overall-results-global-ev-sales-2024/', 'content': \"Overall results Global EV Sales 2024 | EVBoosters Skip to content Partners Approach Candidates EV News About us Charging Academy Partners Approach Candidates EV News About us Charging Academy Home EV Charging News Overall results Global EV Sales 2024 Overall results Global EV Sales 2024 The global electric vehicle (EV) market surged to new heights in 2024, marking a 25% year-over-year growth and culminating in 17.1 million EVs sold worldwide. December alone saw record-breaking sales of 1.9 million units, a 26% increase compared to the same month in 2023. Despite a stabilisation of the growth in Europe, the Chinese market grew by an astonishing +40%, representing 11 million cars with a plug.Subsidies, tax credits, and stringent emission standards were pivotal in driving EV adoption in 2024. China's trade-in scheme, Europe's emission pooling strategies, and North America's tax credits highlight how regulatory frameworks influence consumer and manufacturer behaviour. January 15, 2025 Editorial Board EVBoosters China: The Dominant Force China retained its position as the largest EV market, accounting for a significant portion of global sales. The country achieved a record-breaking 1.3 million EV sales in December 2024, contributing to an annual total of 11 million unitsan impressive 40% year-over-year increase. Much of this growth can be attributed to the dominance of domestic automaker BYD, responsible for one in three EVs sold. Chinas robust trade-in scheme and continued incentives further bolstered market expansion. Europe: stabilization amid policy shifts Europes EV market faced mixed outcomes, finishing the year 5,9% lower compared to 2023. However, the United Kingdom emerged as the new leader in battery electric vehicle (BEV) sales, overtaking Germany, primarily due to implementing the UK ZEV (Zero Emission Vehicle) mandate. European automakers are preparing for stringent 2025 emissions standards, with collaborative carbon credit pools already announced to avoid regulatory fines. Despite challenges like subsidy cuts in Germany, stabilisation in December with 310,000 units solda slight 0.7% year-over-year increaseindicates resilience. United States and Canada: steady progress The North American EV market grew by 9% in 2024, recording 190,000 units sold in December. The $7,500 federal EV tax credit played a crucial role in sustaining sales momentum, though its future remains uncertain under potential policy shifts in the upcoming Trump administration. Alongside the Environmental Protection Agencys emission standards, these factors will likely shape the North American markets trajectory in the coming years. Rest of the World: Emerging Opportunities Outside of these key markets, EV sales rose by 26.4% in December 2024. Regions across Asia-Pacific, Latin America, and Africa are beginning to show increased adoption as governments introduce localized incentives and infrastructure improvements to support EV uptake. Challenges and Regional Market Trends EV Sales 2024 Despite these achievements, challenges persist. The removal of subsidies in markets like Germany had a noticeable impact on sales, signalling potential risks if similar policies are enacted in other regions. The high cost of raw materials, particularly lithium, and geopolitical uncertainties surrounding trade policies may also influence market dynamics. Future Outlook EV Sales 2025 Looking ahead, 2025 is poised to be another transformative year for the EV / Automotive industry. Europes new emissions regulations and the continuation of Chinas trade-in scheme will be critical drivers. However, potential changes in U.S. EV policy under the Trump administration could introduce uncertainty in North America. As automakers invest heavily in research and development, expect to see continued advancements in battery efficiency and vehicle automation. Increased collaboration between governments and private sectors will likely accelerate the development of charging networks, further\", 'images': [{'url': 'https://evboosters.com/wp-content/uploads/2024/06/EVB-CHARGING-black-1.png', 'alt_text': 'evb charging black 1', 'width': '2550', 'height': '461', 'class': 'attachment-full size-full wp-image-27018', 'confidence': 0.8999999999999999}, {'url': 'https://evboosters.com/wp-content/uploads/2025/01/Overall-results-global-EV-Sales-2024-min-1-1.jpg', 'alt_text': 'overall results global ev sales 2024 min', 'width': '2494', 'height': '1468', 'class': 'attachment-full size-full wp-image-39153', 'confidence': 0.8999999999999999}, {'url': 'https://evboosters.com/wp-content/uploads/2025/07/Top-High-Power-Charging-Charge-Point-Operators-France-June-2025-min-1-300x202.png', 'alt_text': 'top high power charging charge point operators france june 2025 min (1)', 'width': '300', 'height': '202', 'class': 'attachment-medium size-medium wp-image-42872', 'confidence': 0.8999999999999999}, {'url': 'https://evboosters.com/wp-content/uploads/2025/07/Why-top-talent-is-leaving-your-EV-Charging-company-300x172.jpg', 'alt_text': 'why top talent is leaving your ev charging company', 'width': '300', 'height': '172', 'class': 'attachment-medium size-medium wp-image-42771', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://evboosters.com/wp-content/uploads/2025/07/EV-Sales-H1-2025-Volkswagen-Group-min-1-300x213.jpg', 'alt_text': 'ev sales h1 2025 volkswagen group min (1)', 'width': '300', 'height': '213', 'class': 'attachment-medium size-medium wp-image-42602', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 5}, {'url': 'https://www.iea.org/reports/global-ev-outlook-2024/trends-in-electric-cars', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.statista.com/topics/1010/electric-mobility/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://evcurvefuturist.com/2025/02/global-ev-sales-2024-final-figures-and-key-insights/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-25T11:02:05.807707",
      "end_time": "2025-07-25T11:03:07.445058",
      "execution_time": 61.637351,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T002",
      "description": "Gather data on key electric vehicle market trends, including consumer preferences and government incentives.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Identify and gather information on key trends shaping the electric vehicle market, such as changing consumer preferences, technological advancements, government incentives and regulations, and charging infrastructure development. Collect data from consumer surveys, industry reports, and policy documents.",
      "reads": [],
      "writes": [
        "T002"
      ],
      "status": "running",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-25T11:03:12.468401",
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T003",
      "description": "Gather data on major players in the electric vehicle market, including their market share and strategies.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Research and gather information on the major companies in the electric vehicle market, including Tesla, BYD, Volkswagen, and other significant players. Collect data on their market share, sales performance, product portfolios, and strategic initiatives. Use company reports, news articles, and market analysis reports.",
      "reads": [],
      "writes": [
        "T003"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T004",
      "description": "Gather data on technological advancements in electric vehicles, including battery technology and charging infrastructure.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Collect data on the latest technological advancements in electric vehicles, with a focus on battery technology (e.g., solid-state batteries, improved energy density) and charging infrastructure (e.g., fast charging, wireless charging). Use research papers, technology news articles, and industry reports.",
      "reads": [],
      "writes": [
        "T004"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T005",
      "description": "Analyze the collected data to identify key trends in the electric vehicle market.",
      "agent": "ThinkerAgent",
      "agent_prompt": "Analyze the data gathered from T001, T002, T003, and T004 to identify key trends in the electric vehicle market. These trends may include changes in consumer behavior, emerging technologies, shifts in market share, and the impact of government policies. Focus on extracting actionable insights and summarizing the implications of each trend.",
      "reads": [
        "T001",
        "T002",
        "T003",
        "T004"
      ],
      "writes": [
        "T005"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T006",
      "description": "Develop visualizations to illustrate the key trends in the electric vehicle market.",
      "agent": "CoderAgent",
      "agent_prompt": "Based on the analysis in T005, generate the following visualizations using Python and libraries like Matplotlib, Seaborn, or Plotly. Ensure that the visualizations are clear, concise, and visually appealing. Create placeholder for future updates.\n\n1.  Line chart showing the growth of the EV market size over the past 5 years and projected growth for the next 5 years. Label axes clearly.\n2.  Bar chart comparing the market share of major EV players.\n3.  Pie chart illustrating the distribution of EV sales by region (e.g., North America, Europe, Asia Pacific).\n4.  Scatter plot showing the relationship between battery capacity and driving range for different EV models.\n\nOutput both code and output in JSON format.",
      "reads": [
        "T005"
      ],
      "writes": [
        "T006"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T007",
      "description": "Create a comprehensive analysis report summarizing the key findings and trends in the electric vehicle market, incorporating the visualizations.",
      "agent": "FormatterAgent",
      "agent_prompt": "Based on the analysis from T005 and the visualizations from T006, create a detailed analysis report summarizing the key findings and trends in the electric vehicle market. The report should include an introduction, a section on market size and growth, a section on key market trends, a section on major players, a section on technological advancements, and a conclusion. Incorporate the visualizations generated in T006 to illustrate the key points. Use clear and concise language and format the report for readability and visual appeal. The report should be structured into sections with appropriate headings and subheadings. Format final report in markdown. Be exhaustive and comprehensive.",
      "reads": [
        "T005",
        "T006"
      ],
      "writes": [
        "T007"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "ROOT",
      "target": "T002"
    },
    {
      "source": "ROOT",
      "target": "T003"
    },
    {
      "source": "ROOT",
      "target": "T004"
    },
    {
      "source": "T001",
      "target": "T005"
    },
    {
      "source": "T002",
      "target": "T005"
    },
    {
      "source": "T003",
      "target": "T005"
    },
    {
      "source": "T004",
      "target": "T005"
    },
    {
      "source": "T005",
      "target": "T006"
    },
    {
      "source": "T006",
      "target": "T007"
    }
  ]
}