{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "53442431",
    "original_query": "Conduct comprehensive market research on electric vehicle trends and create a detailed analysis report with visualizations",
    "file_manifest": [],
    "created_at": "2025-07-25T11:20:31.459923",
    "status": "running",
    "output_chain": {
      "T001": {
        "ev_market_data": [
          {
            "type": "text",
            "text": "[{'url': 'https://ourworldindata.org/electric-car-sales', 'content': 'Tracking global data on electric vehicles - Our World in Data Our World in Data Browse by topic Data Insights Resources About Subscribe Donate Gdoc / Admin Home Energy Tracking global data on electric vehicles Explore data on electric car sales and stocks worldwide. By: Hannah Ritchie First published in February 2024. Last updated in May 2025. Cite this article Reuse our work freely Electric vehicles are an essential solution to decarbonizing transport. Electric cars tend to have a lower carbon footprint than petrol or diesel cars over their lifetimes. While more carbon is emitted in the manufacturing stage, this carbon debt tends to pay off quickly once theyre on the road. 1 The carbon savings are higher in countries with a cleaner electricity mix , and these savings will also increase as countries continue to decarbonize their electricity grids. How quickly are countries moving to electrified transport? Which countries are leading the way? In this article, we look at data from across the world on electric vehicle (EV) sales and the stock on the road. This data comes from the International Energy Agency . It publishes its Global EV Outlook every year. We will update this data every time a new release is published. 2 Sales of new cars What share of new cars are electric? Sales of electric cars started from a low base but are growing quickly in many markets. Globally, over 1-in-5 (22%) of new cars sold were electric in 2024. This share was 92% in Norway, and in China, it was almost 50%. In the chart below, you can explore these trends across the world. Here, electric cars include fully battery-electric vehicles and plug-in hybrids . Fully-electric cars vs. plug-in hybrids Electric cars include battery-electric and plug-in hybrid vehicles. The difference is that fully battery-electric cars do not have an internal combustion engine. In contrast, plug-in hybrids have a rechargeable battery and electric motor, and an internal combustion engine that runs on gasoline. That means a plug-in hybrid could be driven as a standard petrol car if the owner did not charge the battery. The battery in plug-in hybrids is smaller and has a shorter range than battery-electric cars, so over longer distances, the car starts running on gasoline once the battery has run out. Since plug-in hybrids will often run on petrol, they tend to emit more carbon than battery-electric cars. However, they do usually have lower emissions than petrol or diesel cars. 3 In the first chart below you can see electric car sales broken down by these two technologies. This is given as a share of new cars sold each year. In the second, you will find the share of new electric cars sold that are fully battery-electric . How many new electric cars are sold each year? The chart below shows the total number of new electric cars sold. Again, this includes fully battery-electric and plug-in hybrids . Clicking on any country will show how sales have changed over time. How many new internal combustion engine cars and electric cars are sold each year? Based on the data published by the IEA on the number of electric cars sold, and EV sales as a share of all new cars, we can calculate the absolute number of new cars of each type sold each year. These figures suggest that global sales of non-electric cars peaked in 2018. This aligns with other estimates published elsewhere; for example, Bloomberg New Energy Finance reported that sales peaked in 2017. You can explore this data for other countries in the chart below, too. Stocks of cars in use What share of cars on the road are electric? The cars that are on the road today represent sales data over more than a decade. This can be captured in a metric called stocks. Its an approximation of the number of cars that are in use and represents the balance of cars being added and those that are being retired. Because people use their cars for a long time, it takes time before new sales have a visible influence on car stocks. That means the share', 'images': [], 'rank': 1}, {'url': 'https://www.iea.org/reports/global-ev-outlook-2024/trends-in-electric-cars', 'content': \"Trends in electric cars Global EV Outlook 2024 Analysis - IEA IEA Close Search Search About News Events Programmes Help centre IEA Skip navigation Search Energy system Chevron down Explore the energy system by fuel, technology or sector Fossil Fuels Renewables Electricity Low-Emissions Fuels Transport Industry Buildings Energy Efficiency and Demand Carbon Capture Utilisation and Storage Decarbonisation Enablers Buildings Energy Efficiency and Demand Carbon Capture Utilisation and Storage Decarbonisation Enablers Explore all Topics Chevron down Understand the biggest energy challenges Energy Security Artificial Intelligence Critical Minerals Access and Affordability Energy Innovation Investment Climate Change COP28: Tracking the Energy Outcomes Net Zero Emissions Russia's War on Ukraine Climate Change COP28: Tracking the Energy Outcomes Net Zero Emissions Russia's War on Ukraine Energy and Gender Energy and Water Fossil Fuel Subsidies Saving Energy Global Energy Crisis The IEA's 50th Anniversary All topics Countries Chevron down Explore the energy system by country or region Member countries Australia Austria Belgium Canada Czechia Denmark Estonia Finland France Germany Greece Hungary Ireland Italy Japan Korea Latvia Lithuania Luxembourg Mexico New Zealand Norway Poland Portugal Slovak Republic Spain Sweden Switzerland The Netherlands Trkiye United Kingdom United States Accession countries Chile Colombia Costa Rica Israel Association countries Argentina Brazil China Egypt India Indonesia Kenya Morocco Senegal Singapore South Africa Thailand Ukraine All Countries and Regions Data Chevron down Use, download and buy global energy data Data explorers Understand and manipulate data with easy to use explorers and trackers Data explorers Data sets Free and paid data sets from across the energy system available for download Data sets Policies database Past, existing or planned government policies and measures Policies database Chart Library Access every chart published across all IEA reports and analysis Chart Explore data Reports Chevron down Read the latest analysis from the IEA Oil Market Report - July 2025 Fuel report  July 2025 Energy and AI Flagship report  April 2025 Energy Technology Perspectives 2024 Flagship report  October 2024 World Energy Outlook 2024 Flagship report  October 2024 All reports Search Bag 1 User Profile Search Sign In Flyout close You are connecting via IP recognition from . If you wish to proceed, click on Connect . If you prefer to log into your personal account, please sign in below. Connect Connect OR Email          * Error Password          * Forgot password? Eye Error Sign in Sign in Create an account Create a free IEA account to download our reports or subcribe to a paid service. Join for free Join for free Important message for WDS users The IEA has discontinued providing data in the Beyond 2020 format (IVT files and through WDS). Data is now available through the .Stat Data Explorer, which also allows users to export data in Excel and CSV formats. Read documentation cross logo Open Navigation Contents Cite Share Download full report arrow-down arrow-down-24 Trends in electric cars Close Side navigation Executive summary Trends in electric cars Electric car sales Electric car availability and affordability Trends in other light-duty electric vehicles Electric two- and three-wheelers Electric light commercial vehicles Trends in heavy electric vehicles Electric truck and bus sales Electric heavy-duty vehicle model availability Trends in electric vehicle charging Charging for electric light-duty vehicles Charging for electric heavy-duty vehicles Trends in electric vehicle batteries Battery supply and demand Battery prices Trends in the electric vehicle industry Electric vehicle company strategy and market competition Electric vehicle and battery start-ups Outlook for electric mobility Vehicle outlook by mode Vehicle outlook by region The industry outlook Outlook for electri\", 'images': [{'url': 'https://iea.imgix.net/727f5e9d-39d4-4b20-9e8f-fa9c19474abd/shutterstock_2135903469.jpg?auto=compress%2Cformat&fit=min&q=80&rect=0%2C0%2C4400%2C2475&w=600&h=338&fit=crop&fm=jpg&q=70&auto=format', 'alt_text': 'Oil and natural gas supply', 'confidence': 0.7}, {'url': 'https://iea.imgix.net/298dbf91-1765-4367-96bc-dc65b182f3be/RenewablesMarketUpdate2023_FLIPPED_shutterstock_366229667.jpg?auto=compress%2Cformat&fit=min&q=80&rect=0%2C467%2C4500%2C2533&w=600&h=338&fit=crop&fm=jpg&q=70&auto=format', 'alt_text': 'Photo depicts a solar panels and windmills in the power plant', 'confidence': 0.7}, {'url': 'https://iea.imgix.net/c2a6cd9b-85a4-446f-92b2-ff103b55c442/shutterstock_1715825734.jpg?auto=compress%2Cformat&fit=min&q=80&rect=%2C%2C%2C&w=600&h=338&fit=crop&fm=jpg&q=70&auto=format', 'alt_text': 'photo from the perspective of looking up to the top of electricity tower pylons with a colorful blue and yellow background in the sky', 'confidence': 0.7}, {'url': 'https://iea.imgix.net/027dc74f-71b5-4941-b375-b23ed5ead025/shutterstock_2023277612.jpg?auto=compress%2Cformat&fit=min&q=80&rect=251%2C0%2C5476%2C3084&w=600&h=338&fit=crop&fm=jpg&q=70&auto=format', 'alt_text': 'Low-emission fuels', 'confidence': 0.7}, {'url': 'https://iea.imgix.net/2c2efb95-62d6-438f-afda-cfd3b05a02c6/guillaume-techer-XvNPUh6fWVk-unsplash.jpg?auto=compress%2Cformat&fit=min&q=80&rect=0%2C530%2C3963%2C2233&w=600&h=338&fit=crop&fm=jpg&q=70&auto=format', 'alt_text': 'Tracking industry', 'confidence': 0.7}], 'rank': 2}, {'url': 'https://www.grandviewresearch.com/industry-analysis/electric-vehicles-ev-market', 'content': 'Electric Vehicle Market Size & Share | Industry Report, 2030 Grand View Research Logo Toggle navigation Reports Consumer Goods Beauty & Personal Care Clothing, Footwear & Accessories Consumer F&B Electronic & Electrical Homecare & Decor Semiconductors & Electronics Display Technologies Electronic Security Systems Electronic Devices Semiconductors Sensors & Controls Specialty & Fine Chemicals Catalysts and Enzymes Food Additives and Nutricosmetics Renewable Chemicals Specialty and Bio-based Polymers Food & Beverages Animal Feed & Feed Additives Food Safety & Processing Nutraceuticals & Functional Foods Processed & Frozen Foods Advanced Materials Advanced Interior Materials Green Building Materials Micro Molding and Microspheres Nanoparticles Smart Textiles Glass, Ceramics and Fibers Healthcare Biotechnology Clinical Diagnostics Healthcare IT Medical Devices Medical Imaging Pharmaceuticals Animal Health Technology Automotive and Transportation Communications Infrastructure Communication Services Digital Media HVAC & Construction Network Security Next Generation Technologies Bulk Chemicals Agrochemicals & Fertilizers Disinfectants & Preservatives Drilling & Extraction Equipments Organic Chemicals Paints, Coatings & Printing Inks Personal Care & Cosmetics Petrochemicals Plastics, Polymers & Resins Water & Sludge Treatment Services Brainshare Market Research Reports Full Time Engagement Custom Research Services Market Monitoring Subscription Compass Pipeline - Procurement Intelligence Astra ESG solutions Market Trend Reports Horizon About Us Who We Are Why Choose Us Research Methodology Client Testimonials Conferences Media Citations Contact Career Insights Research Insights Ongoing Reports Case Studies Press Room Blogs Login Home Automotive & Transportation Electric Vehicle Market Size & Share, Industry Report, 2030 GVR Report cover Electric Vehicle Market Size, Share & Trends Analysis Report By Vehicle Type, By Propulsion Type, By Drive Type, By Vehicle Speed, By Vehicle Class, By End-use, By Region, And Segment Forecasts, 2025 - 2030 Report ID: 978-1-68038-259-4 Number of Report Pages: 100 Format: PDF Historical Range: 2018 - 2023 Forecast Period: 2025 - 2030 Industry: Technology Report Summary Table of Contents Segmentation Methodology Request a FREE Sample Copy Electric Vehicle Market Summary The global electric vehicle market size was estimated at USD 1,328.08 billion in 2024 and is projected to reach USD 6,523.97 billion by 2030, growing at a CAGR of 32.5% from 2025 to 2030. Government policies and incentives worldwide are accelerating the adoption of Electric Vehicles (EVs). Key Market Trends & Insights The North America electric vehicle market is expected to grow at a moderate CAGR during the forecast period. The U.S. electric vehicle market is expected to grow at the fastest CAGR during the forecast period By propulsion, the battery electric vehicle segment dominated the market in 2024. By drive type, the front-wheel drive segment dominated the market in 2024. By vehicle speed, the 100MPH-125MPH segment dominated the market in 2024. Market Size & Forecast 2024 Market Size: USD 1,328.08 Billion 2030 Projected Market Size: USD 6,523.97 Billion CAGR (2025-2030): 32.5% Asia Pacific: Largest market in 2024 Many countries are implementing stringent emission regulations and providing subsidies, tax benefits, and other incentives to both consumers and manufacturers, encouraging the shift from internal combustion engine vehicles to electric alternatives. Besides, advancements in battery technology are significantly enhancing the range, performance, and affordability of EVs. Innovations such as solid-state batteries and improvements in lithium-ion batteries are reducing costs and increasing energy density, making EVs more appealing to consumers. The expansion of the transportation and logistics sectors significantly drives the rising demand for EVs. As global trade and e-commerce continue to surge, there is an increased', 'images': [{'url': 'https://www.grandviewresearch.com/static/img/research/electric-vehicle-market.webp', 'alt_text': 'Electric vehicle market size by region, and growth forecast (2025-2030)', 'title': 'Electric vehicle market size by region, and growth forecast (2025-2030)', 'width': '750', 'height': '422', 'confidence': 0.8999999999999999}, {'url': 'https://www.grandviewresearch.com/static/img/research/electric-vehicle-market-share.png', 'alt_text': 'Electric Vehicle Market Share, by End Use, 2024 (%)', 'title': 'Electric Vehicle Market Share, by End Use, 2024 (%)', 'confidence': 0.7}, {'url': 'https://www.grandviewresearch.com/static/img/research/electric-vehicle-market-trends-by-region.png', 'alt_text': 'Electric Vehicle Market Trends, by Region, 2025 - 2030', 'title': 'Electric Vehicle Market Trends, by Region, 2025 - 2030', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://caredge.com/guides/electric-vehicle-market-share-and-sales', 'content': 'Electric Vehicle Sales and Market Share (US - Q2 2025 Updates) - CarEdge New or Used New Used Inventory (Required) New Used Certified Make (Required) Make Acura Alfa Romeo Aston Martin Audi Bentley BMW Buick Cadillac Chevrolet Chrysler Dodge Ferrari FIAT Fisker Ford Genesis GMC Honda HUMMER Hyundai INFINITI Isuzu Jaguar Jeep Karma KIA Lamborghini Land Rover Lexus Lincoln Lotus Lucid Maserati Maybach Mazda McLaren Mercedes-Benz Mercury MINI Mitsubishi Nissan Oldsmobile Plymouth Polestar Pontiac Porsche RAM Rivian Rolls-Royce Saab Saturn Scion Smart Sterling Subaru Suzuki Tesla Toyota Volkswagen Volvo Model (Required) Model A5 CL CSX EL ILX Integra Legend MDX NSX RDX RL RLX RSX TL TLX TSX Vigor ZDX 164 4C 8C Competizione GT Giulia Spider Stelvio Veloce Convertible DB11 DB7 DB9 DBS DBS Superleggera DBX Rapide V12 Vantage V8 V8 Vantage V8 Vantage Roadster V8 Vantage Roadster SPORTSHIFT V8 Vantage SPORTSHIFT Vanquish Vantage Virage 100 2 A3 A3 Cabriolet A3 Sedan A3 Sportback e-tron A4 A4 allroad A5 A5 Cabriolet A5 Coupe A5 Sportback A6 A6 Allroad A7 A8 Allroad Quattro Allroad quattro Cabriolet Convertible Coupe GT Q3 Q4 Sportback e-tron Q4 e-tron Q5 Q5 Sportback Q7 Q8 Q8 e-tron Q8 e-tron Sportback R8 RS 3 RS 5 RS 5 Cabriolet RS 5 Coupe RS 5 Sportback RS 6 Avant RS 7 RS Q8 RS e-tron GT RS3 RS4 RS5 RS5 Sportback RS6 RS6 Avant RS7 S3 S4 S5 S5 Cabriolet S5 Coupe S5 Sportback S6 S7 S8 SQ5 SQ5 Sportback SQ7 SQ8 Sport TT TT Coupe TT RS TT Roadster TTS TTS Coupe allroad e-tron e-tron GT e-tron S e-tron S Sportback e-tron Sportback Arnage Azure Bentayga Brooklands Continental Continental Flying Spur Continental GT Continental GTC Continental Supersports Eight Flying Spur Mulsanne Turbo 1 Series 2 Series 3 Series 300 320 323 325 328 335 4 Series 5 Series 6 Series 6 Series Convertible 6 Series Coupe 6 Series Gran Coupe 6 Series Gran Turismo 7 Series 740 8 Series 850 900 ALPINA B6 Gran Coupe CC Convertible Coupe F-650 F-800 F700 G GS GT I3 I8 L7 M M Series M2 Coupe M3 M3 Sedan M4 Convertible M4 Coupe M440i M5 M5 Sedan M6 M6 Convertible M6 Coupe M6 Gran Coupe M8 Convertible M8 Coupe M8 Gran Coupe R18 Roadster X1 X2 X3 X3 M X4 X4 M X5 X5 M X6 X6 M X7 XM Z3 Z4 Z8 i3 i4 i7 i8 iX Allure Cascada Century Convertible Electra Enclave Encore Encore GX Envision Envista LaCrosse LeSabre Lucerne Park Avenue Rainier Reatta Regal Regal Sportback Regal TourX Rendezvous Riviera Roadmaster Skylark Terraza Verano ATS ATS Coupe ATS Sedan ATS-V Coupe ATS-V Sedan Allante Brougham CT4 CT4-V CT5 CT5-V CT6 CTS CTS Coupe CTS Sedan CTS Sport Sedan CTS Sport Wagon CTS-V Coupe CTS-V Sedan CTS-V Sport Sedan CTS-V Sport Wagon Catera Cimarron DTS DeVille ELR Eldorado Escalade Escalade ESV Escalade EXT Fleetwood LYRIQ Professional Chassis SRX STS Seville W42 XLR XT4 XT5 XT6 XTS 3500 4500 Astro Astro Cargo Astro Passenger Avalanche Aveo Aveo5 B7T042 Beretta Blazer Bolt EUV Bolt EV C series C10 C1500 C20 C2500 C30 C3500 C4500 C5500 C6000 C65 C6500 C7500 C8500 Camaro Caprice Caprice/Impala Captiva Sport Cavalier Celebrity Chevette Chevy Van Citation City Express Classic Classic Silverado Cobalt Colorado Convertible Corsica Corvette Cruze Cruze Limited D10 D30 El Camino Equinox Explorer Express Express Cargo Express Cutaway Express G1500 Express G2500 Express G3500 Express G4500 Express Passenger G-P G10 G20 G30 GMT400 Geo Prizm HHR Impala Impala Limited K10 K1500 K20 K2500 K30 K3500 Kodiak Low Cab Forward Lumina Malibu Malibu Classic Malibu Limited Malibu Maxx Metro Monte Carlo Nova Orlando P30 PS6500 Prizm R10 R20 R30 R3500 S-10 SS SSR Silverado Silverado 1500 Silverado 1500 LD Silverado 1500 Limited Silverado 1500HD Silverado 2500 Silverado 2500HD Silverado 3500 Silverado 3500 Chassis Cab Silverado 3500HD Silverado 4500 Silverado 4500 Medium Duty Chassis Cab Silverado 4500HD Silverado 5500HD Silverado 5500XD Silverado Classic 1500 Silverado Classic 1500HD Silverado Classic 2500HD Silverado Classic 3500 Silverado Classic 3500 Chassis Cab Silverado LD 1500 Silverado MD Sonic Spa', 'images': [{'url': 'https://caredge.com/wp-content/uploads/2024/10/2024-Chevrolet-Equinox-EV-1LT-103-edited-1024x576.jpg', 'alt_text': 'EV market share 2025 update', 'width': '1024', 'height': '576', 'class': 'wp-image-234564', 'confidence': 0.8999999999999999}, {'url': 'https://caredge.com/wp-content/uploads/2024/04/EV-market-share-Q4-2023-1024x536.png', 'alt_text': 'Electric vehicle market share over time 2010 - 2024', 'width': '1024', 'height': '536', 'class': 'wp-image-226797', 'confidence': 0.8999999999999999}, {'url': 'https://caredge.com/wp-content/uploads/2025/04/2025-Toyota-Grand-Highlander-400x250.jpg', 'alt_text': 'The Fastest and Slowest Selling SUVs in 2025', 'width': '400', 'height': '250', 'confidence': 0.8999999999999999}, {'url': 'https://caredge.com/wp-content/uploads/2023/04/trouble-selling-trucks-400x250.png', 'alt_text': 'The Fastest and Slowest Selling Trucks in 2025', 'width': '400', 'height': '250', 'confidence': 0.8999999999999999}, {'url': 'https://caredge.com/wp-content/uploads/2025/07/Questions-to-ask-when-buying-a-used-car-400x250.jpg', 'alt_text': 'Questions to Ask When Buying a Used Car', 'width': '400', 'height': '250', 'confidence': 0.8999999999999999}], 'rank': 4}, {'url': 'https://www.statista.com/outlook/mmo/electric-vehicles/worldwide', 'content': 'Electric Vehicles - Worldwide | Statista Market Forecast Skip to main content Open Statistics All Industries Consumer Goods & FMCG E-Commerce Economy & Politics Energy & Environment Internet Technology & Telecommunications Transportation & Logistics Travel, Tourism & Hospitality Reports Report Shop Search our report database Digital & Trend reports Overview and forecasts on trending topics Industry & Market reports Industry and market insights and forecasts Companies & Products reports Key figures and rankings about companies and products Consumer & Brand reports Consumer and brand insights and preferences in various industries Politics & Society reports Detailed information about political and social topics Country & Region reports All key figures about countries and regions Find your information in our database containing over 20,000 reports Insights Market Insights Market forecast and expert KPIs for 1000+ markets in 190+ countries & territories Explore Market Insights Consumer eCommerce Mobility Consumer Insights Insights on consumer attitudes and behavior worldwide 3,000,000+ interviews 15,000+ brands Explore Consumer Insights eCommerce Insights Detailed information for 39,000+ online stores and marketplaces 70+ KPIs per store Revenue analytics and forecasts Explore eCommerce Insights Research AI NEW Daily Data Services The statistics portal Directly accessible data for 170 industries from 150+ countries and over 1 million facts: More about Statista About Statista Why trust Statista First steps and help center Webinar & Training Hub Statista Connect Services Statista+ offers additional, data-driven services, tailored to your specific needs. As your partner for data-driven success, we combine expertise in research, strategy, and marketing communications. Research Full-service market research and analytics Customized market research Data analytics Ad hoc research \"askStatista\" Research Solutions Strategy Strategy and business building for the data-driven economy Build strategies Create data value Realize business opportunities Strategy Consulting Communication Transforming data into content marketing and design: Data storytelling Creative assets Distribution Communication Services Statista R identifies and awards industry leaders, top providers, and exceptional brands through exclusive rankings and top lists in collaboration with renowned media brands worldwide. For more details, visit our website. Solutions Why Statista See why Statista is the trusted choice for reliable data and insights. We provide one platform to simplify research and support your strategic decisions. Learn more By Industry Academia Agencies Consultancies Consumer Goods Finance Tech By Function Marketing Research & Development Strategy By Use case Find the fact Tell the story Win the pitch Understand the market Develop your strategy Resource Hub Expert resources to inform and inspire. Success stories Live webinars & recordings Prices & Access Business Solutions Academia and Government statista.com statista.de statista.es statista.fr Login Market Insights Mobility Electric Vehicles - Worldwide Worldwide Highlights In 2025, the revenue in the Electric Vehicles market is projected to reach a staggering US$784.2bn worldwide. Looking ahead, it is expected that the market will demonstrate a steady annual growth rate (CAGR 2025-2029) of 6.01%. This growth will ultimately lead to a projected market volume of US$990.4bn by 2029. Moreover, the unit sales of Electric Vehicles market are anticipated to reach 17.36m vehicles units by 2029. When examining the market in 2025, it is predicted that the volume weighted average price of Electric Vehicles market will amount to US$57.4k. From an international perspective, it is evident that China will generate the highest revenue, with an estimated US$377bn in 2025. This showcases the significant presence of Electric Vehicles market in the Chinese market segment. Electric vehicle adoption is rapidly increasing worl', 'images': [], 'rank': 5}, {'url': 'https://www.fortunebusinessinsights.com/industry-reports/electric-vehicle-market-101678', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://about.bnef.com/insights/clean-transport/global-electric-vehicle-sales-set-for-record-breaking-year-even-as-us-market-slows-sharply-bloombergnef-finds/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://evcurvefuturist.com/2025/02/global-ev-sales-2024-final-figures-and-key-insights/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T009"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Gather data on current electric vehicle market trends from various online sources.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Retrieve comprehensive data on current electric vehicle market trends, including sales figures, market share, growth rates, and regional variations. Focus on reports from reputable market research firms, news articles from reliable sources, and publications from industry associations.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "completed",
      "output": {
        "ev_market_data": [
          {
            "type": "text",
            "text": "[{'url': 'https://ourworldindata.org/electric-car-sales', 'content': 'Tracking global data on electric vehicles - Our World in Data Our World in Data Browse by topic Data Insights Resources About Subscribe Donate Gdoc / Admin Home Energy Tracking global data on electric vehicles Explore data on electric car sales and stocks worldwide. By: Hannah Ritchie First published in February 2024. Last updated in May 2025. Cite this article Reuse our work freely Electric vehicles are an essential solution to decarbonizing transport. Electric cars tend to have a lower carbon footprint than petrol or diesel cars over their lifetimes. While more carbon is emitted in the manufacturing stage, this carbon debt tends to pay off quickly once theyre on the road. 1 The carbon savings are higher in countries with a cleaner electricity mix , and these savings will also increase as countries continue to decarbonize their electricity grids. How quickly are countries moving to electrified transport? Which countries are leading the way? In this article, we look at data from across the world on electric vehicle (EV) sales and the stock on the road. This data comes from the International Energy Agency . It publishes its Global EV Outlook every year. We will update this data every time a new release is published. 2 Sales of new cars What share of new cars are electric? Sales of electric cars started from a low base but are growing quickly in many markets. Globally, over 1-in-5 (22%) of new cars sold were electric in 2024. This share was 92% in Norway, and in China, it was almost 50%. In the chart below, you can explore these trends across the world. Here, electric cars include fully battery-electric vehicles and plug-in hybrids . Fully-electric cars vs. plug-in hybrids Electric cars include battery-electric and plug-in hybrid vehicles. The difference is that fully battery-electric cars do not have an internal combustion engine. In contrast, plug-in hybrids have a rechargeable battery and electric motor, and an internal combustion engine that runs on gasoline. That means a plug-in hybrid could be driven as a standard petrol car if the owner did not charge the battery. The battery in plug-in hybrids is smaller and has a shorter range than battery-electric cars, so over longer distances, the car starts running on gasoline once the battery has run out. Since plug-in hybrids will often run on petrol, they tend to emit more carbon than battery-electric cars. However, they do usually have lower emissions than petrol or diesel cars. 3 In the first chart below you can see electric car sales broken down by these two technologies. This is given as a share of new cars sold each year. In the second, you will find the share of new electric cars sold that are fully battery-electric . How many new electric cars are sold each year? The chart below shows the total number of new electric cars sold. Again, this includes fully battery-electric and plug-in hybrids . Clicking on any country will show how sales have changed over time. How many new internal combustion engine cars and electric cars are sold each year? Based on the data published by the IEA on the number of electric cars sold, and EV sales as a share of all new cars, we can calculate the absolute number of new cars of each type sold each year. These figures suggest that global sales of non-electric cars peaked in 2018. This aligns with other estimates published elsewhere; for example, Bloomberg New Energy Finance reported that sales peaked in 2017. You can explore this data for other countries in the chart below, too. Stocks of cars in use What share of cars on the road are electric? The cars that are on the road today represent sales data over more than a decade. This can be captured in a metric called stocks. Its an approximation of the number of cars that are in use and represents the balance of cars being added and those that are being retired. Because people use their cars for a long time, it takes time before new sales have a visible influence on car stocks. That means the share', 'images': [], 'rank': 1}, {'url': 'https://www.iea.org/reports/global-ev-outlook-2024/trends-in-electric-cars', 'content': \"Trends in electric cars Global EV Outlook 2024 Analysis - IEA IEA Close Search Search About News Events Programmes Help centre IEA Skip navigation Search Energy system Chevron down Explore the energy system by fuel, technology or sector Fossil Fuels Renewables Electricity Low-Emissions Fuels Transport Industry Buildings Energy Efficiency and Demand Carbon Capture Utilisation and Storage Decarbonisation Enablers Buildings Energy Efficiency and Demand Carbon Capture Utilisation and Storage Decarbonisation Enablers Explore all Topics Chevron down Understand the biggest energy challenges Energy Security Artificial Intelligence Critical Minerals Access and Affordability Energy Innovation Investment Climate Change COP28: Tracking the Energy Outcomes Net Zero Emissions Russia's War on Ukraine Climate Change COP28: Tracking the Energy Outcomes Net Zero Emissions Russia's War on Ukraine Energy and Gender Energy and Water Fossil Fuel Subsidies Saving Energy Global Energy Crisis The IEA's 50th Anniversary All topics Countries Chevron down Explore the energy system by country or region Member countries Australia Austria Belgium Canada Czechia Denmark Estonia Finland France Germany Greece Hungary Ireland Italy Japan Korea Latvia Lithuania Luxembourg Mexico New Zealand Norway Poland Portugal Slovak Republic Spain Sweden Switzerland The Netherlands Trkiye United Kingdom United States Accession countries Chile Colombia Costa Rica Israel Association countries Argentina Brazil China Egypt India Indonesia Kenya Morocco Senegal Singapore South Africa Thailand Ukraine All Countries and Regions Data Chevron down Use, download and buy global energy data Data explorers Understand and manipulate data with easy to use explorers and trackers Data explorers Data sets Free and paid data sets from across the energy system available for download Data sets Policies database Past, existing or planned government policies and measures Policies database Chart Library Access every chart published across all IEA reports and analysis Chart Explore data Reports Chevron down Read the latest analysis from the IEA Oil Market Report - July 2025 Fuel report  July 2025 Energy and AI Flagship report  April 2025 Energy Technology Perspectives 2024 Flagship report  October 2024 World Energy Outlook 2024 Flagship report  October 2024 All reports Search Bag 1 User Profile Search Sign In Flyout close You are connecting via IP recognition from . If you wish to proceed, click on Connect . If you prefer to log into your personal account, please sign in below. Connect Connect OR Email          * Error Password          * Forgot password? Eye Error Sign in Sign in Create an account Create a free IEA account to download our reports or subcribe to a paid service. Join for free Join for free Important message for WDS users The IEA has discontinued providing data in the Beyond 2020 format (IVT files and through WDS). Data is now available through the .Stat Data Explorer, which also allows users to export data in Excel and CSV formats. Read documentation cross logo Open Navigation Contents Cite Share Download full report arrow-down arrow-down-24 Trends in electric cars Close Side navigation Executive summary Trends in electric cars Electric car sales Electric car availability and affordability Trends in other light-duty electric vehicles Electric two- and three-wheelers Electric light commercial vehicles Trends in heavy electric vehicles Electric truck and bus sales Electric heavy-duty vehicle model availability Trends in electric vehicle charging Charging for electric light-duty vehicles Charging for electric heavy-duty vehicles Trends in electric vehicle batteries Battery supply and demand Battery prices Trends in the electric vehicle industry Electric vehicle company strategy and market competition Electric vehicle and battery start-ups Outlook for electric mobility Vehicle outlook by mode Vehicle outlook by region The industry outlook Outlook for electri\", 'images': [{'url': 'https://iea.imgix.net/727f5e9d-39d4-4b20-9e8f-fa9c19474abd/shutterstock_2135903469.jpg?auto=compress%2Cformat&fit=min&q=80&rect=0%2C0%2C4400%2C2475&w=600&h=338&fit=crop&fm=jpg&q=70&auto=format', 'alt_text': 'Oil and natural gas supply', 'confidence': 0.7}, {'url': 'https://iea.imgix.net/298dbf91-1765-4367-96bc-dc65b182f3be/RenewablesMarketUpdate2023_FLIPPED_shutterstock_366229667.jpg?auto=compress%2Cformat&fit=min&q=80&rect=0%2C467%2C4500%2C2533&w=600&h=338&fit=crop&fm=jpg&q=70&auto=format', 'alt_text': 'Photo depicts a solar panels and windmills in the power plant', 'confidence': 0.7}, {'url': 'https://iea.imgix.net/c2a6cd9b-85a4-446f-92b2-ff103b55c442/shutterstock_1715825734.jpg?auto=compress%2Cformat&fit=min&q=80&rect=%2C%2C%2C&w=600&h=338&fit=crop&fm=jpg&q=70&auto=format', 'alt_text': 'photo from the perspective of looking up to the top of electricity tower pylons with a colorful blue and yellow background in the sky', 'confidence': 0.7}, {'url': 'https://iea.imgix.net/027dc74f-71b5-4941-b375-b23ed5ead025/shutterstock_2023277612.jpg?auto=compress%2Cformat&fit=min&q=80&rect=251%2C0%2C5476%2C3084&w=600&h=338&fit=crop&fm=jpg&q=70&auto=format', 'alt_text': 'Low-emission fuels', 'confidence': 0.7}, {'url': 'https://iea.imgix.net/2c2efb95-62d6-438f-afda-cfd3b05a02c6/guillaume-techer-XvNPUh6fWVk-unsplash.jpg?auto=compress%2Cformat&fit=min&q=80&rect=0%2C530%2C3963%2C2233&w=600&h=338&fit=crop&fm=jpg&q=70&auto=format', 'alt_text': 'Tracking industry', 'confidence': 0.7}], 'rank': 2}, {'url': 'https://www.grandviewresearch.com/industry-analysis/electric-vehicles-ev-market', 'content': 'Electric Vehicle Market Size & Share | Industry Report, 2030 Grand View Research Logo Toggle navigation Reports Consumer Goods Beauty & Personal Care Clothing, Footwear & Accessories Consumer F&B Electronic & Electrical Homecare & Decor Semiconductors & Electronics Display Technologies Electronic Security Systems Electronic Devices Semiconductors Sensors & Controls Specialty & Fine Chemicals Catalysts and Enzymes Food Additives and Nutricosmetics Renewable Chemicals Specialty and Bio-based Polymers Food & Beverages Animal Feed & Feed Additives Food Safety & Processing Nutraceuticals & Functional Foods Processed & Frozen Foods Advanced Materials Advanced Interior Materials Green Building Materials Micro Molding and Microspheres Nanoparticles Smart Textiles Glass, Ceramics and Fibers Healthcare Biotechnology Clinical Diagnostics Healthcare IT Medical Devices Medical Imaging Pharmaceuticals Animal Health Technology Automotive and Transportation Communications Infrastructure Communication Services Digital Media HVAC & Construction Network Security Next Generation Technologies Bulk Chemicals Agrochemicals & Fertilizers Disinfectants & Preservatives Drilling & Extraction Equipments Organic Chemicals Paints, Coatings & Printing Inks Personal Care & Cosmetics Petrochemicals Plastics, Polymers & Resins Water & Sludge Treatment Services Brainshare Market Research Reports Full Time Engagement Custom Research Services Market Monitoring Subscription Compass Pipeline - Procurement Intelligence Astra ESG solutions Market Trend Reports Horizon About Us Who We Are Why Choose Us Research Methodology Client Testimonials Conferences Media Citations Contact Career Insights Research Insights Ongoing Reports Case Studies Press Room Blogs Login Home Automotive & Transportation Electric Vehicle Market Size & Share, Industry Report, 2030 GVR Report cover Electric Vehicle Market Size, Share & Trends Analysis Report By Vehicle Type, By Propulsion Type, By Drive Type, By Vehicle Speed, By Vehicle Class, By End-use, By Region, And Segment Forecasts, 2025 - 2030 Report ID: 978-1-68038-259-4 Number of Report Pages: 100 Format: PDF Historical Range: 2018 - 2023 Forecast Period: 2025 - 2030 Industry: Technology Report Summary Table of Contents Segmentation Methodology Request a FREE Sample Copy Electric Vehicle Market Summary The global electric vehicle market size was estimated at USD 1,328.08 billion in 2024 and is projected to reach USD 6,523.97 billion by 2030, growing at a CAGR of 32.5% from 2025 to 2030. Government policies and incentives worldwide are accelerating the adoption of Electric Vehicles (EVs). Key Market Trends & Insights The North America electric vehicle market is expected to grow at a moderate CAGR during the forecast period. The U.S. electric vehicle market is expected to grow at the fastest CAGR during the forecast period By propulsion, the battery electric vehicle segment dominated the market in 2024. By drive type, the front-wheel drive segment dominated the market in 2024. By vehicle speed, the 100MPH-125MPH segment dominated the market in 2024. Market Size & Forecast 2024 Market Size: USD 1,328.08 Billion 2030 Projected Market Size: USD 6,523.97 Billion CAGR (2025-2030): 32.5% Asia Pacific: Largest market in 2024 Many countries are implementing stringent emission regulations and providing subsidies, tax benefits, and other incentives to both consumers and manufacturers, encouraging the shift from internal combustion engine vehicles to electric alternatives. Besides, advancements in battery technology are significantly enhancing the range, performance, and affordability of EVs. Innovations such as solid-state batteries and improvements in lithium-ion batteries are reducing costs and increasing energy density, making EVs more appealing to consumers. The expansion of the transportation and logistics sectors significantly drives the rising demand for EVs. As global trade and e-commerce continue to surge, there is an increased', 'images': [{'url': 'https://www.grandviewresearch.com/static/img/research/electric-vehicle-market.webp', 'alt_text': 'Electric vehicle market size by region, and growth forecast (2025-2030)', 'title': 'Electric vehicle market size by region, and growth forecast (2025-2030)', 'width': '750', 'height': '422', 'confidence': 0.8999999999999999}, {'url': 'https://www.grandviewresearch.com/static/img/research/electric-vehicle-market-share.png', 'alt_text': 'Electric Vehicle Market Share, by End Use, 2024 (%)', 'title': 'Electric Vehicle Market Share, by End Use, 2024 (%)', 'confidence': 0.7}, {'url': 'https://www.grandviewresearch.com/static/img/research/electric-vehicle-market-trends-by-region.png', 'alt_text': 'Electric Vehicle Market Trends, by Region, 2025 - 2030', 'title': 'Electric Vehicle Market Trends, by Region, 2025 - 2030', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://caredge.com/guides/electric-vehicle-market-share-and-sales', 'content': 'Electric Vehicle Sales and Market Share (US - Q2 2025 Updates) - CarEdge New or Used New Used Inventory (Required) New Used Certified Make (Required) Make Acura Alfa Romeo Aston Martin Audi Bentley BMW Buick Cadillac Chevrolet Chrysler Dodge Ferrari FIAT Fisker Ford Genesis GMC Honda HUMMER Hyundai INFINITI Isuzu Jaguar Jeep Karma KIA Lamborghini Land Rover Lexus Lincoln Lotus Lucid Maserati Maybach Mazda McLaren Mercedes-Benz Mercury MINI Mitsubishi Nissan Oldsmobile Plymouth Polestar Pontiac Porsche RAM Rivian Rolls-Royce Saab Saturn Scion Smart Sterling Subaru Suzuki Tesla Toyota Volkswagen Volvo Model (Required) Model A5 CL CSX EL ILX Integra Legend MDX NSX RDX RL RLX RSX TL TLX TSX Vigor ZDX 164 4C 8C Competizione GT Giulia Spider Stelvio Veloce Convertible DB11 DB7 DB9 DBS DBS Superleggera DBX Rapide V12 Vantage V8 V8 Vantage V8 Vantage Roadster V8 Vantage Roadster SPORTSHIFT V8 Vantage SPORTSHIFT Vanquish Vantage Virage 100 2 A3 A3 Cabriolet A3 Sedan A3 Sportback e-tron A4 A4 allroad A5 A5 Cabriolet A5 Coupe A5 Sportback A6 A6 Allroad A7 A8 Allroad Quattro Allroad quattro Cabriolet Convertible Coupe GT Q3 Q4 Sportback e-tron Q4 e-tron Q5 Q5 Sportback Q7 Q8 Q8 e-tron Q8 e-tron Sportback R8 RS 3 RS 5 RS 5 Cabriolet RS 5 Coupe RS 5 Sportback RS 6 Avant RS 7 RS Q8 RS e-tron GT RS3 RS4 RS5 RS5 Sportback RS6 RS6 Avant RS7 S3 S4 S5 S5 Cabriolet S5 Coupe S5 Sportback S6 S7 S8 SQ5 SQ5 Sportback SQ7 SQ8 Sport TT TT Coupe TT RS TT Roadster TTS TTS Coupe allroad e-tron e-tron GT e-tron S e-tron S Sportback e-tron Sportback Arnage Azure Bentayga Brooklands Continental Continental Flying Spur Continental GT Continental GTC Continental Supersports Eight Flying Spur Mulsanne Turbo 1 Series 2 Series 3 Series 300 320 323 325 328 335 4 Series 5 Series 6 Series 6 Series Convertible 6 Series Coupe 6 Series Gran Coupe 6 Series Gran Turismo 7 Series 740 8 Series 850 900 ALPINA B6 Gran Coupe CC Convertible Coupe F-650 F-800 F700 G GS GT I3 I8 L7 M M Series M2 Coupe M3 M3 Sedan M4 Convertible M4 Coupe M440i M5 M5 Sedan M6 M6 Convertible M6 Coupe M6 Gran Coupe M8 Convertible M8 Coupe M8 Gran Coupe R18 Roadster X1 X2 X3 X3 M X4 X4 M X5 X5 M X6 X6 M X7 XM Z3 Z4 Z8 i3 i4 i7 i8 iX Allure Cascada Century Convertible Electra Enclave Encore Encore GX Envision Envista LaCrosse LeSabre Lucerne Park Avenue Rainier Reatta Regal Regal Sportback Regal TourX Rendezvous Riviera Roadmaster Skylark Terraza Verano ATS ATS Coupe ATS Sedan ATS-V Coupe ATS-V Sedan Allante Brougham CT4 CT4-V CT5 CT5-V CT6 CTS CTS Coupe CTS Sedan CTS Sport Sedan CTS Sport Wagon CTS-V Coupe CTS-V Sedan CTS-V Sport Sedan CTS-V Sport Wagon Catera Cimarron DTS DeVille ELR Eldorado Escalade Escalade ESV Escalade EXT Fleetwood LYRIQ Professional Chassis SRX STS Seville W42 XLR XT4 XT5 XT6 XTS 3500 4500 Astro Astro Cargo Astro Passenger Avalanche Aveo Aveo5 B7T042 Beretta Blazer Bolt EUV Bolt EV C series C10 C1500 C20 C2500 C30 C3500 C4500 C5500 C6000 C65 C6500 C7500 C8500 Camaro Caprice Caprice/Impala Captiva Sport Cavalier Celebrity Chevette Chevy Van Citation City Express Classic Classic Silverado Cobalt Colorado Convertible Corsica Corvette Cruze Cruze Limited D10 D30 El Camino Equinox Explorer Express Express Cargo Express Cutaway Express G1500 Express G2500 Express G3500 Express G4500 Express Passenger G-P G10 G20 G30 GMT400 Geo Prizm HHR Impala Impala Limited K10 K1500 K20 K2500 K30 K3500 Kodiak Low Cab Forward Lumina Malibu Malibu Classic Malibu Limited Malibu Maxx Metro Monte Carlo Nova Orlando P30 PS6500 Prizm R10 R20 R30 R3500 S-10 SS SSR Silverado Silverado 1500 Silverado 1500 LD Silverado 1500 Limited Silverado 1500HD Silverado 2500 Silverado 2500HD Silverado 3500 Silverado 3500 Chassis Cab Silverado 3500HD Silverado 4500 Silverado 4500 Medium Duty Chassis Cab Silverado 4500HD Silverado 5500HD Silverado 5500XD Silverado Classic 1500 Silverado Classic 1500HD Silverado Classic 2500HD Silverado Classic 3500 Silverado Classic 3500 Chassis Cab Silverado LD 1500 Silverado MD Sonic Spa', 'images': [{'url': 'https://caredge.com/wp-content/uploads/2024/10/2024-Chevrolet-Equinox-EV-1LT-103-edited-1024x576.jpg', 'alt_text': 'EV market share 2025 update', 'width': '1024', 'height': '576', 'class': 'wp-image-234564', 'confidence': 0.8999999999999999}, {'url': 'https://caredge.com/wp-content/uploads/2024/04/EV-market-share-Q4-2023-1024x536.png', 'alt_text': 'Electric vehicle market share over time 2010 - 2024', 'width': '1024', 'height': '536', 'class': 'wp-image-226797', 'confidence': 0.8999999999999999}, {'url': 'https://caredge.com/wp-content/uploads/2025/04/2025-Toyota-Grand-Highlander-400x250.jpg', 'alt_text': 'The Fastest and Slowest Selling SUVs in 2025', 'width': '400', 'height': '250', 'confidence': 0.8999999999999999}, {'url': 'https://caredge.com/wp-content/uploads/2023/04/trouble-selling-trucks-400x250.png', 'alt_text': 'The Fastest and Slowest Selling Trucks in 2025', 'width': '400', 'height': '250', 'confidence': 0.8999999999999999}, {'url': 'https://caredge.com/wp-content/uploads/2025/07/Questions-to-ask-when-buying-a-used-car-400x250.jpg', 'alt_text': 'Questions to Ask When Buying a Used Car', 'width': '400', 'height': '250', 'confidence': 0.8999999999999999}], 'rank': 4}, {'url': 'https://www.statista.com/outlook/mmo/electric-vehicles/worldwide', 'content': 'Electric Vehicles - Worldwide | Statista Market Forecast Skip to main content Open Statistics All Industries Consumer Goods & FMCG E-Commerce Economy & Politics Energy & Environment Internet Technology & Telecommunications Transportation & Logistics Travel, Tourism & Hospitality Reports Report Shop Search our report database Digital & Trend reports Overview and forecasts on trending topics Industry & Market reports Industry and market insights and forecasts Companies & Products reports Key figures and rankings about companies and products Consumer & Brand reports Consumer and brand insights and preferences in various industries Politics & Society reports Detailed information about political and social topics Country & Region reports All key figures about countries and regions Find your information in our database containing over 20,000 reports Insights Market Insights Market forecast and expert KPIs for 1000+ markets in 190+ countries & territories Explore Market Insights Consumer eCommerce Mobility Consumer Insights Insights on consumer attitudes and behavior worldwide 3,000,000+ interviews 15,000+ brands Explore Consumer Insights eCommerce Insights Detailed information for 39,000+ online stores and marketplaces 70+ KPIs per store Revenue analytics and forecasts Explore eCommerce Insights Research AI NEW Daily Data Services The statistics portal Directly accessible data for 170 industries from 150+ countries and over 1 million facts: More about Statista About Statista Why trust Statista First steps and help center Webinar & Training Hub Statista Connect Services Statista+ offers additional, data-driven services, tailored to your specific needs. As your partner for data-driven success, we combine expertise in research, strategy, and marketing communications. Research Full-service market research and analytics Customized market research Data analytics Ad hoc research \"askStatista\" Research Solutions Strategy Strategy and business building for the data-driven economy Build strategies Create data value Realize business opportunities Strategy Consulting Communication Transforming data into content marketing and design: Data storytelling Creative assets Distribution Communication Services Statista R identifies and awards industry leaders, top providers, and exceptional brands through exclusive rankings and top lists in collaboration with renowned media brands worldwide. For more details, visit our website. Solutions Why Statista See why Statista is the trusted choice for reliable data and insights. We provide one platform to simplify research and support your strategic decisions. Learn more By Industry Academia Agencies Consultancies Consumer Goods Finance Tech By Function Marketing Research & Development Strategy By Use case Find the fact Tell the story Win the pitch Understand the market Develop your strategy Resource Hub Expert resources to inform and inspire. Success stories Live webinars & recordings Prices & Access Business Solutions Academia and Government statista.com statista.de statista.es statista.fr Login Market Insights Mobility Electric Vehicles - Worldwide Worldwide Highlights In 2025, the revenue in the Electric Vehicles market is projected to reach a staggering US$784.2bn worldwide. Looking ahead, it is expected that the market will demonstrate a steady annual growth rate (CAGR 2025-2029) of 6.01%. This growth will ultimately lead to a projected market volume of US$990.4bn by 2029. Moreover, the unit sales of Electric Vehicles market are anticipated to reach 17.36m vehicles units by 2029. When examining the market in 2025, it is predicted that the volume weighted average price of Electric Vehicles market will amount to US$57.4k. From an international perspective, it is evident that China will generate the highest revenue, with an estimated US$377bn in 2025. This showcases the significant presence of Electric Vehicles market in the Chinese market segment. Electric vehicle adoption is rapidly increasing worl', 'images': [], 'rank': 5}, {'url': 'https://www.fortunebusinessinsights.com/industry-reports/electric-vehicle-market-101678', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://about.bnef.com/insights/clean-transport/global-electric-vehicle-sales-set-for-record-breaking-year-even-as-us-market-slows-sharply-bloombergnef-finds/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://evcurvefuturist.com/2025/02/global-ev-sales-2024-final-figures-and-key-insights/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-25T11:20:31.478552",
      "end_time": "2025-07-25T11:21:19.424364",
      "execution_time": 47.945812,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T002",
      "description": "Research consumer preferences and adoption patterns related to electric vehicles.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Investigate consumer preferences regarding electric vehicles, including factors influencing purchase decisions such as range, price, charging infrastructure, and environmental concerns. Analyze consumer surveys, feedback from EV owners, and reports on adoption rates in different demographics.",
      "reads": [],
      "writes": [
        "T002"
      ],
      "status": "running",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-25T11:21:24.446165",
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T003",
      "description": "Investigate technological advancements in electric vehicle technology, including battery technology, charging infrastructure, and autonomous driving features.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Gather information on the latest technological advancements in electric vehicle technology. Focus on improvements in battery energy density, charging speeds, the development of charging infrastructure, and the integration of autonomous driving features. Consult technical journals, industry publications, and reports from research institutions.",
      "reads": [],
      "writes": [
        "T003"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T004",
      "description": "Analyze government policies and incentives affecting the electric vehicle market, including subsidies, tax credits, and emission regulations.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Research government policies and incentives designed to promote the adoption of electric vehicles. Analyze the impact of subsidies, tax credits, emission regulations, and other policy measures on the EV market. Gather information from government websites, policy reports, and legal databases.",
      "reads": [],
      "writes": [
        "T004"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T005",
      "description": "Synthesize and analyze the data collected from T001, T002, T003, and T004 to identify key trends and insights in the electric vehicle market.",
      "agent": "ThinkerAgent",
      "agent_prompt": "Synthesize the data collected on market trends, consumer preferences, technological advancements, and government policies to identify key trends and insights in the electric vehicle market. Analyze the relationships between these factors and their impact on the overall market dynamics. Identify emerging opportunities and potential challenges for EV manufacturers and stakeholders.",
      "reads": [
        "T001",
        "T002",
        "T003",
        "T004"
      ],
      "writes": [
        "T005"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T006",
      "description": "Create a detailed analysis report summarizing the findings from T005, including an executive summary, market overview, trend analysis, and future outlook.",
      "agent": "FormatterAgent",
      "agent_prompt": "Based on the synthesized data and insights from T005, create a detailed analysis report on the electric vehicle market. The report should include an executive summary, a market overview, an in-depth trend analysis, and a future outlook. Ensure the report is well-structured, clearly written, and visually appealing, with appropriate headings, subheadings, and formatting. Pass data from T005.",
      "reads": [
        "T005"
      ],
      "writes": [
        "T006"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T007",
      "description": "Create visualizations of sales data and market share trends for the EV market, for inclusion in T006.",
      "agent": "CoderAgent",
      "agent_prompt": "Generate Python code using Matplotlib and Seaborn to create visualizations of sales data and market share trends for the EV market. Create line charts showing sales growth over time, bar charts comparing market share of different EV manufacturers, and pie charts illustrating regional variations in EV adoption. Ensure the visualizations are clear, informative, and visually appealing. Save the visualizations as PNG image files, named sales_trends.png, market_share.png and regional_adoption.png. The data to be used for this visualization will be available in the data provided from T005. Placeholder in report where these visualization needs to go, so next CoderAgent can update the report.",
      "reads": [
        "T005"
      ],
      "writes": [
        "T007"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T008",
      "description": "Create visualizations of technological advancements in EV technology, for inclusion in T006.",
      "agent": "CoderAgent",
      "agent_prompt": "Generate Python code using Matplotlib and Seaborn to create visualizations of technological advancements in EV technology. Create scatter plots showing the relationship between battery energy density and charging speeds, bar charts comparing the range of different EV models, and heatmaps illustrating the adoption of autonomous driving features. Ensure the visualizations are clear, informative, and visually appealing. Save the visualizations as PNG image files, named battery_tech.png, ev_range.png and autonomous_features.png. The data to be used for this visualization will be available in the data provided from T005. Placeholder in report where these visualization needs to go, so next CoderAgent can update the report.",
      "reads": [
        "T005"
      ],
      "writes": [
        "T008"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T009",
      "description": "Integrate the visualizations from T007 and T008 into the analysis report created in T006 and finalize the report.",
      "agent": "FormatterAgent",
      "agent_prompt": "Integrate the visualizations generated in T007 and T008 into the analysis report created in T006. Insert the visualizations at appropriate locations within the report, ensuring they are properly labeled and captioned. Finalize the report by adding a conclusion and recommendations. Pass all the data from T006 and tell FormatterAgent to include the visualization images created in T007 and T008.",
      "reads": [
        "T006",
        "T007",
        "T008"
      ],
      "writes": [
        "T009"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "ROOT",
      "target": "T002"
    },
    {
      "source": "ROOT",
      "target": "T003"
    },
    {
      "source": "ROOT",
      "target": "T004"
    },
    {
      "source": "T001",
      "target": "T005"
    },
    {
      "source": "T002",
      "target": "T005"
    },
    {
      "source": "T003",
      "target": "T005"
    },
    {
      "source": "T004",
      "target": "T005"
    },
    {
      "source": "T005",
      "target": "T006"
    },
    {
      "source": "T005",
      "target": "T007"
    },
    {
      "source": "T005",
      "target": "T008"
    },
    {
      "source": "T006",
      "target": "T009"
    },
    {
      "source": "T007",
      "target": "T009"
    },
    {
      "source": "T008",
      "target": "T009"
    }
  ]
}